{
   "thread number": "117577",
   "original post": " Vent thread Anonymous 10/08/24 (Tue) 08:29:42 PM117577Previous >>115513",
   "reply_117578": {
      "reply id": "reply_117578",
      "content": "Anonymous 10/08/24 (Tue) 08:55:47 PM117578If you had a similar experience before please please help me. >bf and I started dating 1 year ago >since then we have had plenty of problems mainly due to me>I haven’t cheated on him but the first huge crisis was because I got confused on my feelings for a girl coworker >plenty of micro fights and conflicts over the time because we don’t understand each other, we have different ways of communicate and expressing love >second big crisis was me telling him I yearn for a ex classmate and I had dreams of him >I broke with him after this >oh no no no.jpg>beg him to come back but now we aren’t an official couple, we refer to each other as bf/gf though >we still talk, he’s damaged but I’m trying to gain his love and trust >he’s been distant, we don’t talk for chat except for gn/gm, he’s also busy with work, studies, gym>told him I feel displaced >he says he’s focusing on himself and that I’m always feeling like shit so I bring him down>”work on yourself you need to get better”>he’s paying for my therapist and other medical appointments >currently suffering of chronic fatigue due to unknown causes so I don’t work nor study >today had a new breakdown because he doesn’t talk to me at all, we only saw each other on Saturday and then the chat died >finally says he doesn’t love me like he used to do>I knew I love him more than he loves me now but before all the problems it was the other way around>”do you think you could love me as much as before again?” >”I tried but I doubt so”>been crying for hours >called me, asked him if it’s the right thing for him to end it all>”I will not break with you in the state you are”>”you need to get better”He doesn’t talk me because he doesn’t feel like it. He’s not enthusiastic about me unless we are physically together. He says we always have problems through the chat and it’s true. The relationship it’s crumbling and what’s hurt the most is I don’t have his whole love anymore. I know this is getting unhealthy for me and him but I don’t want to let him go. I adore everything about him, he’s such a nice man. He’s 21 and I’m 23. I think once we mature enough he could love me as much again if I don’t fuck it up. But rn this is tearing apart specially because I don’t do shit for my life except cleaning the house, going to the gym and rot in bed. I feel so tired I can’t do more than the basic. I couldn’t stand seeing him with another woman I’d rather kys. Him saying he doesn’t love me unconditionally anymore destroys me inside like I’m being stabbed in my chest.Please help me. I’m downing here in my misery and it’s also raining fuckkk. Awful day. Be brutally honest or be compassionate. Just help me. I want him to love me. I want to be his priority and I’m no longer am. I used to be."
   },
   "reply_117579": {
      "reply id": "reply_117579",
      "content": "Anonymous 10/08/24 (Tue) 09:06:16 PM117579>>117577Why is that toothless, slimy thing suddenly everywhere?"
   },
   "reply_117581": {
      "reply id": "reply_117581",
      "content": "Anonymous 10/08/24 (Tue) 09:11:10 PM117581>>117579it's a baby hippo"
   },
   "reply_117583": {
      "reply id": "reply_117583",
      "content": "Anonymous 10/08/24 (Tue) 09:32:42 PM117583>>117579Its name is Moo Deng and it's a baby hippo.I think it's ugly."
   },
   "reply_117584": {
      "reply id": "reply_117584",
      "content": "Anonymous 10/08/24 (Tue) 09:32:42 PM117584>>117581Looks deranged, like its in chronic mental pain. Brave, little soul, someone should put it down."
   },
   "reply_117586": {
      "reply id": "reply_117586",
      "content": "Anonymous 10/08/24 (Tue) 09:40:12 PM117586Started uni again after the first time I dropped out and had a breakdown. Not surprised to say nothing's changed the only person I talk to regularly is the Chinese girl that nobody else talks to. I don't know why it feel so medically impossible for me to have friends or fun or I guess I do know I'm just a depressive hole. AND now I'm home alone with no friends and a cold waaaaa poor me."
   },
   "reply_117589": {
      "reply id": "reply_117589",
      "content": "Anonymous 10/08/24 (Tue) 09:46:02 PM117589>>117586I get you nona, I also feel like it's medically impossible for me to make new friends. Whenever I try to talk to new people my brain turns off and I forget any and all conversation topics"
   },
   "reply_117592": {
      "reply id": "reply_117592",
      "content": "Anonymous 10/08/24 (Tue) 11:30:11 PM117592>>117583>>117584Imagine being a contrarian over a little hippo. Embarrassing."
   },
   "reply_117599": {
      "reply id": "reply_117599",
      "content": "Anonymous 10/09/24 (Wed) 07:33:03 AM117599>>117592People are allowed to not like things and find stuff visually unappealing."
   },
   "reply_117605": {
      "reply id": "reply_117605",
      "content": "Anonymous 10/09/24 (Wed) 02:08:44 PM117605>>117578>relationship is  crumblingim afraid there  is no real relationship left, anon. ive been in  a similar situation and  theres not  much you can do. you cannot force something that isnt there and  expect things to be the same. youve fucked up in the past and  hes totally over your depressoid bull. he seems  likes he trying to distance  himself and  fix you at the same time so when he leaves  it wont be such  a toll on you."
   },
   "reply_117609": {
      "reply id": "reply_117609",
      "content": "Anonymous 10/09/24 (Wed) 06:31:18 PM117609>>117580say \"my bmi and weight are x and x. only a damaged person would write this lol\">>117589sounds like you need to learn how to be relaxed around new people, easier said than done"
   },
   "reply_117638": {
      "reply id": "reply_117638",
      "content": "Anonymous 10/10/24 (Thu) 03:02:48 PM117638 20241008_215539.jp… I have issues handling rejection and fucking failure, i cant confront anyone properly at times. also cant believe fucking moids are so insensitive. why cant they just be more emphatic? is it that hard to put away the logical answers knowing that im still trying to process things?>me and my classmates had to do something for our work group regarding recording a band>last moment the band just dipped and we had nothing to work with>teacher blamed us for not bringing the band and seemed like he was just throwing all of the shit on us>stress skyrockets and feelings of failure go through the roof that i breakdown in the bathroom stall like a fucking maniac>girl from my group was the only one who escorted me to the infirmary>still end up depressed after that and feel like my world was crumbling so easily>teacher tries to talk to me but gave me a motivational speech on like to look for positive things and that its still my fault, great job jackass>leaves me crying even harder>another teacher passes by while getting some air and he just laughed at me and tried to do the same thing of putting things on a balance blah blah fuck you>only person who actually decided to comfort me was the psychologist who was a young woman>not even a single of my moid classmates in my group gave a shit abt me eitherI dont ask anyone to be an empath but i just notice this shit always with moids.I'm doing just fine with still a light headache, still regretting all of these cuts on my wrists but dont look so bad since they are bandaged. I just dont know exactly why i fear this constantly of failure or cant handle stress so easily. it was fine before but now i simply just spiral so easily that i already overdosed 2 times. im getting professional help but still a few days away from it."
   },
   "reply_117640": {
      "reply id": "reply_117640",
      "content": "Anonymous 10/10/24 (Thu) 04:41:57 PM117640>117638>stress skyrockets and feelings of failure go through the roof that i breakdown in the bathroom stall like a fucking maniac>girl from my group was the only one who escorted me to the infirmaryDoes your school have mixed gender bathrooms? Based on the way your story is written it appears like no men would have been in a position to escort you because they wouldn't have been in the womens' bathroom."
   },
   "reply_117641": {
      "reply id": "reply_117641",
      "content": "Anonymous 10/10/24 (Thu) 04:52:41 PM117641>>117640Forgot to tell but after I broke down I went to the recording studio where all my classmates were there, though they all saw my wrists, the only one who took initiative was that girl. I don't mind that much its just that the guys were kinda slow at catching up with me and didnt give a shit at all abt asking me anything. Whatever its all done."
   },
   "reply_117642": {
      "reply id": "reply_117642",
      "content": "Anonymous 10/10/24 (Thu) 04:57:47 PM117642>>117641Also no, we dont have mixed gender bathrooms, thankfully."
   },
   "reply_117648": {
      "reply id": "reply_117648",
      "content": "Anonymous 10/10/24 (Thu) 07:02:28 PM117648 cute yash.jpg >>117634You can join local clubs relating to your interest, go to the library, or take up volunteer work to find new people. If you have any friends, ask to meet their friends! I know all of these things seem tiresome but unfortunately, you do have to put in effort in order to create relationships with other people.I used to have the same problem as you, Nona. I was tired of being lonely and barely having friends until I made the effort to reach out to the people around me. Now I have girlfriend and a whole lotta friends that I love and appreciate. It might seem hard at first, you won't make friends with everyone, but it will all be worth it in the end. You just need to start taking one step each day to reach your goals of a social life. I believe in you, Nona!!"
   },
   "reply_117666": {
      "reply id": "reply_117666",
      "content": "Anonymous 10/11/24 (Fri) 05:56:29 AM117666I feel like I can’t get along with anyone because I really hate movies and TV and it limits what I can talk to people about. Watching them makes me feel sick and disturbed when I know how the film industry exploits women, and seeing sex or nudity in movies and shows just sends me straight into a suicidal doom spiral because it just drives it further home that all humanity just sees the sexual objectification of women as entertaining. It makes me sick."
   },
   "reply_117668": {
      "reply id": "reply_117668",
      "content": "Anonymous 10/11/24 (Fri) 11:18:54 AM117668They keep calling me animal names and degrading and abusing me."
   },
   "reply_117670": {
      "reply id": "reply_117670",
      "content": "Anonymous 10/11/24 (Fri) 12:39:01 PM117670There's been multiple break-ins nearby and my housemate is gone for the weekend. I don't know how to confidently use his gun, he set up the cameras outside, that are now out of battery, so I can't reach them and I keep nervously using his thermal scope to scan the yard, but I don't know where the charging cable is and it's already down to 50% battery. I just feel really unsafe and I don't have anywhere or anyone else to stay with."
   },
   "reply_117673": {
      "reply id": "reply_117673",
      "content": "Anonymous 10/11/24 (Fri) 09:39:03 PM117673I'm dealing with constant false alarms with smoke detectors and it's stressing me out badly, mainly due to the extremely loud beeping getting on my nerves and giving me anxiety even though I know there's no emergency. Also constantly on edge wondering if it's going to beep again. Some people said dust or insects can trigger it so I cleaned them out and hopefully no more beeping. Would have just replaced right away but there are reports of false alarms with other brands too plus it's expensive."
   },
   "reply_117677": {
      "reply id": "reply_117677",
      "content": "Anonymous 10/11/24 (Fri) 10:47:48 PM117677>>117670If your housemate has guns, cameras, and thermal imaging technology, I think they may be a paranoid schizo."
   },
   "reply_117680": {
      "reply id": "reply_117680",
      "content": "Anonymous 10/12/24 (Sat) 12:19:37 AM117680a moid at work is being insufferable and i want to hit him with a stick and a brick.first he approached me in a mildly non-intrusive way, mentioned by bf so i thought it was ok. i was nice to him so of course now he pesters me endlessly for attention and sulks when i don't give it to him. buys me sweets, texts me, constantly invites me to events after work. the worst is that this slimy detestable scrote has the gall to act like an offended drama queen when i politely refuse his desperate pleas for attention. my work involves networking and one-on-one spontaneous casual meetings are essential. this shit is not only annoying, it's actually negatively affecting my career. i want to maim him."
   },
   "reply_117681": {
      "reply id": "reply_117681",
      "content": "Anonymous 10/12/24 (Sat) 01:18:30 AM117681>>117680HR now"
   },
   "reply_117684": {
      "reply id": "reply_117684",
      "content": "Anonymous 10/12/24 (Sat) 07:42:50 AM117684>>117677He was in the military, so he's into all that stuff, and he installed the cameras to make me feel safer. I really regret not going to the shooting range with him to learn how to use the gun.I looked it up online, but I don't want to risk screwing it up."
   },
   "reply_117685": {
      "reply id": "reply_117685",
      "content": "Anonymous 10/12/24 (Sat) 09:16:23 AM117685>>117677What's your reasoning? Not everyone lives in Japan."
   },
   "reply_117687": {
      "reply id": "reply_117687",
      "content": "Anonymous 10/12/24 (Sat) 02:08:32 PM117687So if my man is being raped to homosexuality, I’m in the right to encourage suicide, right? It’s a better fate. Men should be willing to fight and die to stay straight, but if they get rapped to homosexuality they become terminal. We love our men and understand that all guys are gays, but they’re supposed to overcome that and find freedom through marriage with a woman. All I’m saying, if I man is rapped to homosexuality against his will; that’s tantamount to murder on the side of the rapist and his death would be a mercy killing.Fight and die for the union"
   },
   "reply_117688": {
      "reply id": "reply_117688",
      "content": "Anonymous 10/12/24 (Sat) 02:27:10 PM117688>>117687You're insane and should actively seek help from a professional"
   },
   "reply_117689": {
      "reply id": "reply_117689",
      "content": "Anonymous 10/12/24 (Sat) 03:20:06 PM117689>>117687no anoushka what is wrong with you"
   },
   "reply_117692": {
      "reply id": "reply_117692",
      "content": "Anonymous 10/12/24 (Sat) 07:27:55 PM117692>>117687Is this trolling?"
   },
   "reply_117698": {
      "reply id": "reply_117698",
      "content": "Anonymous 10/12/24 (Sat) 10:37:13 PM117698>>117578>>117605I broke up with him but we got back bc the day we broke I went to his job to wait for him to talk. I’m deranged.He’s clearly less interested in me like before but he wants me to get better because I’m in a dark place mentally and physically which makes me drag him w me. It’s fair and I once was the one treating him like shit while he worshipped me. I don’t know if it’s deserved but is the natural course of things. Good thing>he doesn’t want to break up, he has faith in me and the relationship >wants to live together, marry, kids etc but only if I’m mentally stable >yesterday we joined together to a boxing club Bad thing>he doesn’t love me like the first months, probably will take a lot of time (or never) to reach that point again so he doesn’t show love the same way/frequency He’s busy as fuck and prioritizing himself so why I am so selfish? Do I adore him like never before just because he’s not giving me lots of attention and I’m afraid of losing him? Is he going to get bored of me at some point? I’m honestly tired of having an ache in my stomach and burning pain in my chest. I want to start enjoying food again. Stop obsessing over his fucking chat. Things aren’t over holy fuck. He loves me, he listen to my crazy rants and reassures me -in person bc he sucks at chat-. We will still see each other weekly…even if I’m more enthusiastic about it than him. If it were up to me I would live under his sheets. I’m frightened of being abandoned. Shaking and crying and throwing, make it stop. The logical circle in my mind>focus on myself, get better, b more disciplined, IMPROVE MY HEALTH (very important), get job, study>slowly shift attention to myself and my achievements instead of seething over him replying me 2 hours late >this clingy neediness disappear, I’m far more composed, I’m not extremely anxious with or without him >we still together, stonks So easy to say it but rn in the present moment I want to take my eyes and heart out"
   },
   "reply_117709": {
      "reply id": "reply_117709",
      "content": "Anonymous 10/13/24 (Sun) 06:12:33 AM117709>>117687you're so right queen"
   },
   "reply_117717": {
      "reply id": "reply_117717",
      "content": "Anonymous 10/13/24 (Sun) 10:21:37 AM117717I'm just gonna post this in the emptyness that is this place. It's very tiring to be there for a suicidal friend. Obviously, I won't let go off her because I love her and want the best. But it sucks that sometimes I can't really vent out my frustrations either to keep her afloat. I wonder if there are other people that are friends with depressed/suicidal people out there that feel the same. I just need to hear from people like you if possible. Trying to feel a bit less lonely. I'm trying my absolute best to make it better for her. I guess I wish I could cry a bit too because it hurts to see her hurting like this."
   },
   "reply_117738": {
      "reply id": "reply_117738",
      "content": "Anonymous 10/13/24 (Sun) 06:25:23 PM117738I had an abortion last Friday. Has anyone else here had one? What are your thoughts on the matter? My mom thought it was for the best and I believe she was right, but for some reason it ended up being a really heartbreaking experience. I've always wanted to be a young mother and this was probably my only chance. I'm 19 and I work in a grocery store, my boyfriend is broke most of the time because he's been having trouble finding jobs (he works for a construction company) and I don't have a high school diploma. Maybe I could have gotten my GED before giving birth and then it would have worked out, probably not. I'm still having cramps which are a side effect of the procedure. Now I am desperately trying to think of ways I can prepare myself so that we can have a baby in the next couple of years but my bf doesn't think I'll be ready, he wants to wait. I know he's right but I can't stop thinking. I see babies everywhere now… All I want is to hold my child."
   },
   "reply_117739": {
      "reply id": "reply_117739",
      "content": "Anonymous 10/13/24 (Sun) 07:02:56 PM117739>>117738PS. I'm not very good at articulating myself so I'm sorry if I sound like a dummy"
   },
   "reply_117740": {
      "reply id": "reply_117740",
      "content": "Anonymous 10/13/24 (Sun) 07:35:11 PM117740 GZouPc_WcAshSN2.pn… Every day that passes by I can't help but think that it'd be nice to permaban some people from existence"
   },
   "reply_117741": {
      "reply id": "reply_117741",
      "content": "Anonymous 10/13/24 (Sun) 11:46:53 PM117741wanting to dye my hair dark again so SO badly"
   },
   "reply_117744": {
      "reply id": "reply_117744",
      "content": "Anonymous 10/14/24 (Mon) 01:21:50 AM117744What is the likelihood of someone being too busy to text back….?"
   },
   "reply_117745": {
      "reply id": "reply_117745",
      "content": "Anonymous 10/14/24 (Mon) 01:33:17 AM117745>>117744It depends. Are they a busy person? What do they do for work?"
   },
   "reply_117746": {
      "reply id": "reply_117746",
      "content": "Anonymous 10/14/24 (Mon) 01:52:58 AM117746>>117738Damn nona. >it was really heartbreaking Killing your baby is heartbreaking, imagine that. Did you think at all before doing such a thing, or you just blindly listened to other people's opinions on whether the life inside you should be ended or not? And that your boyfriend was ok with killing his child, instead of being driven to find better, more stable employment to support his family, is scary, honestly. You should abstain from sex if you're not ready to have children."
   },
   "reply_117747": {
      "reply id": "reply_117747",
      "content": "Anonymous 10/14/24 (Mon) 02:07:55 AM117747>>117744highly unlikely if it's a moid"
   },
   "reply_117748": {
      "reply id": "reply_117748",
      "content": "Anonymous 10/14/24 (Mon) 02:17:50 AM117748>>117744If that person spends a lot of the time in the phone even while working then unlikely."
   },
   "reply_117749": {
      "reply id": "reply_117749",
      "content": "Anonymous 10/14/24 (Mon) 02:31:08 AM117749>>117746Be gone moid"
   },
   "reply_117750": {
      "reply id": "reply_117750",
      "content": "Anonymous 10/14/24 (Mon) 02:38:31 AM117750>>117745they work a job where the work shifts are 12 hours and sometimes they’re in areas that don’t have great reception.>>117747Really Nona….? He seemed nice though…. >>117748Well we hung out last week and he didn’t really get on his phone. He hasn’t been great at answering texts since we started talking but now I feel like something has changed. As in, he’s just done answering me and I don’t understand."
   },
   "reply_117751": {
      "reply id": "reply_117751",
      "content": "Anonymous 10/14/24 (Mon) 02:40:33 AM117751>>117750if he travels for work I'd say it may be pretty reasonable. you hung out so that's a good sign too"
   },
   "reply_117752": {
      "reply id": "reply_117752",
      "content": "Anonymous 10/14/24 (Mon) 02:41:57 AM117752>>117749>only moids care about unborn babies!!Deranged."
   },
   "reply_117754": {
      "reply id": "reply_117754",
      "content": "Anonymous 10/14/24 (Mon) 03:18:52 AM117754If you don’t like videogames that’s fine, but don’t belittle the entire medium just because of moids, some women have been playing videogames since the PS1 era."
   },
   "reply_117755": {
      "reply id": "reply_117755",
      "content": "Anonymous 10/14/24 (Mon) 03:21:21 AM117755>>117751I thought so. so I haven’t been super weird about texting. We met in person which is unusual and it was kind of cute how it happened. I feel like I ruined it though…"
   },
   "reply_117756": {
      "reply id": "reply_117756",
      "content": "Anonymous 10/14/24 (Mon) 04:33:22 AM117756>>117755How did it happen? If he seems nice you can give him the benefit of the doubt, but be careful, especially if you're not experienced with guys."
   },
   "reply_117760": {
      "reply id": "reply_117760",
      "content": "Anonymous 10/14/24 (Mon) 10:18:37 AM117760>>117752The only women who are anti abortion are religious crazy people, and it’s probably your parents or your husband who made you this way. Look for resources to help you get out of your abusive relationship, and get therapy if you can. You need to get this brainwashing out of your head."
   },
   "reply_117763": {
      "reply id": "reply_117763",
      "content": "Anonymous 10/14/24 (Mon) 04:35:13 PM117763 IMG_4694.jpeg >>117577My ex bf’s girlfriend made a post about me and asked how she can stop comparing herself to me, which I find pretty ironic considering the fact that he left her for me. He emotionally cheated on me with her and started dating her two weeks later. It’s been two years and assuming they have been together for two years, it’s pretty fucking funny to me that she’s insecure about the girl that her boyfriend left behind in the dust. I’m not even that pretty either. What could you possibly be comparing yourself for? Right before he broke up with me, I literally vented to him about how jealous I was of his friendship with her……. and he breaks up with me right after.  You literally won."
   },
   "reply_117764": {
      "reply id": "reply_117764",
      "content": "Anonymous 10/14/24 (Mon) 04:51:27 PM117764>>117760My family are all strongly pro-abortion and atheists. Imagine being such a misogynist that you think women can only adopt the opinions of the authority figures in her life instead of coming to her own conclusions. Take your own advice and talk to a doctor about your lack of empathy for the most vulnerable members of our people."
   },
   "reply_117765": {
      "reply id": "reply_117765",
      "content": "Anonymous 10/14/24 (Mon) 05:00:34 PM117765>>117756We met at work. I work as a cashier, and we would smile at each other. At first, I thought he was just being polite. Then he asked for my number. I don't think he’ll text me back, if I'm being honest with myself. I might have scared him off."
   },
   "reply_117769": {
      "reply id": "reply_117769",
      "content": "Anonymous 10/14/24 (Mon) 09:41:42 PM117769>>117765What do you think you've done to scare him off?"
   },
   "reply_117790": {
      "reply id": "reply_117790",
      "content": "Anonymous 10/15/24 (Tue) 02:32:06 PM117790>>117763can i ask where you saw her post about you? like how do u know if it was her"
   },
   "reply_117808": {
      "reply id": "reply_117808",
      "content": "Anonymous 10/16/24 (Wed) 01:12:06 PM117808 44cbd2c1aab773d517… I don't know if I should try to get a diving license or not. I think I'd love it and would maybe make a few friends but I don't want to sit on a boat half-naked with multiple middle-aged men for 20 minutes."
   },
   "reply_117809": {
      "reply id": "reply_117809",
      "content": "Anonymous 10/16/24 (Wed) 02:29:36 PM117809 IMG_3984.jpeg >>117764"
   },
   "reply_117810": {
      "reply id": "reply_117810",
      "content": "Anonymous 10/16/24 (Wed) 03:38:29 PM117810>>117809Not that anon, but why is an entire family being a pro-abortion and atheist unrealistic? A person largely gets the majority of their beliefs from their own family. Also, I have found that it is usually Americans who argue about abortion in terms of spirituality. In Iceland, people with Down Syndrome are straight-up aborted for instance so that they have almost no people with it (I am not saying this is a good or bad thing, just pointing out that very many people do not care about abortion or don't tie their spirituality/religion to it)"
   },
   "reply_117814": {
      "reply id": "reply_117814",
      "content": "Anonymous 10/16/24 (Wed) 09:24:46 PM117814Yeah I’m done being emotionally dependent to my bf. Can’t eat, can’t sleep, chest always hurts, addicted to our few interactions. What the fuck is this. Really. I already have a lot of problems myself and now I want his approval like a child with his parents. This madness gotta stop."
   },
   "reply_117816": {
      "reply id": "reply_117816",
      "content": "Anonymous 10/17/24 (Thu) 03:28:32 AM117816I'm sick of myself for being too scared to cut off people I want nothing to do with. I have this friend who, at times is great to be around, but most other times makes me feel awful. I care deeply for her, but she emits such a potent air of negativity.. like it feels dark, even evil at times. She is the only friend I have, yet I think I would be better off having no friends at all than to be around her.She cannot go two minutes without speaking negatively of people, even those that are supposed to be her friends. In the past, I confided in her and shared very personal information. I was foolish at the time and didn't understand her true nature. I just know she gossips about me to others. I know she calls me \"this bitch\" and a \"fucking weirdo\" because that's what she calls all of the other people in her life. I know that she must have shown other people our texts because she shows me other people's texts to her. If I were to end our friendship, I can't imaging what she would say about me to others. She's a person who violently latches onto others and then wonders why so few people in her life stay. There were multiple times when, if I didn't answer her texts within 30 minutes, she would walk to my building. She would slam on my bedroom window from outside to get my attention and to let her in, uninvited. It got to a point where I kept my curtains shut permanently just so I could hide from her. Just so I could feel free from her constant surveillance and leave my current location unknown. When things are going well for her, she tirelessly searches for something to be upset about; whether it be past friendships that ended for reasons that were \"not of her fault\", or comparing herself to me for pity. If there is nothing negative to be said, she is dead silent. I went out of my way to plan a dinner for us as my treat, and it was the worst dinner of my life. All she did was sit in silence UNLESS she thought of someone to talk shit about. I sat across from her wide-eyed and with an uncomfortable smile on my face because… I was appalled. I have never paid for a dinner so quickly in my life. I wanted to be gone.If there is something negative to be said, she will talk on and on and look at me for approval… As her friend I try to agree, but in my head I want to kms because I agree with nothing. When she asks me what she's done wrong in each of her relationships (romantic or not), I have no idea what to say because, if I point out what she may have done wrong, she will do the most extensive mental gymnastics to justify her actions. And somehow, even though I KNOW deep down that she was in the wrong, her explanations manage to contort my brain into agreement with her. I never know what to say when she asks for my thoughts on these situations. It's like facing a once abusive parent now that you're an adult; they directly ask why you think they were such an awful parent, and you stare blankly at them because you can't find the words to say. You second-guess yourself, even thinking, \"Wait, was it really that bad? Am I being too sensitive? Am I making this up?\", even though you really were abused by them.I fear that I am no better than her by posting this and I know that the only answer is to end our friendship, but I'm not mentally prepared for her reaction. I go to a small university too, so it further complicates my fear of being gossiped about. Now that I have re-read this a few times it's really pathetic, but this is a vent thread, aferall. So here it goes"
   },
   "reply_117817": {
      "reply id": "reply_117817",
      "content": "Anonymous 10/17/24 (Thu) 05:35:41 AM117817I wish I was hated. I need a rival. I want someone to fight. Someone I wake up each day just to hate back."
   },
   "reply_117818": {
      "reply id": "reply_117818",
      "content": "Anonymous 10/17/24 (Thu) 06:47:46 AM117818>I’m unworthy of someone else loveHow to deal with a guy that says this?On one side I feel like it isn’t worth pursuing someone emotionally unavaliable. On the other side I feel like I’d be just proving him right by stopping caring about him. And I hate losing.He’s not a badboy or anything, he’s actually pretty gentle and fun to be around, just extremely broken. Why do I have to obsess over a person like this…"
   },
   "reply_117820": {
      "reply id": "reply_117820",
      "content": "Anonymous 10/17/24 (Thu) 07:33:47 AM117820I’m addicted to digital self harm I think. I keep purposefully looking at incels and misogynists and pedos out of a sick fascination with them. I start off laughing at them for being pathetic, but always end up dooming over how horrible they are and how popular their ideas are becoming."
   },
   "reply_117821": {
      "reply id": "reply_117821",
      "content": "Anonymous 10/17/24 (Thu) 08:38:31 AM117821>>117818I'd leave if I were you nona. This will never end up in a healthy relationship. Yes you will prove him right in a way but you gotta take care of your own life first."
   },
   "reply_117828": {
      "reply id": "reply_117828",
      "content": "Anonymous 10/17/24 (Thu) 08:48:33 PM117828>>117818Tell him that it hurts you that he won't accept your love and that you are willing to give it to him as a gift because you care.If he still doesn't accept it then leave, he clearly doesn't want to work on his issues and wants to submit to his own self-fulfilling prophecy."
   },
   "reply_117834": {
      "reply id": "reply_117834",
      "content": "Anonymous 10/18/24 (Fri) 01:16:08 AM117834Coworkers are all significantly older than me and treat me like a kid (I'm in my thirties, they're in their 50s)Can't into discord.Try to interact with people on tumblr but I can't seem to make the jump to friends."
   },
   "reply_117835": {
      "reply id": "reply_117835",
      "content": "Anonymous 10/18/24 (Fri) 02:24:21 AM117835>>117577Should I date a guy who has an ugly face but a really nice body If I also have an ugly face but a nice body? Tbf he thinks I'm beautiful but he's kind of stupid. Are we \"looksmatched\"?"
   },
   "reply_117837": {
      "reply id": "reply_117837",
      "content": "Anonymous 10/18/24 (Fri) 02:35:32 AM117837>>117835Never settle for a guy nona. It will eat you up inside all your life."
   },
   "reply_117838": {
      "reply id": "reply_117838",
      "content": "Anonymous 10/18/24 (Fri) 02:51:59 AM117838>>117837If I don't settle Ill be alone at that will be worse.  my one dream in life is to find love"
   },
   "reply_117839": {
      "reply id": "reply_117839",
      "content": "Anonymous 10/18/24 (Fri) 03:07:48 AM117839They're really all like that, aren't they? And I do desperately wanted him to be the one."
   },
   "reply_117846": {
      "reply id": "reply_117846",
      "content": "Anonymous 10/18/24 (Fri) 05:18:43 PM117846>>117577I mis him so much. I know he won't be good for me but he's better than most and much better than nothing at all. I feel like I'm throwing away a gem because it's slightly scuffed"
   },
   "reply_117848": {
      "reply id": "reply_117848",
      "content": "Anonymous 10/18/24 (Fri) 09:10:36 PM117848You know when a man says something that reminds you \"oh well it is a man after all… idk what I expect\""
   },
   "reply_117849": {
      "reply id": "reply_117849",
      "content": "Anonymous 10/18/24 (Fri) 09:25:46 PM117849>>117848Makes me wish I wasnt perceived. I wish I was a snail. Or a rock. Not a woman. I am sad"
   },
   "reply_117862": {
      "reply id": "reply_117862",
      "content": "Anonymous 10/19/24 (Sat) 02:48:47 AM117862>>117835>>117837When you love someone you adore every part of his face. My man isn’t a conventionally attractive guy but he’s perfect in my eyes because every detail on his face belongs to him"
   },
   "reply_117863": {
      "reply id": "reply_117863",
      "content": "Anonymous 10/19/24 (Sat) 03:00:12 AM117863>>117816Wew idk what to advise, I bet that’s a very hard situation to deal with. She sounds extremely troubled and deluded to the max. I’ve known people like her but never got close to them. I’m sorry you’re going through this. Worst part must be genuinely worrying about her but meanwhile she’s just there destroying everything she touches"
   },
   "reply_117864": {
      "reply id": "reply_117864",
      "content": "Anonymous 10/19/24 (Sat) 04:17:18 AM117864>>117862Maybe one day I'll feel this way?"
   },
   "reply_117874": {
      "reply id": "reply_117874",
      "content": "Anonymous 10/19/24 (Sat) 06:30:51 PM117874>>117821>>117828I talked with him and he said he’s better off alone and I didn’t know him for real.Long story short its over.I feel like I betrayed his friendship by being too pushy about it. Maybe I was too overwhelming.Doesn’t help either that he changed his bio to lyrics of that “rose-colored boy” song, made me feel even guiltier about pressuring him.But that also could be just my anxiety getting the best of me.Why do avoidants always attract paranoid people like me?"
   },
   "reply_117884": {
      "reply id": "reply_117884",
      "content": "Anonymous 10/20/24 (Sun) 12:57:07 AM117884 goat simulator.jpg really just needed to get this off my chest, rough draft, don't care, just venting.>what is the difference between a game and real life?i used to post really insane shit on an imageboard because, well, i dunno, it was both fun and depressing at the same time. yeah, i'd get a bit heated, but that was kind of the point (really just search up bait terms in archives and realize that was always the point). after a while, i started to be able to recognize regular posters on the board, and we would have conversations about certain topics that got pretty extensive after a while. (also - i really wish people would keep in mind that individual posts are REPLIES to much larger threads. if you've never exercised \"\"\"\"\"anonymity\"\"\"\" maybe you wouldn't get it. if you believed you were anonymous, and came across certain posts online, like seeing your little sister get plowed by an ox, do you really think anyone would have acted \"rationally\"?)i probably annoyed the community when i first started using it, and maybe now lel, hence why, after a certain point, it led to me being doxxed. this is the point where i just really disagree with how things happened afterwards:i do regret having posted a lot of the things i said. but i don't think it's real, and, if someone were to build an entire government structure off of some shitposting site, i would probably laugh my ass off. i learned a lot from the experience but by no means would i actually think the political musings of some random anons rolling a digital blunt would actually translate to real life happiness. at any point, the people who doxxed me (DEFINITELY NOT JUST IP ADDRESSES) could have directly spoken to me, but they didn't.i also do not hate other women. sometimes i would get goaded into dogfights cus i dunno, people got bored and wanted to see shit happen. it would make me feel really sad if someone actually thought that i do not like other women, and i've posted on crystal.cafe far longer than any other ib. not that I'm assuming cc wouldn't have ever found my posts annoying but i think a miner would have still understood that i am not against my own gender and i enjoy the presence of other women.anyways. the difference between real life and a game is like having a good accent vs knowing the language itself.>a good accentyou don't have to know the language itself. you know how it kind of sounds, maybe you've never even stumbled across a fluent speaker completely by chance in real life, but you can get by with a bit of playfulness and wit as long as you know the general feeling of the language.>knowing the languageyou've archived literally every grammatical rule and structure of the language. you're angry at the language and you think it's flawed, almost to the point of wanting to destroy it because you've never practiced the accent itself so much as its grammatical rules.real life is fun, a bit playful, and doesn't actually hurt anyone. please keep that in mind and respect anonymity. there are lots of people who do and who understand that a bit of competitiveness on digital platforms does not actually translate to real life behavior.>\"DON'T\"no"
   },
   "reply_117889": {
      "reply id": "reply_117889",
      "content": "Anonymous 10/20/24 (Sun) 02:35:20 AM117889>>117884Everything in life is a game nona, but none of its fun past a certain age. Its a sludge that sucks the life out of you."
   },
   "reply_117890": {
      "reply id": "reply_117890",
      "content": "Anonymous 10/20/24 (Sun) 03:33:31 AM117890>>117889none of its fun past a certain point. you should be afraid of doxxing and have no attachment to the digital world (again, it definitely wasn't just ip addresses or careless use of an email, it was always meant to be anonymous and low stakes), because the internet is only supposed to be a glimpse into what real life could be. people doxx others because perhaps they feel they have nothing to lose in real life. its not a good thing to doxx people, and no, this should not be normalized. they do stuff like this to latch onto others and babytrap them.okay, cool, whatever, but this stops here."
   },
   "reply_117892": {
      "reply id": "reply_117892",
      "content": "Anonymous 10/20/24 (Sun) 03:49:04 AM117892>>117890I'm confused what does this have to do with my post? Past a certain point? You mean like after college? After everything starts to go downhill? Because that's what i meant.I'm not afraid of moid shenanigans like doxxing. No offense but I think living in fear of ANY kind of moid filth, abuse, or blackmail is setting yourself up to live a seriously diminished life. That's what  the shitty moids want. If you get close to most of them, it becomes obvious in a lot of little ways how entitled they are to benefit from that kind of background abuse that makes you mentally cucked. Even supposed nice guys are taking advantage of the cultural abuse, gagging, and brainwashing. They have so much entitlement to the filthy depraved ways things have been set up so women are disadvantaged to be preyed upon and have less social power. So that is a nonoption for me. Neither is going anywhere near a disgusting moid. What are you talking about IP addresses and careless use of emails? You should not have regrets over internet garbage. The internet is a dumping ground for virtually everything. If you don't post it someone else will kek."
   },
   "reply_117901": {
      "reply id": "reply_117901",
      "content": "Anonymous 10/20/24 (Sun) 04:29:30 AM117901 IMG_7162.jpeg i have the most insane victim mentality to ever exist.i genuinely believe everything i do is somehow justified by some logic-driven reason that i am NATURALLY predisposed to (\"obviously\"), which is why i just love ruining other people's fun with real life stakes without ever explaining to them why it is that i behave in a way that is very clearly distressing them.i am not a victim. i will never be a victim lol. not that anyone ever is, necessarily, but i genuinely believe that my lack of transparency fully justifies my means of harming others. i will never say what it is i personally did that harmed others because i am just not a good person, full stop. i need to stop fucking thinking i'm a good person and believing it's my duty to administrate justice. because, based on my background and the things i have involved myself in, i am just as complicit in misbehavior as the people i persecute.i need to stop latching onto and inadvertently babytrapping others because i suck. i know for a fact the only reason i concern myself with randoms is because i am scared of accountability, and only ever really gave a shit about randoms when they realized i have everything to lose.i really should just gfm"
   },
   "reply_117904": {
      "reply id": "reply_117904",
      "content": "Anonymous 10/20/24 (Sun) 06:25:34 AM117904>>117884>>117901are you schizophrenic?"
   },
   "reply_117909": {
      "reply id": "reply_117909",
      "content": "Anonymous 10/20/24 (Sun) 11:47:20 AM117909 IMG_7192.jpeg ketchupreduced sugar edition"
   },
   "reply_117933": {
      "reply id": "reply_117933",
      "content": "Anonymous 10/21/24 (Mon) 01:03:31 AM117933DONT TELL MOMlololol"
   },
   "reply_117935": {
      "reply id": "reply_117935",
      "content": "Anonymous 10/21/24 (Mon) 01:31:14 AM117935one would be very silly to believe you would not document your memories.they should not touch real life people with a 2000 foot pole.know what babytrapping is."
   },
   "reply_117936": {
      "reply id": "reply_117936",
      "content": "Anonymous 10/21/24 (Mon) 01:32:13 AM117936>>117935alsorespecc anonymity :D"
   },
   "reply_117939": {
      "reply id": "reply_117939",
      "content": "Anonymous 10/21/24 (Mon) 03:08:44 AM117939>>117901You messed with your boyfriends condom????"
   },
   "reply_117952": {
      "reply id": "reply_117952",
      "content": "Anonymous 10/22/24 (Tue) 02:49:36 PM117952 comet-space.jpg If there is a fear, I have it. Societal collapse, rape, a meteor striking. In my mind, Murphy's Law rules. And my consequence? Kill myself before worse happens."
   },
   "reply_117986": {
      "reply id": "reply_117986",
      "content": "Anonymous 10/23/24 (Wed) 02:38:35 AM117986>>117863I appreciate it, nona. I'm trying to figure things out as the days pass. Regardless of how it is done, the end of our friendship will be very tough before things get better… but I look forward to better days!"
   },
   "reply_117994": {
      "reply id": "reply_117994",
      "content": "Anonymous 10/23/24 (Wed) 11:37:21 PM117994My mum has been terminally online with Facebook since Covid and I can't take it anymore. Most of her talking to me now is just her ranting about people she gets into e-slap fights with or comments she's read."
   },
   "reply_117995": {
      "reply id": "reply_117995",
      "content": "Anonymous 10/23/24 (Wed) 11:47:38 PM117995I fucking hate my moid neighbor and his ass music taste, the same dad rock songs almost everyday, sometimes I feel like dropping trash and dog shit on his doorstep"
   },
   "reply_117996": {
      "reply id": "reply_117996",
      "content": "Anonymous 10/23/24 (Wed) 11:52:17 PM117996I also hate going out with friends only for them to invite the one person I can't stand anymore. Why are you here? You and your bf can kindly fuck off"
   },
   "reply_117997": {
      "reply id": "reply_117997",
      "content": "Anonymous 10/24/24 (Thu) 12:23:14 AM117997I have a pretty severe form of OCD that makes me pick at my skin and hair. It is impossible to hide and extremely visible. I don't even know what I can do about it anymore, the meds stopped working"
   },
   "reply_117999": {
      "reply id": "reply_117999",
      "content": "Anonymous 10/24/24 (Thu) 08:04:46 AM117999i just think its really cringe when people try to involve other races in things they obviously don't want to be involved in. why do people care so much if you don't want to be in their ingroup/have no desire to? they have nothing to offer you. therefore, they should leave you alone. the only true friendship is symbiotic in nature and consensual, everything else is just cult bullshit."
   },
   "reply_118036": {
      "reply id": "reply_118036",
      "content": "Anonymous 10/25/24 (Fri) 06:02:47 AM118036that one couple that no one likes"
   },
   "reply_118039": {
      "reply id": "reply_118039",
      "content": "Anonymous 10/25/24 (Fri) 07:16:00 AM118039I'm having some family related issues and I'm honestly not sure how to handle it. I would really appreciate some advice if anyone got some.I'm a uni student that still lives with my parents. Their marriage has been falling apart for years but it seems to have reached a new low. My mom always has been a bit of a workaholic, to the point where it has severely affected her health due to her overworking herself and neglecting it. Said health complications took a turn for the worse about a year ago, landing her in the hospital after collasping and getting diagnosed with anemia. It was apparently because of a myoma, making her bleed out everday while making her periods more severe and painful. She's been showing symptoms (like having low energy and looking pale etc.) a while before that, but she outright refused to go to a doctor when brought up. Her collapsing was enough to change her mind at least. My dad didn't see anything wrong with her behavior before the diagnosis and dismissed it as her being lazy. He's accusing her of doing nothing for the household and him being left to do everything (which quite frankly isn't true). Naturally this lead to many arguments between the two.These arguments started getting worse and worse lately with some financial and familial issues that have come up on top of everything. They're yelling at each other constantly, my mom explodes over small things at this point. The above mentioned health complications (affecting her menstrual cycle specifically) started getting worse again and the huge additional work load at her job makes her more stressed out than usual on top of that. She started going on these rants where she yells at me about how horrible of a person my dad is and how badly she wants a divorce to finally be able to have a normal family. My dad refuses to get a divorce, I assume because he does still love her to some degree but has no way of showing it.I'm so torn with this and admittedly just tired of being in the middle of everything. I want to be there for her and support her, but, and I feel incredibly selfish for even thinking this, hearing their arguments constantly day in and out is just incredibly drainging, to the point where I started dismissing my mom when she starts ranting about my dad again. My mom can honestly get really scary when angry. When bringing up going to another doctor's appointment or insinuating that she might be overreacting and should probably calm down, she accuses me of defending him and making me out to be the enemy. Which in the latter case, I guess I am, but mostly because I just want things to calm down. Same thing happened, when she wanted to show me how bad her bleeding is during her period with blood running down her legs. I should probably just move out, but I can't do that with my current wage. Job hunt might take a bit, so I still have to deal with this for the forseeable future."
   },
   "reply_118040": {
      "reply id": "reply_118040",
      "content": "Anonymous 10/25/24 (Fri) 08:56:40 AM118040 npgeji1k5lvd1.jpg >>117999Are you ESL?I don't know about races but if some groups are extremely toxic and have, for example, bimbo women catering to chauvinistic disgusting males to the point it makes you feel sick, its only right they be discouraged from breeding so that whole mess gets filtered out of the gene pool.I mean how in christ did we arrive here anyway?"
   },
   "reply_118042": {
      "reply id": "reply_118042",
      "content": "Anonymous 10/25/24 (Fri) 03:50:31 PM118042 49ec4583d0bef058a5… hi ladiess, does anyone else have a member of their family that is incapable of taking care of themselves due to mental illness? and how does your family deal w it/do they?my aunt raised me for a chunk of my childhood, so i care for her very much and consider her like a second mother. since then though she's mentally declined. she has bipolar 2 and a few other illnesses, but i know bipolar is the more prominent one. anyway, she currently lives in an apartment for elders, but she’s succumbed to such low living habits. like when making a \"meal,\" she'll open something up and just throw the wrappers on the floor without even looking for the trash. like even raw meat packaging… she has a roach problem bc of this. she doesn't eat proper meals, more like, corn and hamburger meat w barbecue sauce slathered on it.she's just rotting away, and it’s heartbreaking to see. i've come by her place a few times and deep cleaned it, but it never helps because she just trashes it shortly after. she doesn’t care about herself.."
   },
   "reply_118043": {
      "reply id": "reply_118043",
      "content": "Anonymous 10/25/24 (Fri) 06:01:17 PM118043Lonely for a long time so I joined the furry fandom and am immediately making friends. Kind of sad I wasn't able to make friends through church because I tried that for a long time and it never worked out for me. Furries are nicer and friendlier to me than other Christians."
   },
   "reply_118044": {
      "reply id": "reply_118044",
      "content": "Anonymous 10/25/24 (Fri) 06:23:26 PM118044 1723713370136.jpg >>118042Gee maybe she's being stalked nona"
   },
   "reply_118045": {
      "reply id": "reply_118045",
      "content": "Anonymous 10/25/24 (Fri) 06:24:36 PM118045>>118043Lmao christians"
   },
   "reply_118046": {
      "reply id": "reply_118046",
      "content": "Anonymous 10/25/24 (Fri) 06:51:21 PM118046>>118044what… do you even mean.."
   },
   "reply_118047": {
      "reply id": "reply_118047",
      "content": "Anonymous 10/25/24 (Fri) 07:43:15 PM118047Tomorrow I'm seeing someone and I was so surprised he wanted to hang out but also.. not happy at all?I spent most of my life wanting to be desired, to love and be loved, to be in a relationship. I still want it more than ever, and am so touch starved it hurts. And there's nothing wrong with him, he's really nice and intelligent and does all the right things. But I just can't believe it would work, I can't help wanting to avoid everything and run away from it I hate being this way.I fear the date, I fear texting, I hate small talk, I hate the way he'll initiate touch and I'll have to react thought I DO want it, I guess. It's this avoidance fucking me up, and both the fact that I'll always be unlovable and also the.. normalcy of it all? He's only a year older, and I'll have to play in this game nearly an equal part to his and it makes me feel icky, being an equal partner. In all my dreams a guy will take charge and tell and teach me how exactly because I'm so clueless and confused. And the fact that I'll actually have to talk, flirt, initiate things, be active in the relationship makes me ill.It's fucked up. I'm 22 and not a weak person. I should be strong and get what I want and these days it is someone to hold me close at night. Anxiety will NOT win.(also tips would be nice if you went through similar things)"
   },
   "reply_118048": {
      "reply id": "reply_118048",
      "content": "Anonymous 10/25/24 (Fri) 07:47:06 PM118048>>118047go masterbate to furries again moid"
   },
   "reply_118049": {
      "reply id": "reply_118049",
      "content": "Anonymous 10/25/24 (Fri) 11:57:14 PM118049>>118048What’s up with this troll calling everyone a man in every single thread? Fuck this site"
   },
   "reply_118050": {
      "reply id": "reply_118050",
      "content": "Anonymous 10/26/24 (Sat) 12:00:39 AM118050>>118049Because you sound like a dude wanking it behind the screen and it genuinely makes me sickim not gonna pretend it doesn't anymore im gonna call each and every one of you filthwads out"
   },
   "reply_118051": {
      "reply id": "reply_118051",
      "content": "Anonymous 10/26/24 (Sat) 12:09:54 AM118051>>117578to be brutally honest, you should stop wanting him to love you. also you sound clinically depressed. break up with him and fix your life, you'll never have a stable relationship if you dont already have a stable life"
   },
   "reply_118052": {
      "reply id": "reply_118052",
      "content": "Anonymous 10/26/24 (Sat) 12:17:27 AM118052>>118048What’s up with this troll calling everyone a man in every single thread? Fuck this site"
   },
   "reply_118053": {
      "reply id": "reply_118053",
      "content": "Anonymous 10/26/24 (Sat) 12:24:42 AM118053 1729902135194877.j… I struggle with basic math as an adult"
   },
   "reply_118054": {
      "reply id": "reply_118054",
      "content": "Anonymous 10/26/24 (Sat) 02:10:03 AM118054>>118049it's literally one retard who keeps calling literally anyone a scrote and i've noticed this happening in literally every thread for months. i thought i was going crazy>>118050stfu she sounds normal"
   },
   "reply_118055": {
      "reply id": "reply_118055",
      "content": "Anonymous 10/26/24 (Sat) 02:13:48 AM118055>>118042does no one relate to this like wtf. i thought mental illness was rampant in this Hoe. there must be someone with a loved one fucked in the head"
   },
   "reply_118056": {
      "reply id": "reply_118056",
      "content": "Anonymous 10/26/24 (Sat) 04:48:10 PM118056>>118054Does she though?This site is overrun with moids posting as women though"
   },
   "reply_118075": {
      "reply id": "reply_118075",
      "content": "Anonymous 10/27/24 (Sun) 11:05:15 AM118075>>118042Seems like shes very ill and using this tacitcs as a form of calling for help. Its like self harm. But she trashes the place to show people shes not well and need help"
   },
   "reply_118076": {
      "reply id": "reply_118076",
      "content": "Anonymous 10/27/24 (Sun) 11:21:35 AM118076 Screenshot_2024102… I found a new religion I still follow Jesus teachings but I dont go to Church. Because they just seem so far away from what original Christian teachings. I made a new life goal of eliminated the evil force buy good acts, thoughts and speeach."
   },
   "reply_118077": {
      "reply id": "reply_118077",
      "content": "Anonymous 10/27/24 (Sun) 11:22:44 AM118077>>118076Sorry for the grammar. Posted on phone"
   },
   "reply_118078": {
      "reply id": "reply_118078",
      "content": "Anonymous 10/27/24 (Sun) 11:40:30 AM118078>>118053I'm 34 and study multiplication flashcards and practice skip counting because I never memorized the times table. I think I'm actually retarded."
   },
   "reply_118080": {
      "reply id": "reply_118080",
      "content": "Anonymous 10/27/24 (Sun) 05:52:44 PM118080>>118078if you struggle with memory i can see how juggling numbers in your head could be hard. idk dont feel bad nona. calculators exist to help with that"
   },
   "reply_118085": {
      "reply id": "reply_118085",
      "content": "Anonymous 10/28/24 (Mon) 08:23:45 AM118085 3711962a96b6bf7c0b… I forgot to feed and give water to my friend's pet hamster for a week and it died. I lied and said a black widow spider killed it and ants ate it. She blamed herself for leaving the window open."
   },
   "reply_118086": {
      "reply id": "reply_118086",
      "content": "Anonymous 10/28/24 (Mon) 10:02:49 AM118086everygirl i ever befriend online comes out as tif 3 months to 3 years later, it dosent even have to be friend it can also be commenting under my art to the point that now i am starting to have the delusion i somehow causing that"
   },
   "reply_118088": {
      "reply id": "reply_118088",
      "content": "Anonymous 10/28/24 (Mon) 11:36:51 AM118088>>118085Its her fault for being a bad judge of character. Never have children."
   },
   "reply_118097": {
      "reply id": "reply_118097",
      "content": "Anonymous 10/28/24 (Mon) 02:02:02 PM118097 1730122518660571.g… Life has lost its meaning. Its just either sit around with phone all day or work at some stressful place. I dont want kids. Its selfish bringing people into a world like this just because you want to cure your own mental illness. Wished i lived in a tribe where old people were wife and treated with respectAnd everyone belived to become a spiritual anaimal after death"
   },
   "reply_118116": {
      "reply id": "reply_118116",
      "content": "Anonymous 10/29/24 (Tue) 12:37:37 PM118116 GaQQGEpaYAAR9Hr.jp… I truly feel that if my bf left me, I'd have nothing left to live for. Sure, he predicates my existence and makes life a little less meaningless and all that, but this period of joy is sure to come to an end. We'll graduate, and then we have to go to different continents. When we return, who's to say if we'll still be together? Or if he's already been tempted by other hot and hormonal young women? Which is why I have to steal his first everything. We're already both virgins who's each other's first everything to begin with. We kissed, so there's that.Viktor Frankl is a damn seller of hokey. Life is meaningless and we're all going to die, so create your own meaning, whatever the hell that means, even if you know that your created meaning is meaningless anyways and merely a human assigning towards an absurd existence, and surrender yourself to love and worship your lover as your personal god, an imperfect deity who will validate your existence and give you a reason for being.>>118097I don't know. Honestly I just live to spite the cruelty of our circumstances in an imperfect world, feeble creatures who have been cursed with the divine miracle of consciousness. Motion is life, stillness is death. It doesn't matter if you're moving or just rotting in bed, we rot all the same, helplessly shepherded and corralled to oblivion by Death the shepherd. We can't do anything to stop Death, so I live to spite him. Spend my life endlessly flipping off Death"
   },
   "reply_118118": {
      "reply id": "reply_118118",
      "content": "Anonymous 10/29/24 (Tue) 03:58:07 PM118118>>118116You need to learn to love yourself first. It’s hard not to rely on your significant other, but if he goes you have to be able to rely on yourself as well. If not it’s not good for you mentally"
   },
   "reply_118119": {
      "reply id": "reply_118119",
      "content": "Anonymous 10/29/24 (Tue) 04:26:55 PM118119>>118085ohhhh.. you’re such a piece of shit lol"
   },
   "reply_118122": {
      "reply id": "reply_118122",
      "content": "Anonymous 10/29/24 (Tue) 09:53:21 PM118122I!!!!!! HAAAAAATE!!!!!!! MOIIIIDSSSSSSSS!!!!!!!!!!!!!!"
   },
   "reply_118123": {
      "reply id": "reply_118123",
      "content": "Anonymous 10/29/24 (Tue) 09:56:15 PM118123>>117578I'm going to be honest this guy is a fucking faggot. You literally didn't do anything, you just committed thoughtcrime (not an actual thing to feel bad about, you shouldn't have to control your THOUGHTS for him and he shouldn't be jealous of your thoughts.) He is weak as fuck and a pussy"
   },
   "reply_118124": {
      "reply id": "reply_118124",
      "content": "Anonymous 10/29/24 (Tue) 11:04:49 PM118124 463999874_10808333… Life without her is so painful. I think I became obsessed, now I can't let go. It's been over a year now, I think. It's over now. How long until I forget, or will it ever go away?"
   },
   "reply_118125": {
      "reply id": "reply_118125",
      "content": "Anonymous 10/30/24 (Wed) 12:58:31 AM118125I keep having dreams about my old friend who bullied me in school. She used to grope me in bathrooms and locker rooms and show my cringy autist stuff to guys in our grade. I still feel ashamed of myself, but I hope she's doing alright these days"
   }
}