{
   "thread number": "20721",
   "original post": {
      "post id": "20721",
      "username": "Anonymous",
      "date posted": "10/17/24 (Thu) 07:02:17 AM",
      "post content": ">do they work?>how effective?>Tips?"
   },
   "reply_20723": {
      "reply id": "20723",
      "username": "Anonymous",
      "date posted": "10/17/24 (Thu) 09:55:44 AM",
      "post content": ">>20721just do normal workout and try to not eat too much carb. Face gets healthier with the rest of your whole body, you can't isolate it"
   },
   "reply_20724": {
      "reply id": "20724",
      "username": "Anonymous",
      "date posted": "10/17/24 (Thu) 05:22:47 PM",
      "post content": ">>20721It’s a good way to get wrinkles Dragging your face skin is just gonna stretch it out and not accomplish much"
   },
   "reply_20727": {
      "reply id": "20727",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 07:25:38 AM",
      "post content": ">>20724This is insane..don't scare me like that >>20723Tbh I don't eat carbs at all and my BMI is 17, don't worry Abt body department"
   },
   "reply_20728": {
      "reply id": "20728",
      "username": "Anonymous",
      "date posted": "10/19/24 (Sat) 02:08:16 AM",
      "post content": ">>20721I’ve gotten pretty good results from doing lymphatic drainage/circulation routines on my face and neck :) There are lots of good YouTubers (mainly East Asian) with routines you can follow along to.Don’t listen to the person that said it’ll give you wrinkles. You’re not tugging and pulling at your skin. This is like saying that cleansing your face everyday gives you wrinkles."
   },
   "reply_20729": {
      "reply id": "20729",
      "username": "Anonymous",
      "date posted": "10/19/24 (Sat) 02:26:33 AM",
      "post content": ">>20727stretching your skin is literally how everyone in the world gets wrinkles. Also not eating carbs isn't enough, you need to also avoid oil and sugar and make sure you're drinking at least 2L of water a day so your face isn't oily but also then doesn't dry out. If you wash your face ever, use any decent unscented moisturiser right after. Natural sugars are ok like from cold pressed juice tho"
   },
   "reply_20730": {
      "reply id": "20730",
      "username": "Anonymous",
      "date posted": "10/19/24 (Sat) 02:30:03 PM",
      "post content": ">>20729It's not stretching the skin, at all…face massages require using face oils or moisturizers or anything that'll make your fingers glide against your skinIf you're stretching it, youre doing it wrong."
   },
   "reply_20731": {
      "reply id": "20731",
      "username": "Anonymous",
      "date posted": "10/19/24 (Sat) 03:03:19 PM",
      "post content": ">>20729is coffee also bad for face health?"
   },
   "reply_20733": {
      "reply id": "20733",
      "username": "Anonymous",
      "date posted": "10/19/24 (Sat) 11:33:20 PM",
      "post content": ">>20730not sure what those nonas were talking about either. this definitely doesnt stretch your face if youre using oils. ill say this though people who do these massages always seem to have a weird plastic surgery look after doing this, so im not sure if facial massages are the best way to enhance your face. maybe doing this non-excessively is okay"
   },
   "reply_20734": {
      "reply id": "20734",
      "username": "Anonymous",
      "date posted": "10/20/24 (Sun) 04:00:08 PM",
      "post content": ">>20731>is coffee also bad for face health?how about you not only worry about your face but your overall health or does it not matter what happens inside you as long as you give off the appearance of looking twenty?i guess you only care about the parts of you that are being judged on instagram.coffee messes with the human body, it teaches the body to rely on it and the body grows dependent.dummies are saying \"first thing in the morning i need my coffee or i can't guarantee for <whatever who cares>\" and that's because they are addicts, slapping the backside of their ellbow impatiently in anticipation of their stupid chemicals.and when the disgraceful addicts don't get it, they are tired constantly.the human body is not meant to be operated in a way that it feels bad all the time. the human body is a dream manifestation machine and it is supposed to feel good and have energy for constant physical labour. i don't advise to work that hard from sunrise to sunset, but it is important to mention that every somewhat healthy human has the choice to. i believe coffee stands in the way of this choice. next time you drink a coffee and it tastes kind of sour, that was me taking a tiny poop in it. like this 💩"
   },
   "reply_20739": {
      "reply id": "20739",
      "username": "Anonymous",
      "date posted": "10/21/24 (Mon) 12:58:54 AM",
      "post content": ">>20734You’re so right. Coffee addiction is absolutely pathetic. It tells us that you can’t even do something as simple as swap out the morning coffee for a green tea (which can be an equally satisfying and much healthier alternative)."
   },
   "reply_20763": {
      "reply id": "20763",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 12:27:29 PM",
      "post content": ">>20734No one would be addicted to coffee if we didn't have to slave away at jobs that need us to overwork ourselves all the time. I mean look at retail jobs, they don't even allow you to sit. Some work 13-14 hours a day."
   },
   "reply_20765": {
      "reply id": "20765",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 11:05:38 PM",
      "post content": ">>20734I had a severe caffeine addiction and would get constipated if I didn’t drink it on top of getting intense migraines that would last for a week. On average people spend between $3-5k a year on coffee depending on how fancy they like their drinksDon’t drink coffee, you’ll be richer and healthier without it"
   }
}