{
   "thread number": "118018",
   "original post": {
      "post id": "118018",
      "username": "Anonymous",
      "date posted": "10/24/24 (Thu) 07:32:22 PM",
      "post content": ">friends since middle school >would hang out with them at their house practically every other day>work with them for their parents business over the summer for two years>never missed their birthday and give them presents (Megalodon tooth, Crystals, custom drawn & printed poster, etc.) >they move 15 minutes away causing them to change schools for senior year of high school but it was fine because they could drive>they stop responding a month before graduation, didn't think anything of it because its a busy time >doesn't respond during summer>we hang out one more time during the summer because a mutual friend was there and set it up>find out we go to the same university from said mutual >eventually the mutual friend reveals that they straight up dont want to be friends with me anymore and didnt give a reason why. Turns out that they joined a fraternity/sorority as soon as they got into university and began ghosting our mutual friend as well. I ended up just unfriending them on every platform without saying anything and avoid them on campus. I find it so bizarre how someone can switch like that. It still hurts considering they were one of the only two friends I had growing up. But now I want that Megalodon tooth back but thats on me."
   },
   "reply_118104": {
      "reply id": "118104",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 07:38:05 PM",
      "post content": "normies are like this, they view us as \"autist we can hang with sometimes\" or as disposable second options. I'm really sorry because similar shit happened to me also. Once they outgrow interests and what not if they're NT it's kinda over. Hopefully you get the tooth back!!"
   },
   "reply_118109": {
      "reply id": "118109",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 10:46:43 PM",
      "post content": "the only friend i have within hours of me recently told me she didn't want to talk to me or hang out anymore because i was \"affecting her spiritually.\" we went from close friends to complete strangers in like 2 weeks. i don't even know what she was talking about since she never had a problem with me being spiritual (not even atheist, just not a church person) before that. so now its almost halloween, i'm 23, and i have zero friends to hang out with and zero prospects. i wish i was dead. i hate being a sperg woman"
   }
}