{
   "thread number": "27324",
   "original post": {
      "post id": "27324",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 08:28:00 AM",
      "post content": "I really hate being in male dominated fandoms. Touhou is an example (not only is it male dominated but it's tranny infested too). It's kinda lonely. So many male dominated fandoms would become much better if it had a majority of women. I wonder if others feel that way"
   },
   "reply_27325": {
      "reply id": "27325",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 08:58:56 AM",
      "post content": ">>27324I can really relate, it used to not bother me, but I play quite a few gatcha games, e.g. azur lane, fgo, and I'm attached to characters but the complete lack of actual woman can be pretty depressing. Yuri anime and media has also been spoiled to an extent by the male fan base that it's surrounded by."
   },
   "reply_27326": {
      "reply id": "27326",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 09:40:37 AM",
      "post content": "touhou in particular has become completely ruined by its moid fandom in recent years there's an infestation of pedo moids who only like it because of the younger looking/loli characters, a ton of annoying autistic male trannies (a lot of which are also pedos of course) and moids who don't care for the games or anything else except for the touhou porn doujins and nonstop sexualize the characters vocaloid is another one that got ruined in recent years too, and mlp of course at least otome game fandoms and shoujo anime fandoms will always be majority women - and most of these fandoms especially the otome ones seem to have little to no troons in them which is always a plus"
   },
   "reply_27328": {
      "reply id": "27328",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 02:31:47 PM",
      "post content": "A lot of Touhou artists have been female, but unfortunately that's not enough to keep the Touhou fandom less scrotey. I posted about it somewhere else but it must be hard to husbando Rinnosuke (I've seen a couple of Japanese Rinnosuke yumes) basically everyone else (moids) only use him for harem jokes and as a self-insert and most male artists can't draw him for shit.>>27326I've seen ever seen a single male troon who is into otome games. However, I've seen plenty of TIFs who play it, which is very telling lol. Sadly shoujo fandoms aren't completely safe from the moid cancer."
   },
   "reply_27331": {
      "reply id": "27331",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 06:42:09 PM",
      "post content": "I prefer female characters and things centred around women, unfortunately men do too. It seems most other weeb women are into otome games and male centred stuff but I tend to enjoy those less especially now that I have a bf. Even if I do meet a woman who's into what I'm into, she's usually a handmaiden and would probably stop talking to me if she found out my views on trannies. Or she goes by they/them.I feel your struggle and it sucks.I want more female friends with similar interests but I can't force myself to like what I don't like and neither can they. Friendship making seems pretty hopeless for me. I'm just waiting until my desire to make friends will die off."
   },
   "reply_27332": {
      "reply id": "27332",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 06:59:12 PM",
      "post content": ">>27331There are actually a lot of women who are into female-centric media, like Love Live, but sometimes, especially if it's very male-oriented, the female fans are pickmes and that's kind of annoying too"
   },
   "reply_27334": {
      "reply id": "27334",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 07:18:10 PM",
      "post content": ">>27324Just go on tumblr almost every fandom is female dominated since the platform is female dominated as well.They’ll talk about media in a completely different way just make sure you stay away from menTiktok is also an ok platform"
   },
   "reply_27335": {
      "reply id": "27335",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 07:34:56 PM",
      "post content": "when i watched watamote i thought the fandom is full of women because its relatable to socially outcasted women it’s hard to believe sometimes it’s made by a male although some few things feels like its from a male perspective but the fandom is filled with males no wonder why the manga now became shitty now it’s just yuri fanservice for coomers if the fandom wasn’t full of scrotes the manga will have still been good"
   },
   "reply_27336": {
      "reply id": "27336",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 07:44:06 PM",
      "post content": "i hate how women don’t gatekeep female dominated fandoms take kpop for example since it became popular fanboys are in every fandom these fanboys are so disgusting they sexualize kpop girls even underage ones they act edgy they’re so annoying women don’t mind moids existence in their spaces unlike males we should gatekeep fandoms the best way to gatekeep fandoms from males is making it full of fujos i used to spam johanxtenma gay sex fanarts in monster tags just to make moids less interested in the anime it made moids so pissed"
   },
   "reply_27337": {
      "reply id": "27337",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 07:54:12 PM",
      "post content": ">>27335I remember discovering Watamote on Facebook when every cringe anime fan from my region wouldn't shut the fuck up about it and most of them were scrotes who didn't even know what otome was. It was so popular that it put me off and I wouldn't watch it until its popularity waned and I realized it would be fun to watch as a fujoyume and former awkward otaku myself. I love that anime so much because weird, plain, creepy female geeks are VERY RARELY represented in anime, and Tomoko hit really close to home (but not in a bad way! in a funny and heartwarming way).But now I sort of can't help associating Tomoko with a tranny avatarfag from another imageboard on top of her being seen as just another waifu for coomer lolicon scrotes. Women should be louder about the things they like.>it’s hard to believe sometimes it’s made by a maleI'm not sure how true this is, from what I've heard the story is by a male and the art by a woman. When 4fags sent dick pics to the author(s), she/they(?) left an author's comment in some manga volume about how they had never seen a penis before. So there's at least one woman in the team. Also AFAIK Watamote is published on a \"unisex\" magazine so it's not like it's only for a male audience.>>27336Unfortunately, girls are socialized to be too nice and inclusive and not speak up for themselves while moids are selfish, loud, abrasive and invasive. Males want us out of \"\"\"their\"\"\" hobbies and online spaces? Well, we should kick them out of every female space (online and IRL) and female-dominated fandom as well. It's only fair.>the best way to gatekeep fandoms from males is making it full of fujosNot just fujos, moids also hate yumes and any other woman who sexualizes male characters (they call them all fujos because moids are retarded)"
   },
   "reply_27338": {
      "reply id": "27338",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 08:04:02 PM",
      "post content": ">>27337> Not just fujos, moids also hate yumes and any other woman who sexualizes male characters (they call them all fujos because moids are retarded)you’re right they hate yumes because of jealousy even characters make them insecure"
   },
   "reply_27339": {
      "reply id": "27339",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 08:19:07 PM",
      "post content": ">>27337>>But now I sort of can't help associating Tomoko with a tranny avatarfag from another imageboard on top of her being seen as just another waifu for coomer lolicon scrotessame that’s why i don’t like to post tomoko in any place >> so it's not like it's only for a male audiencenow it’s fs targeting moids look up the latest  chapters it feels like a moe manga tomoko has friends all of them aren’t similar to her she’s no longer a loser so there’s really nothing interesting about the manga now"
   },
   "reply_27342": {
      "reply id": "27342",
      "username": "Anonymous",
      "date posted": "11/08/22 (Tue) 09:25:18 PM",
      "post content": ">>27332WI am into Love Live which is why I said what I said. It applies because so many are gendies or super for gendies. And I feel like everyday as a love live fan I have to block transbians"
   },
   "reply_27351": {
      "reply id": "27351",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 12:19:15 AM",
      "post content": ">>27336>female dominated fandoms take kpop for example since it became popular fanboys are in every fandom these fanboys are so disgusting they sexualize kpop girls even underage onesWho will tell her?.."
   },
   "reply_27352": {
      "reply id": "27352",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 01:37:05 AM",
      "post content": "I am used to it I guess. It doesn't bother me really, facts are that anything with girls in it is going to have a subset of male fans of varying size. They increasingly pander to this fans and meanwhile the shows made for women are the ones with tons of men in them which can be offputting to me. Those reverse harems gross me out, I would be fucking scared if I was the only girl in a house full of men."
   },
   "reply_27360": {
      "reply id": "27360",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 05:17:57 AM",
      "post content": ">>27328I've seen a few tifs into newer otomes but most the older or more obscure ones (like hakuouki) are usually safe even from tifs or maybe I've just been lucky and not encountered them yet lol fandom for shoujo like kimi ni todoke, kamisama kiss, nana, etc seem to be mostly moid free - I guess the newer and/or more popular it is the more likely that moids and troons will flock to it and shit up the fandom"
   },
   "reply_27361": {
      "reply id": "27361",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 05:37:48 AM",
      "post content": ">>27360what is a tif?"
   },
   "reply_27362": {
      "reply id": "27362",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 05:42:21 AM",
      "post content": ">>27361trans identified female, basically a woman with a made up gender (like ftm trannies)"
   },
   "reply_27363": {
      "reply id": "27363",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 05:53:45 AM",
      "post content": ">>27362sounds weird. ive never heard of any woman calling herself tif or a made up gender but maybe i am misunderstanding whats a made up gender."
   },
   "reply_27365": {
      "reply id": "27365",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 06:08:58 AM",
      "post content": ">>27363some severely mentally ill/terminally online women will convince themselves they are men or another made up gender identity like nonbinary (despite still being a woman obviously)a lot of people who refuse to pander to their delusions have started calling them tifs (or tims for male trannies) anyways this is a thread about moids ruining fandoms and not about delusional troons denying reality, sorry op I don't mean to derail your thread"
   },
   "reply_27375": {
      "reply id": "27375",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 10:12:41 AM",
      "post content": ">>27361>>27363TIF is a term that trans rights activists (TRAs) and FtM transgenders/\"trans men\" hate because it implies that the trans \"man\" is actually just a female who merely identifies as a man and isn't actually a male (which is true and used to be the accepted view, but you can't say it anymore). In other words, TIF = the \"TERF\" way to say \"trans man\". They don't call themselves TIFs, they call themselves transmen because the accepted way of referring to trans people now is by their chosen gender identity to \"affirm\" this identity and not make them feel \"dysphoric\", effectively encouraging their delusions.It can also apply to any girl/woman who identifies as non-binary or any other made-up bullshit that isn't their actual sex (female).There's a lot of TIFs in otome fandom in recent years. They try to create their own otome games that are more \"inclusive\" and have non-binary or transmasc (and even transfem) characters. Unfortunately for them, most of those games are hideous, boring and few become popular. Since actual otome games must by definition have a female protagonist and a male cast of love interests, genderspecials have created a new romance game genre called \"Amare\" which is where all those ugly Western games with \"diverse\" casts would fit. However this somehow hasn't stopped TIFs from demanding to be pandered to in otome games."
   },
   "reply_27384": {
      "reply id": "27384",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 02:29:51 PM",
      "post content": ">>27351i know ggs target males i know m0ids are pedos these are good reasons to gatekeep ggs"
   },
   "reply_27385": {
      "reply id": "27385",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 02:32:10 PM",
      "post content": "males don’t watch magical girl animes with characters that don’t look like children sailor moon fandom is mostly women"
   },
   "reply_27386": {
      "reply id": "27386",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 03:02:24 PM",
      "post content": ">>27385It's true that Sailor Moon fandom is mostly women (thankfully) but scrotes have been creating doujin manga and games (and even hentai anime) of Sailor Moon since the 90s. >>27360 seems to be right about popular shoujo shows getting more moid \"\"\"fans\"\"\"."
   },
   "reply_27390": {
      "reply id": "27390",
      "username": "Anonymous",
      "date posted": "11/09/22 (Wed) 06:31:36 PM",
      "post content": ">>27375"
   },
   "reply_27825": {
      "reply id": "27825",
      "username": "Anonymous",
      "date posted": "12/14/22 (Wed) 05:21:57 PM",
      "post content": ">>27334tumblr never lets me down, i just wish it was more populated again. the creative girls on tik tok need to migrate there. i think the reason is because its the only platform that wont allow users to profit"
   },
   "reply_28322": {
      "reply id": "28322",
      "username": "Anonymous",
      "date posted": "12/18/22 (Sun) 07:41:00 PM",
      "post content": ">>27385I know a guy who loves sailor moon, josei and BL anime/manga and he's not even gay."
   },
   "reply_28369": {
      "reply id": "28369",
      "username": "Anonymous",
      "date posted": "12/21/22 (Wed) 12:59:16 AM",
      "post content": "i used to like touhou because it was awesome that some japanese moid made a game with only women as characters and none of them were sexualized, instead they had interesting designs. and also i like how males are irrelevant in the gensokyo lore. but moids always have to coom and misinterpret the artist shit drawing skills and read the lack of bust as muh lolis muh coom muh transbian world…a pedo classic. same with mlp"
   },
   "reply_28398": {
      "reply id": "28398",
      "username": "Anonymous",
      "date posted": "12/21/22 (Wed) 01:14:09 PM",
      "post content": "That’s how I feel about superhero comics, I end up going to /co/ on 4chan and r/dccomicscirclejerk for discussions and I know for a fact both are male dominated.I’m on a radfem gaming server and idk they don’t talk about games that much which is weird and they kicked the only member that would because a certain clique disagreed with her and pushed her buttons"
   },
   "reply_28399": {
      "reply id": "28399",
      "username": "Anonymous",
      "date posted": "12/21/22 (Wed) 01:16:33 PM",
      "post content": ">>27334I have a small confession, I never liked how tumblr does fandom, it’s so much focus on headcanons that go against canon and fanfics but I don’t like either of those. Also it probably has to do with who I follow but I can’t get away from “OMG THIS CHARACTER IS GAY, THAT CHARACTER IS TRANS!!!” crowd"
   },
   "reply_28400": {
      "reply id": "28400",
      "username": "Anonymous",
      "date posted": "12/21/22 (Wed) 02:26:33 PM",
      "post content": ">>28399Nta but same, and I especially hate \"shipping\". They're obsessed with it."
   },
   "reply_28412": {
      "reply id": "28412",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 12:23:30 AM",
      "post content": ">>27324Ignoring male filth is like eating and breathing to me"
   },
   "reply_28686": {
      "reply id": "28686",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 03:55:32 PM",
      "post content": ">>27336Many girl groups are actually targeted towards men in Korea but otherwise I agree with this. I like to lurk dead livejournals and fansites and it was nice how unapologetically female they where. It's not that they went out of their way to discuss how something appealed to women  but they just enjoyed what they liked without worrying about men. Nowadays you have to see a gazillion \"it hurts mens feelings when women like attractive characters and actors so it's important we uplift fat men who are they same age as our fathers to not make them sad\" takes between fandom posting because got forbids that women has any sort of powerfantasy.Sometimes you do find a woman who has been active in the same fandom for 20 years but it's extremely rare. And they also have stopped producing content. They just pop in to occasionally chat with other old fans or make short metas. Which I do appreciate. It's nice that they haven't left the fandom even if they have no time/desire to make fics and fanart. They still have the mentality that fandom is a female space so it's nice to see them continuing supporting stuff made for women rather than worrying about hurting men's feelings. There are also cases where you do find a woman who was active in your fandom 20-10 years ago but she has switched over to making fanworks for some children's manga which sucks but as long as they keep the women only mentality I'm not complaining.I get stupidly emotional when I think about this subject because even though I was geeky 10 years ago I never really participated in fandom for different reasons. If someone had warned me how bad fandom would become I would have participated when you could be a woman without having to apologise for literally everything>>28399>>28400I like shipping and headcanons but I get this. I think it takes up too much of fandom. My favourite fandom thing is metas but those are rare and even then the meta writers have tendency to mix up the official source material with the version they made up in their head. Male fandom spaces sucks because it's all about listing trivia to prove you are the most knowledgeable and getting the biggest collection. There is no deeper discussion. And while female fandom spaces do have deeper discussion it's only from a shipping point of view"
   },
   "reply_28691": {
      "reply id": "28691",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:15:11 PM",
      "post content": ">>28686What do you mean by metas? How is that different from listing trivial things."
   },
   "reply_28692": {
      "reply id": "28692",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:16:58 PM",
      "post content": ">>28686> If someone had warned me how bad fandom would become I would have participated when you could be a woman without having to apologise for literally everythingSame I somewhat regret mostly reblogging posts on tumblr I wish I did more cringe fanart"
   },
   "reply_28693": {
      "reply id": "28693",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:21:14 PM",
      "post content": ">>28686I also like meta but I've never seen a female fan do meta that wasn't centered around shipping which pisses me off. I don't care for shipping so I tend to like male meta writers because they focus on the plot more"
   },
   "reply_28694": {
      "reply id": "28694",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:24:17 PM",
      "post content": ">>28691NTA but metas are usually in-deep readings/analysis on a subject/character as far I know"
   },
   "reply_28695": {
      "reply id": "28695",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:35:03 PM",
      "post content": ">>28691Basically what >>28694 said. By listing trivia I mean going \"uhm actually the lore in episode 15 contradict itself because in the spin off book written in 1996 it is said that […]\". Metas focus more on getting a better understanding of the characters and the world they live in and how it effects their daily lives while trivia listing is just stating the facts without looking much deeper into it"
   },
   "reply_28696": {
      "reply id": "28696",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:41:43 PM",
      "post content": ">>28695But don't meta and trivia intersect because they both have a lot to do with canon?"
   },
   "reply_28697": {
      "reply id": "28697",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:42:41 PM",
      "post content": ">>28696They do but trivia is on a much more shallow level."
   },
   "reply_28699": {
      "reply id": "28699",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 05:48:05 PM",
      "post content": ">>28697I've never seen moids just do trivia and nothing else though. If anything they're more interested in how the plot will twist so they like to go back and reread stuff a lot to see if they're being accurate. Female fans ime will read something once, take a liking to certain ships and come up with theories based on that, then never read it back again and go straight to making fanart or something. I guess I've always just gravitated to talking about plot more which has landed me in more male dominated fan spaces than female."
   },
   "reply_28701": {
      "reply id": "28701",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 08:28:31 PM",
      "post content": ">>28693 it's not all shipping, character-centric meta is also common with female fans. When it comes to plot I've never found a shortage of female fans to bounce off ideas with."
   },
   "reply_28702": {
      "reply id": "28702",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 08:29:54 PM",
      "post content": ">>28699I'm assuming you've never been on tumblr?"
   },
   "reply_28705": {
      "reply id": "28705",
      "username": "Anonymous",
      "date posted": "12/22/22 (Thu) 10:26:22 PM",
      "post content": ">>28701I care less about characters than plot>>28702I was mainly talking about tumblr actually lmao"
   },
   "reply_28709": {
      "reply id": "28709",
      "username": "Anonymous",
      "date posted": "12/23/22 (Fri) 12:09:07 AM",
      "post content": ">>28705I guess it depends on the fandom, I used to follow several female theorists on tumblr and aside from the monthly chapter discussions, I remember them predicting several plot twists based on clues from previous chapters…"
   },
   "reply_28712": {
      "reply id": "28712",
      "username": "Anonymous",
      "date posted": "12/23/22 (Fri) 12:27:51 AM",
      "post content": ">>28709I followed some Steven Universe bloggers back when the show aired that managed to predict the whole showbut then again people also tinfoil that the writers took plot points from fan theorists because they hadnt planned an ending"
   },
   "reply_28715": {
      "reply id": "28715",
      "username": "Anonymous",
      "date posted": "12/23/22 (Fri) 12:49:57 AM",
      "post content": ">>28712I was in the black butler fandom and it had a big twist a 100 chapters in or so that a tiny portion of the fandom predicted while everyone else called them crazy."
   },
   "reply_28723": {
      "reply id": "28723",
      "username": "Anonymous",
      "date posted": "12/23/22 (Fri) 05:21:10 AM",
      "post content": "I hate scrotes in fandom more than anything else. They bring their degeneracy with them and ruin everything they touch. So when you're surrounded by that it's hard to even stay interested. Even if you block and stay away from every hint of them online you still have to acknowledge they exist every now and then especially when they directly interact with the subject. If women stopped coddling them too maybe some of them would be able to be shamed into shutting up and staying away."
   },
   "reply_28762": {
      "reply id": "28762",
      "username": "Anonymous",
      "date posted": "12/24/22 (Sat) 01:34:21 AM",
      "post content": "in my experience, the worst thing about male dominated fandoms arent even the males themselves; theyre easy to spot and avoid especially if you pick your platforms carefully, but it feels like the more \"masculine\" a fandom is, the more women who are into it will be some flavor of genderspecial he/him, which ruins such a huge part of fandom-produced content."
   },
   "reply_28764": {
      "reply id": "28764",
      "username": "Anonymous",
      "date posted": "12/24/22 (Sat) 01:39:14 AM",
      "post content": ">>28762>but it feels like the more \"masculine\" a fandom is, the more women who are into it will be some flavor of genderspecial he/himOpposite of my experience. The most TIFs ime are in heavily female-dominated fandoms which is ironic, the few girls in male dominated fandom like to flaunt their femaleness to seem not like other girls."
   },
   "reply_28766": {
      "reply id": "28766",
      "username": "Anonymous",
      "date posted": "12/24/22 (Sat) 07:23:48 AM",
      "post content": ">>27324all the anime/manga i like is stuff my brother watches and its just standard bullshit like berserk and what ever he likes"
   },
   "reply_28770": {
      "reply id": "28770",
      "username": "Anonymous",
      "date posted": "12/24/22 (Sat) 02:09:47 PM",
      "post content": ">>27326touhou has alwas been a moid heavy fandom since the beginning, sure theres some of us who make content but for every women doing writing songs theres a dozen more scrotes drawing cirno scat or somethingand with zun approve waifu baiting gachas that isn't going to get any betteri wish there were more women discussing lore online instead of hearing about potential boob sizes for over 10 years"
   },
   "reply_28772": {
      "reply id": "28772",
      "username": "Anonymous",
      "date posted": "12/24/22 (Sat) 03:23:59 PM",
      "post content": ">>27326I miss when it was Cristina Vee making Bad Apple covers. Moids really do infect everything. It’s so shit."
   },
   "reply_29781": {
      "reply id": "29781",
      "username": "Anonymous",
      "date posted": "02/25/23 (Sat) 04:21:20 PM",
      "post content": ">>27325Very late to respond to your post, but I also play Azur Lane. Who is your number one wife? It's a tie between Amagi and Glorious for me"
   },
   "reply_29790": {
      "reply id": "29790",
      "username": "Anonymous",
      "date posted": "02/27/23 (Mon) 10:10:32 AM",
      "post content": "i hate how recently discord moids are appropriating female-oriented media they didn't give a shit about years ago when they came out, just because they happen to have a predominantly girls cast (and don't even know it's not made with them in mind, completely missing the point). picrel is the prime example. a show that metaphorically depicts the struggles of being a woman and of how males pitch us against each other, reduced to a misdepiction of it as a brainded moe harem. i wish they would keep eating up their abundance of shit shows and left our stuff alone."
   },
   "reply_29796": {
      "reply id": "29796",
      "username": "Anonymous",
      "date posted": "02/28/23 (Tue) 05:41:39 AM",
      "post content": ">>29790One of the things I wish never happened is men getting into magical girl manga/anime too, I hate it so much"
   },
   "reply_29799": {
      "reply id": "29799",
      "username": "Anonymous",
      "date posted": "02/28/23 (Tue) 09:45:17 AM",
      "post content": ">>29790if moids get to tokyo mew mew i'll kill someone"
   },
   "reply_29801": {
      "reply id": "29801",
      "username": "Anonymous",
      "date posted": "02/28/23 (Tue) 11:31:29 AM",
      "post content": ">>29796The new Precure season got a male lead cure & it makes me so angry. I dont follow it anymore outside of checking the yearly new designs, but I used to love it when I was little and I hate that they added a guy to the main group when Precure was always meant to be an inspiration & fantasy for little girls. The design itself is super cute, it's a shame they had to make it a boy.I hope it will be a one-time thing for inclusivity points… I don't want any ~boys can be magical too~ shit, men already got 80% of anime catering to them."
   },
   "reply_29802": {
      "reply id": "29802",
      "username": "Anonymous",
      "date posted": "02/28/23 (Tue) 12:13:35 PM",
      "post content": ">>29801what's the point of it, I don't get it(inb4 ayden money)"
   },
   "reply_29803": {
      "reply id": "29803",
      "username": "Anonymous",
      "date posted": "02/28/23 (Tue) 12:45:39 PM",
      "post content": ">>29802Trannies are rare in Japan (and isn't like the industry tries to catter them anyways) but Precure is known for being progesive in a way because since its a show for kids one of its core themes is acceptance/friendship. They had stuff like boys in dresses, lesbians, black girls etc before which is fine, but I wish they had kept the main group as female-only since there aren't many good media with female role models made for little girls."
   },
   "reply_29832": {
      "reply id": "29832",
      "username": "Anonymous",
      "date posted": "03/02/23 (Thu) 05:27:39 AM",
      "post content": ">>29801Yeah this is not it. Seems like its defeating the purpose of precure as a whole"
   },
   "reply_29863": {
      "reply id": "29863",
      "username": "Anonymous",
      "date posted": "03/04/23 (Sat) 10:56:29 PM",
      "post content": ">>29861by the bullshit posts and content produced by the (moid)fandom"
   },
   "reply_29894": {
      "reply id": "29894",
      "username": "Anonymous",
      "date posted": "03/06/23 (Mon) 03:58:15 AM",
      "post content": ">>29861While not 100% accurate, eyeballing the disparity between fanart and fanfic is pretty telling. A lady-dominated fandom usually has a shitload of fanfic comparatively, even when the fandom lacks fujobait."
   },
   "reply_29899": {
      "reply id": "29899",
      "username": "Anonymous",
      "date posted": "03/06/23 (Mon) 03:47:47 PM",
      "post content": "i know i shouldn't judge people and that i should respect their interests blah blah blah but i fucking hate seeing moids enjoying shit that was meant for women. mostly because they ruin everything with their porn-sick minds and sperg out."
   },
   "reply_29903": {
      "reply id": "29903",
      "username": "Anonymous",
      "date posted": "03/06/23 (Mon) 04:36:47 PM",
      "post content": ">>29899You're not being unreasonable. Moids do bastardize and sexualize everything that interests them. I believe it's normal to dislike male fans in general. It's not like they're great at understanding messages and themes anyway, just look at how they miss the point of Fight Club. Sorry if you already saw my post, I had a typo and wanted to correct it."
   },
   "reply_29906": {
      "reply id": "29906",
      "username": "Anonymous",
      "date posted": "03/06/23 (Mon) 08:16:57 PM",
      "post content": ">>27326>touhou in particular has become completely ruined by its moid fandom in recent yearsTo be fair, Touhou has also gotten much more popular in recent years, which is the biggest factor in why the fanbase is so bad nowadays. In my experience there are a lot more women into touhou now than ever.Which doesn't mean it isn't the moids ruining the fanbase, it definitely is, but back then it was even more male dominated and I could search for touhou pictures without having to filter the massive amount of porn I have to filter now."
   },
   "reply_30034": {
      "reply id": "30034",
      "username": "Anonymous",
      "date posted": "03/14/23 (Tue) 09:39:08 PM",
      "post content": ">>27331>Friendship making seems pretty hopeless for meaww baby, hang in there. explore the world a little more and you'll stumble upon a place where you feel you belong, and enjoy the wholesome friendships it has to offer eventually. good luck!"
   },
   "reply_30041": {
      "reply id": "30041",
      "username": "Anonymous",
      "date posted": "03/15/23 (Wed) 09:33:37 AM",
      "post content": ">>29899thinking about how my childhood show Totally Spies is just a glorified moid fetish show…"
   },
   "reply_30082": {
      "reply id": "30082",
      "username": "Anonymous",
      "date posted": "03/19/23 (Sun) 04:19:20 AM",
      "post content": ">>30081Sometimes I wonder if some of those fetishes get started because of shows like that influencing people at a young age or were fetishes the creators already had that they spread around and propagated through their works."
   },
   "reply_30085": {
      "reply id": "30085",
      "username": "Anonymous",
      "date posted": "03/19/23 (Sun) 06:25:15 AM",
      "post content": ">>30082I've chosen to believe this stemmed from ancient times where archdemons would project vile imagery onto others via telepathy, and then they would feel compelled to spread the word of their visions"
   },
   "reply_30097": {
      "reply id": "30097",
      "username": "Anonymous",
      "date posted": "03/20/23 (Mon) 05:08:59 PM",
      "post content": ">>30041I'm kinda on the fence when it comes to calling Totally Spies a fetish show.On one hand, this stuff does exist and did happen in the show. On the other hand, it really wasn't too different from what other 'toons had as jokes at the time, and makes me wonder if the reason we think this way about Totally Spies in particular is because of its art style and modern internet culture making everything sexual."
   },
   "reply_30100": {
      "reply id": "30100",
      "username": "Anonymous",
      "date posted": "03/20/23 (Mon) 05:17:50 PM",
      "post content": ">>30097I feel the same way, even about stuff like Kill la Kill. It all came off as physical humor to me. Like, I can totally SEE why people are calling it fetish stuff but I watched it at an age where I was already tripping over fetish art online and it didn't give me that same feeling. Maybe I was just desensitized already haha."
   },
   "reply_33757": {
      "reply id": "33757",
      "username": "Anonymous",
      "date posted": "02/23/24 (Fri) 10:46:47 AM",
      "post content": "I particurlarly hate how a lot of moids in male dominated otaku spaces are obsessed with loli. It's leggit annoying. I see this in touhou/vocaloid/higurashi (fandoms I'm fairly active in) and it's just so tiring. Like why do they have to shoe horn their fetish into the stories/media they like? You could argue that for Higurashi (particularly the VN) you had some distateful loli scenes but even then why focus on cooming to this than the complex story you're reading? I have heard from a moid that the Higurashi fandom has more women than I might initially think but the fandom feels moid infested nonetheless."
   },
   "reply_33759": {
      "reply id": "33759",
      "username": "Anonymous",
      "date posted": "02/23/24 (Fri) 04:54:38 PM",
      "post content": "xmpp is male dominated and i hate it i wish there were more women on xmpp"
   },
   "reply_33895": {
      "reply id": "33895",
      "username": "Anonymous",
      "date posted": "03/03/24 (Sun) 07:36:29 AM",
      "post content": "the \"fighting game community\" at large is COMPLETELY FILLED TO THE BRIM with porn addicted moids/trannies and it's so disheartening. it feels impossible to even find a libfem who enjoys this shit, let alone other femcels. i wish there were more yumes who played fighting games, because theyre the only ones who are actually fun to talk to"
   },
   "reply_33896": {
      "reply id": "33896",
      "username": "Anonymous",
      "date posted": "03/03/24 (Sun) 11:47:27 AM",
      "post content": ">>33895why is this an issue? it's just a torso"
   },
   "reply_33897": {
      "reply id": "33897",
      "username": "Anonymous",
      "date posted": "03/03/24 (Sun) 03:32:07 PM",
      "post content": ">>33895The fighting game community is kind of insufferable to begin with, even discounting the porn addicts."
   },
   "reply_33898": {
      "reply id": "33898",
      "username": "Anonymous",
      "date posted": "03/03/24 (Sun) 07:26:08 PM",
      "post content": ">>33895>>33897When you say \"community\", you mean the people commenting under the vids?"
   },
   "reply_33900": {
      "reply id": "33900",
      "username": "Anonymous",
      "date posted": "03/04/24 (Mon) 12:48:39 PM",
      "post content": ">>33759XMPP sucks though"
   },
   "reply_33901": {
      "reply id": "33901",
      "username": "Anonymous",
      "date posted": "03/05/24 (Tue) 05:49:20 AM",
      "post content": ">>33898No I mean the people who go to events and such."
   },
   "reply_33906": {
      "reply id": "33906",
      "username": "Anonymous",
      "date posted": "03/05/24 (Tue) 09:41:47 PM",
      "post content": "Majority of any fandom is coomers, just ban all coomers from platform where it's being discussed and it won't matter if it's male or female fandom anymore because only real discussions will be had."
   },
   "reply_33918": {
      "reply id": "33918",
      "username": "Anonymous",
      "date posted": "03/07/24 (Thu) 04:59:57 PM",
      "post content": "What's interestesting is seeing how much more creative the female side of fandom is: fanart, fanfiction, group projects, roleplaying, merchandise, cosplay, crochet, crafts, character insp-boards, character inspired makeup tutorials etc. The only male-dominant type of fanwork that comes to mind is music and fangames and porn."
   },
   "reply_33919": {
      "reply id": "33919",
      "username": "Anonymous",
      "date posted": "03/07/24 (Thu) 06:28:53 PM",
      "post content": ">>33918This schism is why I didn't understand the \"no girls on the internet\" bit when I finally got around to PC gaming and 4chan in like 2004. Until that point I had spent years in fandom spaces almost exclusively with other girls. More like no boys on the internet!>and pornHonestly if we are just talking about drawn stuff I don't think it's male dominated. Male leaning maybe. 3dpd though, totally male dominated."
   },
   "reply_34678": {
      "reply id": "34678",
      "username": "Anonymous",
      "date posted": "05/27/24 (Mon) 09:43:40 PM",
      "post content": ">>29796first time poster but you have no idea how exhausting it is to try and talk abt magical girls w/o it devolving into a discussion abt genderspecialssailor moon is a good example of this. it has been infested with trans who bring nothing to the convo its so annoying"
   },
   "reply_34681": {
      "reply id": "34681",
      "username": "Anonymous",
      "date posted": "05/28/24 (Tue) 02:46:02 AM",
      "post content": "2hu fans are mostly 30 year old moids, fumofags, or toddlers. huge con of being a large doujin community is that moids constantly repost/create fanon depictions of boring, big breasted 2hus. I have a lot of female touhou friends and saw a some at touhoufest. unfortunately ZUN having same faced syndrome and (admitting to) not being able to draw adult faced characters and having many childlike characters makes for a lot of lolicon scrotes. (see: flan, rumia, cirno/dai, every other irrelevant toddler)"
   },
   "reply_34682": {
      "reply id": "34682",
      "username": "Anonymous",
      "date posted": "05/28/24 (Tue) 02:48:06 AM",
      "post content": "saw some*"
   },
   "reply_34711": {
      "reply id": "34711",
      "username": "Anonymous",
      "date posted": "06/03/24 (Mon) 05:10:22 AM",
      "post content": "It's the same when you try to get into some history topics eg. Ancient Rome. Being the only female fan leaves the incel fanboys to go after you."
   },
   "reply_34784": {
      "reply id": "34784",
      "username": "Anonymous",
      "date posted": "06/19/24 (Wed) 04:25:40 AM",
      "post content": ">>33919>Until that point I had spent years in fandom spaces almost exclusively with other girls.Same. As a preteen I was friends with a lot of nerd girls, both offline and online, so I was surprised to find out that the anime and furry fandoms were actually male-dominated when I had only been exposed to the female side of those as a child and saw them as “girly” hobbies."
   },
   "reply_34801": {
      "reply id": "34801",
      "username": "Anonymous",
      "date posted": "06/20/24 (Thu) 11:57:23 PM",
      "post content": ">>27326>>27328https://www.animeherald.com/2018/11/14/anime-didnt-make-me-trans-it-saved-my-life/Why single out just touhou though? The entire anime fandom in general is full of troons or what could basically be classified as psychologically troon adjacent men. Most normal moids think anime is really dumb or just stereotype it as weird loli tentacle hentai."
   },
   "reply_35180": {
      "reply id": "35180",
      "username": "Anonymous",
      "date posted": "08/26/24 (Mon) 11:29:46 AM",
      "post content": ">>27324Fuck it, posting in an old threadIt really bothers me how shitty the touhou fandom is because I actually really like touhou. I have to dig through piles of trash and garbage just to be able to get a nice discussion with someone who's actually played a game or read a printwork. It's horrible. Porn addicted moids just don't care to learn about it.All of this is made infinitely worse by one of my favorites being Sanae. I feel like I've grown thicker skin over time but the things some people post still bother me. If half the people posting could let go of their dicks for 2 seconds it'd be bliss"
   },
   "reply_35201": {
      "reply id": "35201",
      "username": "Anonymous",
      "date posted": "08/30/24 (Fri) 10:43:03 AM",
      "post content": ">>35180Same , moids are the worst of the fandom, they don't even play the games and they are talking about unless they wanna spam how much better they are than everyone else, they only ship the characters they find hot without caring about any character dynamics, the lore only matters if they wanna powerlevel sperg and a huge amount of memes they create are just coomer shit (sakuya pads). There are no character studies, only porn, their favorite characters are based on who's the hottest, they ignore characterization in favor of their fetishes.For every moid that talks about how women only get into things because the guys are hot and don't care about the story/characters, I'm glad to have the western touhou fandom too point women at when they get insecure they aren't \"true fans\"."
   },
   "reply_35203": {
      "reply id": "35203",
      "username": "Anonymous",
      "date posted": "08/30/24 (Fri) 11:56:10 AM",
      "post content": ">>34801trust me anon touhou has a massive troon problem even compared to other anime shit. you will understand our pain when you see some stupid autistic redditor saying that your favorite touhou girl made them trans. picrel>>35180>>35201whenever you check the recent touhou popularity polls, the amount of people who never play the game in question is always too high (~50%) and the amount of children/teens in the fanbase with zero reading comprehension is rising. i think this is both a male and western problem because japanese moids actually do play the games, read the print works, etc. meanwhile, every single touhou scrote i've interacted with is all \"fumos!! fumos cute!! haha i love koosher shes such a small wittle bean\" they only consume western fanwork and memes of the series, which is absolute reddit slop."
   },
   "reply_35205": {
      "reply id": "35205",
      "username": "Anonymous",
      "date posted": "08/30/24 (Fri) 01:17:03 PM",
      "post content": ">>35203Yup, I hate it, fumos are so overpriced too. I don't understand how moids think liking touhou is so special and hardcore when all they do is porn and spam reddit memes"
   },
   "reply_35235": {
      "reply id": "35235",
      "username": "Anonymous",
      "date posted": "08/31/24 (Sat) 08:25:08 PM",
      "post content": ">>35203Fuck if it doesn't make me bitter. Koishi is a nice character that gets ruined by the amount of people that take some completely random fandom characterization of her.There have been days when touhou fans have made me feel sick. It's just a shame.>>35201I hate hate HATE the decade+ year old memes that still get posted by people who just can't find new jokes. Haha Sakuya pads haha Sanae slut haha Koishi murderhobo it's just ughhhhhIf everyone just played the games and acknowledged the canon personalities of these characters I'd be so happy"
   },
   "reply_35236": {
      "reply id": "35236",
      "username": "Anonymous",
      "date posted": "08/31/24 (Sat) 09:05:11 PM",
      "post content": "I want to rescue my waifu from the scrote filled fandom she's in. Saber Alt, my beloved dark knight, you don't deserve to be in that shit franchise. All her fanart is porny and gross but I want to see her kicking ass!!!"
   },
   "reply_35238": {
      "reply id": "35238",
      "username": "Anonymous",
      "date posted": "08/31/24 (Sat) 10:33:12 PM",
      "post content": ">>35235they can read the manga so they have no excuse at this point. i hate that my waifu is an old hag cause she's not a canon teen to the shitty fandom."
   },
   "reply_35242": {
      "reply id": "35242",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 02:40:26 AM",
      "post content": ">>35236Saber's boring anyway Rin is better.Queen deserves an archer bf."
   },
   "reply_35245": {
      "reply id": "35245",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 08:48:35 AM",
      "post content": ">>35180>>35201>>35203>>35235You have this beautiful, magical world, full of secrets and intrigue and lore, you have these wonderfully designed characters, nice personalities, with flaws and interests and upsides, you have all this amazing music and these great games… and what does the majority of every discussion contain? Oh lol sex"
   },
   "reply_35303": {
      "reply id": "35303",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 05:51:56 PM",
      "post content": ">>35245although i despise them, a part of me is happy that men will never appreciate and know touhou as deeply as women do. it's something that really only we get to enjoy at this point. they will never know that parsee deeply values and respects others and is a really kind person. they will NEVER know that okuu preens satori's hair. it's a part of touhou they will never be able to defile because their minds are gooned out on so much porn that they never look beyond the surface level of the series.>>35235i think koishi is a perfect example of how men are incapable of understanding complex female characters. fanon portrayal of her was nice and pretty accurate until ULiL came out, where male fans latched onto her and turned the lonely girl who says things like \"Thanks for spending time with me!\" into a braindead insane manic pixie dream girl. male fans seem intent on denying her complexity and just spread lies about her instead. i could sperg about this for actual hours but i cannot subject others to my autism without consent…"
   },
   "reply_35304": {
      "reply id": "35304",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 06:25:39 PM",
      "post content": ">>35303I don't mind talking if it means I get to share some atmospheric picsKoishi is a character whose fandom I can't stand at this point, kinda like Flandre's. It's such a complete sidelining of the actual personality in favor of some \"SHE'S GONNA MURDER U SHE'S SO QURIKY XD\" crap that I can't even see it as the same characterYuuka's schtick of being a woman who's both extremely powerful but also at peace with herself, of being someone who likes to mess with people and to make herself look scarier than she actually is gets turned into some sadist shit.Tenshi's personality of being an immature girl who's looking for thrill and entertainment gets her portrayed as a masochist.Aya's whole life is a constant struggle against her hierarchical society and trying to keep her newspaper afloat, her grasping at straws and twisting the truth just so she can get something to put in there… gets completely sidelined and she's shown as a pervert.Sanae's insecurity about her own job position, her cowardice in the face of her own gods when she has ambitions to be worshipped just like them, her geeky interest in the things that she left behind in the outside world and the sheer amount of fun she has pretending to be the main character of her own story… nope, not even acknowledged. She's either an idiot or promiscuous.Satori not minding being able to read minds and not really having anyone to keep her company is sidelined in favor of her being sad and depressive.Parsee is kind and can talk normally to people and only gets jealous after the conversation - nope, she's always an asshole.Yuyuko is made into a glutton because of like 1 dialogue line in IN.Youmu's a determined hardass who'd cut anyone who threatens Yuyuko down in an instant and is a master at her art but is scared by inane things but nope she's shown as a shy coward uguu that can't do anything by herselfEiki's whole fandom characterization is complete character assassination that is so off that it disgusts meI can go on for ages, the better personalities and deeper traits get thrown out for complete GARBAGE. It's ok if it's for a couple jokes… but after years and years of the same stuff… I can't stand seeing it in every discussion, or being taken seriously."
   },
   "reply_35320": {
      "reply id": "35320",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 06:48:30 AM",
      "post content": "Really specific issue I have as a toku fan where the general perception is that the adult fanbase is male dominated despite the fact that the majority of the fan content output comes from women."
   },
   "reply_35321": {
      "reply id": "35321",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 06:58:41 AM",
      "post content": ">>29801Old post but this is part of a general push in Toei's IPs to push gender norms a bit.  Recent years have seen female riders with actual plot prominence for the first time, with the last season having a female secondary for the first time in the series' history (big because the secondary archetype is the most important character after the MC).You're still entitled to your anger though and I'm with you on it, because Cure Wing was a decent character while the female riders in Kamen Rider have been hollow facsimiles of representation constantly sidelined and disrespected by the narratives that are allegedly now centering them.  Boys shouldn't get shit in Precure, at least not until girls get at least one decent female rider who isn't immediately upstaged in the story by her father (weirdly specific plot development they've used in 3 consecutive seasons now)."
   },
   "reply_35493": {
      "reply id": "35493",
      "username": "Anonymous",
      "date posted": "09/07/24 (Sat) 01:23:44 PM",
      "post content": ">>35320Is it? The going meme on /m/ is that toku has only two audiences: little boys and housewives."
   },
   "reply_35605": {
      "reply id": "35605",
      "username": "Anonymous",
      "date posted": "09/12/24 (Thu) 09:51:16 AM",
      "post content": ">So many male dominated fandoms would become much better if it had a majority of women. I wonder if others feel that wayYou only think that so that it will appeal to female interest instead of maleBest case would be a split of 50/50 so everyone can have something they want"
   },
   "reply_35607": {
      "reply id": "35607",
      "username": "Anonymous",
      "date posted": "09/12/24 (Thu) 03:58:27 PM",
      "post content": ">>35605I have no personal interest or desire in tolerating men's wants in media. It brings the quality and enjoyment down."
   },
   "reply_35609": {
      "reply id": "35609",
      "username": "Anonymous",
      "date posted": "09/13/24 (Fri) 06:04:13 AM",
      "post content": ">>35605>You only think that so that it will appeal to female interest instead of maleWoooow, really? No shit.Most things appeal to more moids one way or another. Creators are more afraid of angering their male audience than their female audience. They know that women have been conditioned into consuming shit that was made only for men, but moids rarely consume media that is exclusively for women unless they find a way to fap to the female characters."
   },
   "reply_35610": {
      "reply id": "35610",
      "username": "Anonymous",
      "date posted": "09/13/24 (Fri) 06:38:20 AM",
      "post content": ">>34801>The entire anime fandom in general is full of troons or what could basically be classified as psychologically troon adjacent menTrue, see picrel.>>35201>their favorite characters are based on who's the hottestHottest according to fanart btw, they don't seem to even know what the characters look like in canon>I'm glad to have the western touhou fandomIt's the Eastern fandom too kek a huge amount of porn is drawn by Asian scrotes who also don't play the games. Though I do agree that probably because it's harder to play the games outside Japan + the recent western trend of zoomers not consuming the actual media and just reading other people's headcanons and memes, they're more common here.>>35304>Yuuka's schtick of being a woman who's both extremely powerful but also at peace with herself, of being someone who likes to mess with people and to make herself look scarier than she actually is gets turned into some sadist shit.>Tenshi's personality of being an immature girl who's looking for thrill and entertainment gets her portrayed as a masochist.>Aya's whole life is a constant struggle against her hierarchical society and trying to keep her newspaper afloat, her grasping at straws and twisting the truth just so she can get something to put in there… gets completely sidelined and she's shown as a pervert.>Sanae's insecurity about her own job position, her cowardice in the face of her own gods when she has ambitions to be worshipped just like them, her geeky interest in the things that she left behind in the outside world and the sheer amount of fun she has pretending to be the main character of her own story… nope, not even acknowledged. She's either an idiot or promiscuous.So many Touhou fandom personalities are so pornbrained. Males are such simple-minded beings."
   },
   "reply_35642": {
      "reply id": "35642",
      "username": "Anonymous",
      "date posted": "09/21/24 (Sat) 10:11:16 AM",
      "post content": "For me it's metal. Arguably a stupid genre to be into but it's so male dominated that it feels very lonely as a woman, especially when you start to get into the more underground stuff."
   },
   "reply_35662": {
      "reply id": "35662",
      "username": "Anonymous",
      "date posted": "09/26/24 (Thu) 10:53:27 AM",
      "post content": "Team fortress 2It was fun but it was hell"
   },
   "reply_35663": {
      "reply id": "35663",
      "username": "Anonymous",
      "date posted": "09/26/24 (Thu) 10:57:40 AM",
      "post content": ">>35642Tsmt. Especially with the black and death/brutal death metal."
   },
   "reply_35738": {
      "reply id": "35738",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 11:17:34 PM",
      "post content": ">>35663What I hate the most is seeing women emulate men's retarded behavior. It's genuinely the worst music based fanbase out there I've known so far (and I've been nerdy about music for years now). I dont know if other genres have these retarded moid sperg fights. Sometimes I wonder if they even like the music they're listening to, or if they just like jerking off over the idea of listening to unacessible music. The amout of pick me type behavior from women within the scene is also tiring. Quite a rant I guess. Picrel kinda related."
   },
   "reply_35813": {
      "reply id": "35813",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 01:17:06 PM",
      "post content": ">>35738Willing to agree to this but also, there's nothing really special about how metalheads behave vs. the general population besides sperging and elitism. Women acting a certain way to attract a speific subset of men? Not unheard of. But it's also fun when a stupid metalhead sperg thinks you're only in it for attention before you prove it otherwise kekBut also some metalheads are incredibly chill, mostly the ones that listen to sludge or doom. I've talked to some for hours with us just trading music recs, it's the rare occasion where i had fun talking to moids"
   },
   "reply_35814": {
      "reply id": "35814",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 01:18:47 PM",
      "post content": ">>35609Moids literally think female oriented media is intelectually inferior because it has less hyper sexualized women in it lol."
   },
   "reply_35822": {
      "reply id": "35822",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 03:44:37 PM",
      "post content": ">>35814 they want to be with women but yet often hate our \"feminine\" interests"
   },
   "reply_35826": {
      "reply id": "35826",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 03:30:29 AM",
      "post content": ">>33759Anything tech in general seems to be severely male-dominated.I once read a blog post by John Ohno (iirc) where he argued that the problem with women in tech is the fact that they aren't familiar with the tech-1337-haxx0r culture and need to read something like Cathedral and Bazaar first. Well, no shit. Of course women aren't familiar with cultures that were built to exclude them. Still, I find a lot more girls around privacy and cybersec circles nowadays and realizing this fact makes me feel kind of relieved(?)."
   },
   "reply_35827": {
      "reply id": "35827",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 05:38:35 AM",
      "post content": ">>35662Did you ever use TF2chan back in the day?"
   },
   "reply_35828": {
      "reply id": "35828",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 05:57:01 PM",
      "post content": ">>35738>death metal>inaccessible musicyou've got to be kidding me right"
   }
}