{
   "thread number": "35486",
   "original post": " 80s/90s anime Anonymous 09/07/24 (Sat) 09:30:06 AM35486Recommend /discuss the best and most aesthetically pleasing 80s/90s anime",
   "reply_35522": {
      "reply id": "reply_35522",
      "content": "Anonymous 09/08/24 (Sun) 04:33:43 PM35522 GIF 5-30-2024 11-4… Kodocha is visually amazing, with a stellar dub and a female protag that actually acts somewhat like a real kid. She's a cartoon character through and through, but the show is years more grounded and entertaining than any other anime (or frankly, media in general) I've seen that focuses on children. Very very good for a shoujo comedy."
   },
   "reply_35525": {
      "reply id": "reply_35525",
      "content": "Anonymous 09/08/24 (Sun) 07:07:10 PM35525Will we be watching the Ranma reboot?"
   },
   "reply_35627": {
      "reply id": "reply_35627",
      "content": "Anonymous 09/19/24 (Thu) 09:17:56 AM35627>>35525absolutely not.I am really wondering how fans will feel watching it an year after the lum anime, and seeing the rumiko self-insert winning this time over Lum."
   },
   "reply_35690": {
      "reply id": "reply_35690",
      "content": "Anonymous 10/05/24 (Sat) 10:11:29 PM35690>>35522God, Kodocha just is that good isn't it? Maybe I can get my friends to watch along with me one day.>>35486I've been watching a little bit of Oniisama E. It's really gorgeous though kinda \"stiff\" looking though I'm not complaining cause I enjoy that aspect too. If you like the European school setting, I think you  will like the style because it goes for that despite being set in Japan. Nothing too deep to say since my watches are so far apart, but it's good if you like interpersonal drama. I love how it makes highschool feel so highstakes lol. I think the setting before cellphones and internet makes me enjoy the drama more. It makes your personal life more important because you can't escape to the net. Highschool was really uneventful for me because I was always on the damn computer, and my phone.  I love Mariko's intense over the top feelings, it might feel kinda unrealistic but to me she feels like a genuinely mentally unwell person with attachment issues loll. Love it. So many good female characters to choose from for a favorite."
   },
   "reply_35705": {
      "reply id": "reply_35705",
      "content": "Anonymous 10/08/24 (Tue) 05:41:50 AM35705>>35522I feel like kodocha reminds me of Karekano, both the anime and the manga, I do appreciate some of the humor but I never got that much into neither despite finishing them.My personal favorite is fruits basket"
   },
   "reply_35747": {
      "reply id": "reply_35747",
      "content": "Anonymous 10/13/24 (Sun) 11:06:48 AM35747 moid destroyer.web… >>35627Well I think it's cute."
   },
   "reply_35777": {
      "reply id": "reply_35777",
      "content": "Anonymous 10/18/24 (Fri) 12:50:13 AM35777kite is based and SApilled"
   },
   "reply_35778": {
      "reply id": "reply_35778",
      "content": "Anonymous 10/18/24 (Fri) 03:20:26 AM35778>>35486maison ikkoku"
   },
   "reply_35780": {
      "reply id": "reply_35780",
      "content": "Anonymous 10/18/24 (Fri) 05:58:32 AM35780 Mahoujin-Guru-Guru… >>35486Most anime completely fails at making me laugh but this did. I'm not sure why its never talked about"
   },
   "reply_35782": {
      "reply id": "reply_35782",
      "content": "Anonymous 10/19/24 (Sat) 06:45:44 AM35782>>35747>smooth washed up animationew"
   },
   "reply_35783": {
      "reply id": "reply_35783",
      "content": "Anonymous 10/19/24 (Sat) 10:19:25 AM35783>>35782How are you embittered over a moving image anon"
   },
   "reply_35787": {
      "reply id": "reply_35787",
      "content": "Anonymous 10/20/24 (Sun) 02:39:51 AM35787 28128_1.jpg Was so great and had the best OP song I've ever heard"
   },
   "reply_35829": {
      "reply id": "reply_35829",
      "content": "Anonymous 10/29/24 (Tue) 07:19:57 PM35829 c231a98b020e6d3205… >>35778I watch Maison Ikkoku almost every fall/winter, it's so cozy…"
   }
}