{
   "thread number": "273609",
   "original post": "Anonymous 06/17/24 (Mon) 12:39:42 PM273609Is hookup culture and casual sex ever worth it?",
   "reply_273617": {
      "reply id": "reply_273617",
      "content": "Anonymous 06/17/24 (Mon) 02:01:19 PM273617I will NEVER be able to understand any woman who engages in it. I know women who will compulsively swipe through dating apps all week, agonise of having to look nice for their dates, get anxiety because the guy they've chosen suggested a bar/restaurant/public space that's unsafe in some way, then proceed to GO HOME WITH THEM and have sex that, by their own admission, is not enjoyable 50% of the time and doesn't result in orgasm 75% of the time, then leave and never speak to them again. I'm absolutely convinced it's an exorcise in neurosis, built entirely around their own ego. They are willing to risk assault, death and dismemberment to be used as a sex toy for a few fleeting moments of validation between complimenting her at the bar and asking her to leave as he flushes the condom."
   },
   "reply_273619": {
      "reply id": "reply_273619",
      "content": "Anonymous 06/17/24 (Mon) 02:14:40 PM273619>>273609No. Any moid who engages in casual sex is a slut, so any moid you could hookup with is a moid you shouldn't."
   },
   "reply_273632": {
      "reply id": "reply_273632",
      "content": "Anonymous 06/17/24 (Mon) 04:51:37 PM273632nope. never ever, ever."
   },
   "reply_273634": {
      "reply id": "reply_273634",
      "content": "Anonymous 06/17/24 (Mon) 05:15:35 PM273634 1687794908211927.j… >andrew>24>5'9>\"DJ\"I laughed so hard at that. That's so fucking pathetic."
   },
   "reply_273638": {
      "reply id": "reply_273638",
      "content": "Anonymous 06/17/24 (Mon) 06:43:57 PM273638>>273609ESL here, is Tucker a real name?"
   },
   "reply_273644": {
      "reply id": "reply_273644",
      "content": "Anonymous 06/17/24 (Mon) 08:06:44 PM273644>>273638it really is nona"
   },
   "reply_273679": {
      "reply id": "reply_273679",
      "content": "Anonymous 06/18/24 (Tue) 12:48:36 PM273679>>273609I'd say yes if you enjoyed pursuing and seducing moids, but there is no challenge in chasing them. It's like shooting trash fish in a barrel, isn't it?"
   },
   "reply_273680": {
      "reply id": "reply_273680",
      "content": "Anonymous 06/18/24 (Tue) 01:55:25 PM273680>>273609no, you should never defile your body with moids"
   },
   "reply_273696": {
      "reply id": "reply_273696",
      "content": "Anonymous 06/18/24 (Tue) 06:16:15 PM273696>>273617if you enjoy sex, i guess"
   },
   "reply_273785": {
      "reply id": "reply_273785",
      "content": "Anonymous 06/20/24 (Thu) 10:14:03 PM273785>>273609Never. In college I hooked up with some douchey frat moid because my sorority kept pushing me to do it. Lost my virginity to that fucker. Left me feeling really empty and depressed for months afterwards.Worst decision of my life."
   },
   "reply_273803": {
      "reply id": "reply_273803",
      "content": "Anonymous 06/21/24 (Fri) 10:50:31 AM273803>>273617without hookups and casual sex they'd be stuck with one of those guys permanently."
   },
   "reply_273805": {
      "reply id": "reply_273805",
      "content": "Anonymous 06/21/24 (Fri) 11:12:09 AM273805>>273609Casual sex is for psychopathic mods and low self esteem womens"
   },
   "reply_273844": {
      "reply id": "reply_273844",
      "content": "Anonymous 06/21/24 (Fri) 08:20:47 PM273844No! Any man you meet who is only interested in casual sex Is a pig. If there are any men worth your time you won’t find them on dating apps. The hypothetical “good moid” wants marriage"
   },
   "reply_273845": {
      "reply id": "reply_273845",
      "content": "Anonymous 06/21/24 (Fri) 08:22:46 PM273845>>273844Some of us don't ever want to be married and trapped in the hell our mothers were. Stop telling me how to perceive men like its 1825 and we all have to settle down and end our lives with a stupid moid."
   },
   "reply_273846": {
      "reply id": "reply_273846",
      "content": "Anonymous 06/21/24 (Fri) 08:26:44 PM273846>>273805How is marriage not for low self-esteem stupid af women? You actually buy the crap that it will improve your life to live with a conniving, sex starved, unsatiable scrote? They only get meaner the older and uglier they get"
   },
   "reply_273847": {
      "reply id": "reply_273847",
      "content": "Anonymous 06/21/24 (Fri) 08:27:34 PM273847>>273845What’s the other option? I’m open to anything other than getting used at this point."
   },
   "reply_273848": {
      "reply id": "reply_273848",
      "content": "Anonymous 06/21/24 (Fri) 08:32:02 PM273848I firmly believe that the idea of hookup culture is a psyop invented by dating apps to sell more premium subs.>>273617don't flush condoms, it'll destroy your septic system."
   },
   "reply_273849": {
      "reply id": "reply_273849",
      "content": "Anonymous 06/21/24 (Fri) 08:32:15 PM273849>>273846So you’ll just let them fuck you then never talk to you again? I may be biased because my father was the only good man i ever met. This might all be cope tbh but I want to believe I can find love. Just don’t want to die alone."
   },
   "reply_273850": {
      "reply id": "reply_273850",
      "content": "Anonymous 06/21/24 (Fri) 08:33:57 PM273850>>273847Stop talking and having opinions for people who don't live in a backwards country. Thanks. I know you're a damn moid trying to brainwash this board with third world opinions. You only sound like you crawled out of LDS to anyone who's normal."
   },
   "reply_273851": {
      "reply id": "reply_273851",
      "content": "Anonymous 06/21/24 (Fri) 08:34:53 PM273851>>273849Lmao people die alone anyway, and usually its the woman left because the moid dies first. You're not even trying to sound like a woman."
   },
   "reply_273852": {
      "reply id": "reply_273852",
      "content": "Anonymous 06/21/24 (Fri) 08:36:25 PM273852>>273851Also oh my god dying without that kind of lifetime of burden is the REALEST gift you can ever hope to have in life."
   },
   "reply_273853": {
      "reply id": "reply_273853",
      "content": "Anonymous 06/21/24 (Fri) 08:37:43 PM273853>>273847Are you brain damaged?"
   },
   "reply_273854": {
      "reply id": "reply_273854",
      "content": "Anonymous 06/21/24 (Fri) 08:42:43 PM273854>>273849Or you can just skip being a lifetime tool for abuse and stop lying to  yourself. I think you need to get over this idea that anyone can or should save you \"from a lifetime of loneliness\" Life is lonely with or without a partner. Expecially my god if you're the type of woman who goes for the stereotype of masculinity and gets angry and breaks up when the man shows emotion or honesty with you. Which judging from the sound of this thread, is what all of you are. You're the kind of women who would dump a guy for crying because hes not acting \"like a man\". This kind of thinking is exactly why gender relations are in the gutter honestly. Encouraging men to stick to this traditional malarky that will only end in your abuse and misery."
   },
   "reply_273874": {
      "reply id": "reply_273874",
      "content": "Anonymous 06/22/24 (Sat) 06:08:17 AM273874>>273803???staying single is a perfectly viable option lmao"
   },
   "reply_273888": {
      "reply id": "reply_273888",
      "content": "Anonymous 06/22/24 (Sat) 03:11:52 PM273888>>273609No, only degenerates and dehumanized people are part of it."
   },
   "reply_273896": {
      "reply id": "reply_273896",
      "content": "Anonymous 06/22/24 (Sat) 06:41:50 PM273896>>273803The guys who have casual sex aren't always the guys who don't."
   },
   "reply_273908": {
      "reply id": "reply_273908",
      "content": "Anonymous 06/23/24 (Sun) 12:58:42 AM273908>>273609its very indicative of shitty character and low self esteem. I don't really see any situation in which the woman is winning in that scenario. It just allows shitty men to keep acting like shitty men with no consequence. Its gross."
   },
   "reply_274139": {
      "reply id": "reply_274139",
      "content": "Anonymous 06/28/24 (Fri) 10:51:04 PM274139>>273609Never, Its dirty. I'd rather stay single than let some whore male like THAT use me."
   },
   "reply_274155": {
      "reply id": "reply_274155",
      "content": "Anonymous 06/29/24 (Sat) 04:15:46 PM274155>>273617>I will NEVER be able to understand any woman who engages in itUm women enjoy sex, fun fact. I thought this was a forum for women."
   },
   "reply_274173": {
      "reply id": "reply_274173",
      "content": "Anonymous 06/29/24 (Sat) 10:53:44 PM274173>>274155Ahh yes, there are people who really enjoy eating trash."
   },
   "reply_274187": {
      "reply id": "reply_274187",
      "content": "Anonymous 06/30/24 (Sun) 01:38:30 AM274187i had casual sex once after getting out of a 7 year old relationship. it was exciting and lead to my current relationship with a genuinely good man. i didn't pick a random guy off a dating app to fuck tho. i hooked up with a friend i've known for many years. if my bf and i break up, i probably won't engage in casual sex again."
   },
   "reply_274202": {
      "reply id": "reply_274202",
      "content": "Anonymous 06/30/24 (Sun) 11:56:33 AM274202why would anybody oppose the idea of casual hookups if both of them are consenting adults? who exactly is hurt by that unless you are a \"muh marriage material\" pathetic dad bod ugly man that can only get pretty women by serving as ATM? you will get used and fucked by ugly men three times a week anyway by staying loyal to your subhuman moid"
   },
   "reply_274204": {
      "reply id": "reply_274204",
      "content": "Anonymous 06/30/24 (Sun) 12:48:33 PM274204>>274202>why would anybody oppose the idea of casual hookups if both of them are consenting adults? Because it's gross nigga"
   },
   "reply_274205": {
      "reply id": "reply_274205",
      "content": "Anonymous 06/30/24 (Sun) 01:05:07 PM274205It depends on the way each woman sees relationships and sex. But I think most of us want to have a boyfriend, at least most of the time, and I think at some point, women who have casual sex are going to have feelings for the men they date, and well, men are the usual hypocritical bastards. . So, in reality, sex and casual relationships don't work for most women, in my opinion. I never engaged on it, cause I'm anti-social, and people in general don't interest me much."
   },
   "reply_274208": {
      "reply id": "reply_274208",
      "content": "Anonymous 06/30/24 (Sun) 02:32:13 PM274208>>274202I don't mind others doing it but I think it's sad as I personally view it as a very special bonding act and I dislike the thought of many women just giving their body away for men to enjoy when it could be just as special for them. I firmly believe hookup culture benefits no one but moids. I also believe in an energy exchange that's happening when you have sex and that having lots of sex with randoms will make you miserable in the end."
   },
   "reply_274210": {
      "reply id": "reply_274210",
      "content": "Anonymous 06/30/24 (Sun) 03:07:57 PM274210>>274202>both of them are consenting adults>moid: I consent>woman: I consent>woman later: I regret"
   },
   "reply_274382": {
      "reply id": "reply_274382",
      "content": "Anonymous 07/04/24 (Thu) 06:28:40 PM274382>>274368There's always been that stereotype of people in poly relationships smelling bad. I never knew it was true until three of them came into my work, one man and two women. The guy smelled heavily of armpit sweat, he was wearing a grease-stained shirt, and the women were both wearing BDSM harnesses over their clothing. Life altering experience."
   },
   "reply_274386": {
      "reply id": "reply_274386",
      "content": "Anonymous 07/04/24 (Thu) 09:49:57 PM274386>>274202Super STDs. Google it. We are 30 years away from some bullshit that will be so resistant to medication that will have new AIDS in our hands and this time it will actually be transmittable by toilet seats."
   },
   "reply_274391": {
      "reply id": "reply_274391",
      "content": "Anonymous 07/05/24 (Fri) 03:54:38 AM274391 64935092440.jpeg >>274368It's basically this"
   },
   "reply_274392": {
      "reply id": "reply_274392",
      "content": "Anonymous 07/05/24 (Fri) 06:37:19 AM274392If its with a person you aren't really dating but have some pre established relationship with it can be. Hookups however are trash."
   },
   "reply_274435": {
      "reply id": "reply_274435",
      "content": "Anonymous 07/06/24 (Sat) 02:14:42 PM274435>>274391oldie but goodie. lol"
   },
   "reply_274538": {
      "reply id": "reply_274538",
      "content": "Anonymous 07/07/24 (Sun) 12:05:09 AM274538i was saying to my friend the other day, it is a very eye opening and some times necessary experience, it teaches u the true evil nature of moids that u may not expect if you are sheltered and think men in real life are romantic and sweet like in movies… but generally nothing about it is worth it"
   },
   "reply_274831": {
      "reply id": "reply_274831",
      "content": "Anonymous 07/11/24 (Thu) 11:34:42 PM274831>>273609no, get courting-Pilled NOW"
   },
   "reply_274840": {
      "reply id": "reply_274840",
      "content": "Anonymous 07/12/24 (Fri) 06:46:08 AM274840No, loveless sex isn’t as rewarding as a long term relationship"
   },
   "reply_275044": {
      "reply id": "reply_275044",
      "content": "Anonymous 07/16/24 (Tue) 01:27:02 PM275044>>273609>hookup culture, casual sexfine if that's what you are looking for, but have you tried dildos, vibrators and erotica/porn? Always make him wear a condom, cause semen has mind control powers. >dating appsOnly if you are smart about it. If you know that you are average and you only go after top %10 men then you are just giving them sex in exchange for unearned validation and then some 60%er will come around and he will dump you."
   },
   "reply_277827": {
      "reply id": "reply_277827",
      "content": "Anonymous 08/30/24 (Fri) 09:45:20 AM277827>>274202the orgasm gap has been documented to be way worse in casual sex vs committed relationships"
   },
   "reply_278220": {
      "reply id": "reply_278220",
      "content": "Anonymous 08/30/24 (Fri) 02:59:17 PM278220Some people enjoy it, some hate it, and some are ambivalent. Depends on the individual and who they're hooking up with."
   },
   "reply_278234": {
      "reply id": "reply_278234",
      "content": "Anonymous 08/30/24 (Fri) 03:05:40 PM278234Casual sex is for women who don't value themselves and value men way too much. Every bitch I know into this shit will be like>update, second weekend fucking with no preamble… I wonder how he feels about me :)cBitch he thinks you're a free use hole. Holy shit. It's just for low self-esteem women to get a taste of male validation because they sure as hell don't get it any other way."
   },
   "reply_278245": {
      "reply id": "reply_278245",
      "content": "Anonymous 08/30/24 (Fri) 03:10:03 PM278245>>278234Samefag but unironically it's for low IQ women. I'm not even joking."
   },
   "reply_278301": {
      "reply id": "reply_278301",
      "content": "Anonymous 08/30/24 (Fri) 03:35:28 PM278301Any sex with a scrote: Disappointing and retarded Saving yourself: Disappointing and retardedIf you're into scrotes then best bet is to be volcel unless you get the possibility and desire to have sex with a 8/10+"
   },
   "reply_278584": {
      "reply id": "reply_278584",
      "content": "Anonymous 08/30/24 (Fri) 04:44:22 PM278584>>278234Casual sex with males isn't worth it because most of them don't know how to pleasure a woman. And they're also extremely annoying. I used to engage in casual sex with scrotes because i was bored and horny but then i got a vibrator. 10/10 best decision of my life. Don't understand why a hetrosexual woman would bother with a male she's not interested in marrying anymore when a vibrator or dildo will get the job done way better than 8/10 males and it won't loiter around in your house until you awkwardly ask if it's got somewhere it needs to be"
   },
   "reply_278876": {
      "reply id": "reply_278876",
      "content": "Anonymous 08/30/24 (Fri) 06:26:05 PM278876>>278584Missed out on aftersex cuddling"
   },
   "reply_278938": {
      "reply id": "reply_278938",
      "content": "Anonymous 08/30/24 (Fri) 06:47:55 PM278938>>278876Cuddling with a smelly, sweaty scrote who didn't make you orgasm. Oh no how could a woman live with herself for missing out on that."
   },
   "reply_279217": {
      "reply id": "reply_279217",
      "content": "Anonymous 08/30/24 (Fri) 07:50:24 PM279217>>278876I'd rather not"
   },
   "reply_279459": {
      "reply id": "reply_279459",
      "content": "Anonymous 08/30/24 (Fri) 08:39:52 PM279459I've never had casual sex and I've only had sex with 1 person (who I'm still with after 9 years) but people who have casual sex kinda scare me. Idk I'd be way too scared of STDs to ever engage in that if I had never met my fiancé"
   },
   "reply_279466": {
      "reply id": "reply_279466",
      "content": "Anonymous 08/30/24 (Fri) 08:41:50 PM279466>>279459Most women into having casual sex don't have the backbone to demand the scrote to wear condoms so they do end up having unsafe sex and they do get STDs. Like if you know a few mentally unhinged women into hookup culture they will most definitely have had at least a scare if not outright actual STDs. It's something people don't really talk about but it happens incredibly frequently in this crowd."
   },
   "reply_279569": {
      "reply id": "reply_279569",
      "content": "Anonymous 08/30/24 (Fri) 08:59:26 PM279569>>279459>I've never had casual sex and I've only had sex with 1 person (who I'm still with after 9 years) Wow, literally same"
   },
   "reply_279639": {
      "reply id": "reply_279639",
      "content": "Anonymous 08/30/24 (Fri) 09:11:00 PM279639>>279459>I've only had sex with 1 personIs it the same for your fiancé?"
   },
   "reply_279890": {
      "reply id": "reply_279890",
      "content": "Anonymous 08/30/24 (Fri) 10:04:53 PM279890I've seen hundreds of comments from women saying they experienced random unwanted choking during casual sex. So no it's not worth it because you literally risk brain damage every time. Very disturbing society has reached this point."
   },
   "reply_280440": {
      "reply id": "reply_280440",
      "content": "Anonymous 08/31/24 (Sat) 12:26:58 AM280440The women I know who casually hookup are unironically hideous pick mes who will gladly throw a woman under the bus if it means keeping a moid around for one more week before getting dumped.Every woman who's been selective about who enters her is a true Stacy. Only ugly women value moid attention as a form of social currency, and they're stupid at that because that type of currency is weightless with high inflation."
   },
   "reply_280645": {
      "reply id": "reply_280645",
      "content": "Anonymous 08/31/24 (Sat) 01:27:46 AM280645It's not worth it.. I tried it twice and I don't regret it because I felt safe and used protection but it was underwhelming. Don't do it, just wait for the right one or explore yourself sexually. Most of these men don't even know how to please a woman."
   },
   "reply_280685": {
      "reply id": "reply_280685",
      "content": "Anonymous 08/31/24 (Sat) 01:38:50 AM280685Idk, most men are kinda ugly, because they don’t even try. Why would I want to have sex with a person who looks like he doesn’t even try - that means he wants to use me and that’s it. Those who try to look attractive could do, at least they are “giving” something. But yeah, most like even they won’t even think about woman’s pleasure, so why even bother"
   },
   "reply_280701": {
      "reply id": "reply_280701",
      "content": "Anonymous 08/31/24 (Sat) 01:48:54 AM280701Not worth it. I used to be extremely self destructive and tried to find my self worth in any man who wanted me. I had lots of indiscriminate sex with men who didn't care about me, and most times it was unprotected. I look back and can't believe that was me. I've forgiven the old me and know my worth. And know men aren't shit."
   },
   "reply_280704": {
      "reply id": "reply_280704",
      "content": "Anonymous 08/31/24 (Sat) 01:49:48 AM280704>>280645>Most of these men don't even know how to please a woman.Explain? t. virgin"
   },
   "reply_280723": {
      "reply id": "reply_280723",
      "content": "Anonymous 08/31/24 (Sat) 01:53:41 AM280723>>280701>tried to find my self worth in any man who wanted meWhat were you seriously trying to achieve with this? You should be seeking emotional connections and true love."
   },
   "reply_280989": {
      "reply id": "reply_280989",
      "content": "Anonymous 08/31/24 (Sat) 03:29:40 AM280989>>273609Worth it? No. Fun? Yes."
   },
   "reply_280993": {
      "reply id": "reply_280993",
      "content": "Anonymous 08/31/24 (Sat) 03:31:02 AM280993>>280989imagine having such an empty life that opening your holes to random moids is what you consider fun. you should kys."
   },
   "reply_281470": {
      "reply id": "reply_281470",
      "content": "Anonymous 08/31/24 (Sat) 06:28:10 AM281470>>281100Bacterial vaginosis though."
   },
   "reply_281484": {
      "reply id": "reply_281484",
      "content": "Anonymous 08/31/24 (Sat) 06:42:26 AM281484>>281100How do you find those? I’ve only ever matched with women on tinder who want a long term relationship"
   },
   "reply_281609": {
      "reply id": "reply_281609",
      "content": "Anonymous 08/31/24 (Sat) 08:56:52 AM281609Fuck no. Why give sex to a moid who won’t even pretend to commit? Then later on they’ll brag about it to their friends. No thanks."
   },
   "reply_283928": {
      "reply id": "reply_283928",
      "content": "Anonymous 09/01/24 (Sun) 02:42:42 AM283928What is the origin story of OP pic"
   },
   "reply_284082": {
      "reply id": "reply_284082",
      "content": "Anonymous 09/01/24 (Sun) 05:33:40 AM284082The question of whether or not it’s “worth it” depends on how you’re doing it. Using an app like Tinder for it is likely not a good idea as you can’t know what the users intentions are or whether or not they’re catfishing. Family Guy was right, Tinder will make you gross and you’ll probably have STDs if you fuck all the people from it"
   },
   "reply_284194": {
      "reply id": "reply_284194",
      "content": "Anonymous 09/01/24 (Sun) 08:45:16 AM284194>>280704A lot of men are very self centered and take all the knowledge relating to intimacy and sex from porn. I've had multiple people I was seriously dating at the time straight up ignore me when I'd tell them my preferences and then not even care/notice that I was mentally checked out during sex or just didn't want to fuck them anymore lolOut of three people that I've dated and had intimacy with there was one person who cared and was interested in what I liked, and the contrast is downright depressing tbh"
   },
   "reply_284203": {
      "reply id": "reply_284203",
      "content": "Anonymous 09/01/24 (Sun) 09:09:34 AM284203>>284194Any woman, even a virgin, knows this. Only a scrote or an extremely naive, sheltered girl that knows nothing about the real world would ask such a retarded question tbh."
   },
   "reply_284218": {
      "reply id": "reply_284218",
      "content": "Anonymous 09/01/24 (Sun) 09:57:27 AM284218>>280685Moid hands typed this post"
   },
   "reply_284220": {
      "reply id": "reply_284220",
      "content": "Anonymous 09/01/24 (Sun) 09:59:35 AM284220>>280993jesus calm down"
   },
   "reply_284241": {
      "reply id": "reply_284241",
      "content": "Anonymous 09/01/24 (Sun) 10:43:44 AM284241I dont think casual sex is good for women, not because \"you are a slut reee\" or that you necessarily need to have feelings for the sex partner, but the risks are too high. I used to have hookups when I was younger, was horny dumbass with a low self esteem. Some were honestly enjoyable but I also got abused by men. Moids are just so much physically stronger than us they can do any sick shit when they got you in that vulnerable position. There is also the added risk of pregnancy that moids dont have to worry about. Offering a relationship doesnt also mean that the moid is safe or respects you. A lot of them see their gfs as easy access to pussy. Get to know the moid before sex and dump his ass immediately if there is any pushing for sex, degenerate desires or unwillingness to please you. Dont be a pick me, they will only see you as weak and be encouraged to treat you like shit."
   },
   "reply_284355": {
      "reply id": "reply_284355",
      "content": "Anonymous 09/01/24 (Sun) 03:39:05 PM284355I find it weird that some people see casual sex as “opening your holes” but sex with your bf doesn’t involve that?"
   },
   "reply_284408": {
      "reply id": "reply_284408",
      "content": "Anonymous 09/01/24 (Sun) 05:11:35 PM284408Casual sex also just means fooling around with people you aren't dating.If you think spontaneity adds a lot then yeah it will be fun, if you don't care about that (for one: wise decision but also) it won't be.Dating apps as a whole are cancer. I  never used one but my friends have and they all simultaneously refuse to stop using them and perpetually whine about how terrible they are."
   },
   "reply_284410": {
      "reply id": "reply_284410",
      "content": "Anonymous 09/01/24 (Sun) 05:14:57 PM284410It's worth it as long as you vet your partners wisely. In my opinion nothing feels as good as piv sex but I also don't really want a guy living in my house so casual works for me"
   },
   "reply_284422": {
      "reply id": "reply_284422",
      "content": "Anonymous 09/01/24 (Sun) 05:40:01 PM284422>>280993ily nona"
   },
   "reply_284480": {
      "reply id": "reply_284480",
      "content": "Anonymous 09/01/24 (Sun) 06:43:13 PM284480>>273609 When the roles are reversed it is"
   },
   "reply_284481": {
      "reply id": "reply_284481",
      "content": "Anonymous 09/01/24 (Sun) 06:43:27 PM284481>>284355Only sex within marriage can be truly dignified (and sometimes not even then)"
   },
   "reply_284642": {
      "reply id": "reply_284642",
      "content": "Anonymous 09/01/24 (Sun) 09:36:24 PM284642>>273609Lol, that’s so cringe. Why did she do this?"
   },
   "reply_285236": {
      "reply id": "reply_285236",
      "content": "Anonymous 09/02/24 (Mon) 02:07:02 PM285236>>273609yeah its fun as long as you dont make it your main hobby and spend most of your time on other things. my self esteem is already fine and ive gotten around the STI risk because most of the guys ive been with were virgins or hadnt done it in a while"
   },
   "reply_285254": {
      "reply id": "reply_285254",
      "content": "Anonymous 09/02/24 (Mon) 02:28:41 PM285254>>285236Virgin guys are for virgin girls. Please don't take their virginities from us."
   },
   "reply_285261": {
      "reply id": "reply_285261",
      "content": "Anonymous 09/02/24 (Mon) 02:33:46 PM285261 1525342948269.png >>285236Hands off virgin boys STACEY they're for VIRGIN women ONLY SKRREEEEEEEEEEEEEEE"
   },
   "reply_285269": {
      "reply id": "reply_285269",
      "content": "Anonymous 09/02/24 (Mon) 02:40:25 PM285269>>285254>>285261dw i don’t think you’d want the kind of retard who’d lose his virginity in a hookup"
   },
   "reply_285287": {
      "reply id": "reply_285287",
      "content": "Anonymous 09/02/24 (Mon) 03:03:53 PM285287>>285269Maybe they wouldn't if Stacy hadn't tricked them."
   },
   "reply_285336": {
      "reply id": "reply_285336",
      "content": "Anonymous 09/02/24 (Mon) 04:04:16 PM285336Where the fuck are nonas meeting these random guys who can just dish out orgasms? I tried dating apps and it was truly awful. Literally not worth the cost of data useage on my phone."
   },
   "reply_285420": {
      "reply id": "reply_285420",
      "content": "Anonymous 09/02/24 (Mon) 05:45:57 PM285420>>285254This"
   },
   "reply_285447": {
      "reply id": "reply_285447",
      "content": "Anonymous 09/02/24 (Mon) 06:09:10 PM285447>>285336>dating appsFirst mistake"
   },
   "reply_285456": {
      "reply id": "reply_285456",
      "content": "Anonymous 09/02/24 (Mon) 06:24:19 PM285456I'm skittish around sex because of unfortunate early experiences but my best friend had just started dating people casually again after being in a totally dead 7 year relationship and I'm so proud and happy for her. She was genuinely surprised when a guy she hooked up with would wear a condom for her bc her ex refused to even though she had a horrible reaction to being on the pill. I love her so much but I need her to get higher standards because men who do the bare minimum are astounding her lol. I think casual sex works for some people but it wouldn't work for me unfortunately, I'm too nervous."
   },
   "reply_285597": {
      "reply id": "reply_285597",
      "content": "Anonymous 09/02/24 (Mon) 10:20:56 PM285597It depends. I got broken up with almost 2 years ago and did end up hooking up with other people, it was fun at first and a bit of an ego/confidence boost for a while but there was like maybe 2 guys who I actually enjoyed having sex with but the rest sucked . I did end up finding my current boyfriend like a year ago and wasn't even expecting a relationship to happen between us  but we both have a lot in common, he's also really patient with me (i did get a lot of trust issues ngl with hooking up with different people).  we met on a dating app, we had a lot in common and he's canonically online like me."
   },
   "reply_285816": {
      "reply id": "reply_285816",
      "content": "Anonymous 09/03/24 (Tue) 02:25:25 AM285816Is it bad if I'm bi but have only fucked 2 men (and 4 women)? Sometimes men on dating apps will ask me to meet up and I'll ghost them. Women are much harder to find for casual sex imo"
   },
   "reply_285893": {
      "reply id": "reply_285893",
      "content": "Anonymous 09/03/24 (Tue) 04:32:14 AM285893>>285447Where the frick else am I meant to find an assortment of men to have casual sex with, that'll let me ghost the weirdos without worrying they'll rape/murder me over it? If you're going to suggest bars, then you're insane. Dick isn't worth dying for. Besides that apps are really the only places I can freely elicit HD dickpics from potential partners to weed out ugly/small/giant ones. Even then I only found a single man who could pleasure me in any way and he was an awful person. Hookup culture exclusively benefits men. >>273617 is right and nonas like >>273696 and >>274155 are just rare orgasm-fountains that live like trust-fund kids, entirely delusional about how the rest of us work and perpetuating an aspect of culture entirely harmful to the rest of womankind."
   },
   "reply_285897": {
      "reply id": "reply_285897",
      "content": "Anonymous 09/03/24 (Tue) 04:47:21 AM285897>>273617I genuinely don't get it. For example: A close friend of mine broke up with her long time BF and some time after she was going on tinder dates and telling me about it. I tried to act supportive but I kind of resent her because I always thought she was above hookup culture, like me. Sure I get horny some times but I know I can masturbate and be done with it but she's one of those women that need that male validation like a drug after being on her own for some time. It's kind of depressing to think about"
   },
   "reply_285903": {
      "reply id": "reply_285903",
      "content": "Anonymous 09/03/24 (Tue) 04:55:56 AM285903>>278220I think people enjoy it the same way they \"enjoy\" getting high and eating fast food and zoning out on a weekend. It's another fleeting thing that ends up numbing you the more you do it.Some people in this very thread are so numb they think it's the only way to live"
   },
   "reply_285922": {
      "reply id": "reply_285922",
      "content": "Anonymous 09/03/24 (Tue) 05:37:22 AM285922>>285903This. I've enganged in hook-up culture between relationships, but fully admit it's high risk behaviour and part of my addictive tendencies. I enjoy piv and orgasm from it so I tend to get something out of it, but it can still feel awkward and anti climatic lol. Luckily I've never had any truly bad experiences, but have gotten myself into some feelsbad.jpg situations. I'm in my 30s now and less inclined to take any bs and somehow guys I meet also seem more normal these days, probably due to my age sadly. I met all my bfs through hook-ups where we hit it off, and because sex is a priority for me it's nice to have that part figured out from the get go, but usually there is little chemistry and I just end up getting off mechanically from it. Tldr I wouldn't recommend hook-ups or dating apps to anyone but would probably do it again if I become single (something something chasing the dragon)."
   },
   "reply_285935": {
      "reply id": "reply_285935",
      "content": "Anonymous 09/03/24 (Tue) 06:04:51 AM285935I've done hookups in the lowest point of my life and the only things I got to show for it were 1. chlamydia 2. bruises 3. zero orgasms."
   },
   "reply_286277": {
      "reply id": "reply_286277",
      "content": "Anonymous 09/03/24 (Tue) 04:14:29 PM286277 1725341212362533.j… >>285810Maybe it's just me, but normie logic be like >you let a stranger you just met into your house, are you insane!?>oh he was trying to have sex with you? That alright then"
   },
   "reply_286341": {
      "reply id": "reply_286341",
      "content": "Anonymous 09/03/24 (Tue) 05:47:31 PM286341How about casual sex with other women? I usually only feel comfortable hooking up once there is an established emotional connection but since im not into dating right now, im considering it. Any lesbian nonas care to share their take with a newbie like me"
   },
   "reply_286393": {
      "reply id": "reply_286393",
      "content": "Anonymous 09/03/24 (Tue) 06:25:23 PM286393>>286337what's true anon? can you explain? and why does it matter?"
   },
   "reply_286399": {
      "reply id": "reply_286399",
      "content": "Anonymous 09/03/24 (Tue) 06:28:36 PM286399If you have casual sex with moids you have no right to talk about hating moids. Even if you vet them. Even if you've known them for a while. You are pandering to the lowest denominator of moid by fucking them and most likely getting no orgasm out of it. You cannot possibly hate men and fuck them willy nilly out of free will. You, objectively, love males."
   },
   "reply_286422": {
      "reply id": "reply_286422",
      "content": "Anonymous 09/03/24 (Tue) 06:48:57 PM286422>>281609>>286399Truest words ever spoken"
   },
   "reply_286428": {
      "reply id": "reply_286428",
      "content": "Anonymous 09/03/24 (Tue) 06:51:50 PM286428fucking these r-tards? I go on dates for the free food"
   },
   "reply_286693": {
      "reply id": "reply_286693",
      "content": "Anonymous 09/03/24 (Tue) 11:40:16 PM286693 fp.png >>286399Women who have casual sex are desperate women who have no control over their passions. They don't realize that by drowning in moids' dicks they are only devaluing themselves and giving them more reason to talk badly about us. I'm a virgin, I only kissed a few retards in my teens, but nothing more than innocent kisses. I solve my sexual problems with erotic books and fics of real quality. I've internalized in myself that the only men who are any good and worth my orgasm are the fictional ones written by women, lol."
   },
   "reply_286703": {
      "reply id": "reply_286703",
      "content": "Anonymous 09/03/24 (Tue) 11:53:55 PM286703>>286693So you want to drink a cup of pee with a tiny scrote in it oooh you're so superior"
   },
   "reply_286712": {
      "reply id": "reply_286712",
      "content": "Anonymous 09/04/24 (Wed) 12:03:17 AM286712>>286703I've never said I was superior, but if the shoe fits…not my problem"
   },
   "reply_286717": {
      "reply id": "reply_286717",
      "content": "Anonymous 09/04/24 (Wed) 12:10:36 AM286717 il_570xN.153091121… >>286693>no control over their passionsSo women must always control themselves because having passions is not proper of a lady?What's next? Masturbation is a sin?I think hooking up is dangerous and I haven't engaged in that, but it's dumb to say that any woman who hooks up with moids is a whore because she's not \"le pure kissless handholdless eyecontactless virgin\" It's just what moids say when they get mad when a woman decides she also wants to have sex because she feels like it and not because it's her duty to serve a moid and to reproduce.Maybe instead of trying to be smug about being virgin, which is a retarded concept and scam made to control women btw, try learning and understanding why hookups are harmful and why they're a waste of time."
   },
   "reply_286729": {
      "reply id": "reply_286729",
      "content": "Anonymous 09/04/24 (Wed) 12:21:53 AM286729>>286717Sex is bad and only benefits males."
   },
   "reply_286749": {
      "reply id": "reply_286749",
      "content": "Anonymous 09/04/24 (Wed) 12:39:57 AM286749>>286729Exactly, but just because a woman has had sex before doesn't mean she's a lesser being, it means she was a victim of society and that we should help her understand that she doesn't need to have sex to get an orgasm or to be happy; instead of telling her that she's a dumbass and a whore unlike the oh so superior virgins."
   },
   "reply_286770": {
      "reply id": "reply_286770",
      "content": "Anonymous 09/04/24 (Wed) 01:04:48 AM286770 IMG_5241.jpeg >>286717It’s so retarded to see women fight over whether or not being a virgin or a slut is better because it’s an inherently scrotal paradigm that literally only holds value for scrotes and the Scrotecentric women who blindly accept it.  My take on hookup culture is that most women and quite frankly a large proportion of men can’t handle it at all but that it’s fine for the ones who actually can handle it to pursue it. Also, a lot of people who hook up casually think they can handle it but can’t. Therefore, it’s very likely that it’s a net negative societally to promote it but I only think it presents as a true moral failing or at the very least a big mistake in those who do it without a sufficient sense of self and aren’t self-reflective enough to realize they shouldn’t be doing it. Unfortunately, a lot of people who engage in hookup culture are doing it thoughtlessly as I described and are shocked when they feel “empty”. I’ve seen both men and women complain about this. It’s a temporary connection, and if after one or two times you are still genuinely looking for some sort of long-term fulfillment from it , then it’s not for you.  It’s that easy. The same logic follows for virginity, tbh, as chastely dreaming of the perfect Prince Charming who will implicitly love you for your purity will also not give you the ability to magically get up and leave when Prince Charming becomes a royal nightmare. In a less extreme sense, it’s not really “admirable” to not have sex. In fact, from the way some of  you guys talk about sex, it’s like you want to be congratulated for not randomly shooting up heroin.As for perma-hookuppers, you are probably a clusterbee. Please try not to leave damaged people in your wake. I’m sorry if I sound mean, but I’ve tried to be equally as cruel to both sides. I just hate that this conversation exists eternally and will probably always exist until we all become biorobots or whatever. There have been many fascinating women throughout the ages that I deeply admire who have been lifelong virgins and many more who have been quote unquote slutty. There have been many “virgins”, “sluts” and whatever exists in between that I know personally who have been raped, hurt, or otherwise deeply mistreated by men. Let’s not pretend that either the Madonna or the whore will bring us to salvation and stop hurting each other needlessly - there’s already moids doing that"
   },
   "reply_286774": {
      "reply id": "reply_286774",
      "content": "Anonymous 09/04/24 (Wed) 01:09:12 AM286774>>286729Tell me you've never had good sex without telling me"
   },
   "reply_286782": {
      "reply id": "reply_286782",
      "content": "Anonymous 09/04/24 (Wed) 01:15:33 AM286782>>286770>uses the word paradigm unironicallyThe postmodernists convention is that way."
   },
   "reply_286783": {
      "reply id": "reply_286783",
      "content": "Anonymous 09/04/24 (Wed) 01:15:40 AM286783>>286717Yeah that's pretty fair, the war between virgins and sluts is stupid shit pushed by stupid scrotes. Hook-up culture makes it easier for women to be exposed to shitty men, diseases and pregnancy by those shitty diseased men. Wrapping your self worth up in your virginity exposes yourself to be used and abused by shitty men who will get diseases from sexually irresponsible behavior, and then get you pregnant and trap you to him because \"no other man will want you.\" Just make wise choices. Hookups usually are not a wise choice."
   },
   "reply_286786": {
      "reply id": "reply_286786",
      "content": "Anonymous 09/04/24 (Wed) 01:21:49 AM286786>>286717>virginity is a retarded made up conceptSo sick of hearing this dubious logic."
   },
   "reply_286792": {
      "reply id": "reply_286792",
      "content": "Anonymous 09/04/24 (Wed) 01:30:58 AM286792>>286749>she was a victim of societyEvery human has free will, and freely decides each decision, and freely chooses each choice. If a woman, or a man, chooses to have sex, it is her choice, and hers is also the blame. I don't mean society isn't at fault, to tell people that virginity is bad, but people are not free from culpability when they err."
   },
   "reply_286797": {
      "reply id": "reply_286797",
      "content": "Anonymous 09/04/24 (Wed) 01:40:47 AM286797for men? yes, absolutely. there will always be a \"pretty\" woman, e.g. a woman who rigidly conforms to femininity. all a man needs to enjoy sex and cum is thrust. for women? fuck no. why would you ever subject yourself to fucking scrotes who 1000% don't see you as an entire person and are 1000% going to go and brag to their scrote cronies about how they gave you backshots? do you really want to be a hole to some useless scrote scrolling through tinder? have some self respect"
   },
   "reply_286798": {
      "reply id": "reply_286798",
      "content": "Anonymous 09/04/24 (Wed) 01:41:37 AM286798it's telling that this thread is the most engaged with besides the bunker thread. why do you guys care about this shit"
   },
   "reply_286801": {
      "reply id": "reply_286801",
      "content": "Anonymous 09/04/24 (Wed) 01:45:42 AM286801>>286717>>286749>>286770>>286783Virginity is good because I want a virgin bf/husband.You cannot disprove this argument."
   },
   "reply_286805": {
      "reply id": "reply_286805",
      "content": "Anonymous 09/04/24 (Wed) 01:51:07 AM286805>>286786This. What's so special about your special other if you never actually did anything special? Bitch you were sixth in line behind Stacy, Becky, two girls he met on Tinder and a gas station attendant called Charlene"
   },
   "reply_286813": {
      "reply id": "reply_286813",
      "content": "Anonymous 09/04/24 (Wed) 02:04:15 AM286813>>286798why do you care that anyone cares? go back"
   },
   "reply_286815": {
      "reply id": "reply_286815",
      "content": "Anonymous 09/04/24 (Wed) 02:05:03 AM286815>>286797Agree totally. I don't think most women realize that three seconds after he nuts every guy in his contacts will know everything about what happened. And there was a (now deleted) post about someone who only enjoyed sex with an asshole. Great job, you've just reaffirmed all his misogynistic beliefs and all his friends misogynistic beliefs. And he has zero respect for you as a person. And after you he'll be forcing his beliefs on all the other women he sleeps with, and pray not too many women like assholes like you do."
   },
   "reply_286865": {
      "reply id": "reply_286865",
      "content": "Anonymous 09/04/24 (Wed) 03:28:36 AM286865>>286813because it's gay"
   },
   "reply_286868": {
      "reply id": "reply_286868",
      "content": "Anonymous 09/04/24 (Wed) 03:36:57 AM286868 4eiujvtgjn251.jpg I don't think so. I'm basically like a pigeon in that I only want to pair-bond. If I end up being with someone long-term ideally I would want them to be both my first and my last. I think casual sex is very unattractive and dangerous tbh. Can never understand FWBs and how people can just take romantic attraction out of sex that way, either. The mind-body connection is very strong. Having sex without any just sounds like shitty sex and self-exploitative. Like eating a gas station burrito versus eating at a Michelin. It can never come close to being with someone you love."
   },
   "reply_286878": {
      "reply id": "reply_286878",
      "content": "Anonymous 09/04/24 (Wed) 03:51:50 AM286878>>286786NTA but saying that virginity as most people understand it is a dumb concept isn't the same as supporting promiscuous behavior, which most of us (I hope) agree is a bad thing. I think society makes virginity sound more special than it actually is. And I say this as someone that is only attracted to virgin moids irl kek in fact, I think virginity in scrotes should be valued more and we shouldn't be fighting over virginity in women because we all know scrotes only care about competing with other scrotes and that's why they want women to stay virgins."
   },
   "reply_286922": {
      "reply id": "reply_286922",
      "content": "Anonymous 09/04/24 (Wed) 04:59:05 AM286922>>286868 are you me? even down to the bird love…"
   },
   "reply_286926": {
      "reply id": "reply_286926",
      "content": "Anonymous 09/04/24 (Wed) 05:07:03 AM286926>>286878Nona wasn't saying \"virginity as most people understand it is a dumb concept\", she said virginity itself is a dumb concept, which is a common zoomer logic I've heard many times, \"virginity is a myth, a social construct, it doesn't exist\", the same sort of logic that also allows for tranny bullshit, like \"a woman is anyone who identifies as a woman\".>virginity in scrotes should be valued more>society makes virginity sound more special than it actually isWell which one is it lmaoI think the general 21st century American society does not value either male or female virginity. I know of no recent popular American tv show or movie that claims it's good to be a virgin.>we shouldn't be fighting over virginity in womenI don't particularly care about female virginity itself, but consider that, if promiscuity is common in women, it will also be common in men. If you want more virgin men, then there also needs to be virgin women."
   },
   "reply_286963": {
      "reply id": "reply_286963",
      "content": "Anonymous 09/04/24 (Wed) 06:40:48 AM286963>>286926Sorry, I think what most women actually mean when they say \"the concept of virginity is stupid\" is that women shouldn't be shamed for not being virgins, or for having a sex life at all. That's probably what anon meant because she specifically shat on moids' idea of virginity in women.>Well which one is it lmaoThose two ideas aren't mutually exclusive. \"More special than it actually is\" isn't saying that there's absolutely nothing good about virginity. In this case, I meant it like that anon, that virginity in women is seen as much, much more than just being sexually healthy. On the other hand, society applauds scrotes for fucking as many women as possible, and thus me saying that virginity in men should be considered more important than it currently is.>I know of no recent popular American tv show or movie that claims it's good to be a virgin.Yeah, media promotes promiscuity but then real people shit on women who follow that example.>if promiscuity is common in womenAt no point did I encourage promiscuity. Not virgin != promiscuous."
   },
   "reply_286971": {
      "reply id": "reply_286971",
      "content": "Anonymous 09/04/24 (Wed) 07:00:03 AM286971I'm embarrassed to admit that I was promiscuous throughout my teens and 20s. I was hypersexual and I don't even know why, I wondered if I have BPD or something but my libido was insane. Literally couldn't comprehend how other women didn't feel horny or think about sex a lot and it makes me cringe to think about how I overshared and probably made a lot of friends feel uncomfortable. Now that I'm in my 30s I feel like a completely different person and I'm rarely \"in the mood\" for actual sex IRL and I just look at pics of my husbando instead. It's weird."
   },
   "reply_286978": {
      "reply id": "reply_286978",
      "content": "Anonymous 09/04/24 (Wed) 07:14:51 AM286978>>286926>If you want more virgin men, then there also needs to be virgin women.Not really, moids lose their virginities way before having sex with women. The moment a moid masturbates putting their dicks inside an object/animal, they lose their virginity, just like how a woman technically loses her virginity after masturbating using penetration.Which really brings a question to my mind, is there even such a thing as a 100% virgin moid? Women can actually be 100% virgins, as in never had anything penetrating the vagina, yet moids put their dicks inside anything they can, from socks, to furniture, food, animals and whatever else.Moids should just actually control their impulses, or like super virgin anon said \"passions\" so they don't fuck up their virginity and become pornsick, which is what usually happens to the average moid that masturbates from an early age.So, women don't really need to technically, interpreting your words>stop fucking men so there's more virgin menMoid just need to not put their dicks inside anything, then we can have actual virgin moids that are innocent for real and not just waiting for the right moment to jackhammer a woman."
   },
   "reply_286983": {
      "reply id": "reply_286983",
      "content": "Anonymous 09/04/24 (Wed) 07:28:50 AM286983>>286926Sorry for the doublepost.>common zoomer logic I've heard many times, \"virginity is a myth, a social construct, it doesn't exist\", the same sort of logic that also allows for tranny bullshit, like \"a woman is anyone who identifies as a woman\".Trannies and their supporters appropriated a kind of criticism that can be made about many things that are actually social constructs. For example, \"gender\" is a social construct, but in the sense that gender roles and stereotypes, such as women wearing skirts, or pink being exclusively for females, are made up rules and not tied to biology. Troons take this statement and twist it to their liking, thus they claim that \"gender is a social construct\", meaning that having been born with a penis doesn't mean they can't be women (they consider \"woman\" to be the set of gender stereotypes that society created to impose onto female people, instead of considering \"woman\" to mean an adult who is female without the gender role bullshit).Similarly, troons use the words of feminist writers, such as Simone de Beauvoir's:>one is not born, but rather becomes a womanwhich to some might mean that she's simply referring to society's concept of \"women\" as a non-literal descriptor for a social role, different from \"women\" as in a literal adult female. But trannies intentionally interpret it as support for the idea that males can become literal women through \"performing gender\" stereotypes and roles.So with that in mind, maybe there are some social constructs surrounding the idea of virginity, considering that humans tend to make a lot of stuff up and give meaning to things that inherently have no meaning or value.tl;dr: just because trannies love to steal and distort the meaning of valid criticism doesn't mean you have to dismiss the original criticism. Also virginity might have some positives but it's important to define what even counts as losing your virginity and what are the actual positives and what's bullshit mixed in."
   },
   "reply_286987": {
      "reply id": "reply_286987",
      "content": "Anonymous 09/04/24 (Wed) 07:45:51 AM286987>>286978>a women technically loses her virginity after masturbating using penetration No one actually really believes this. Virginity ≠ hymen, except metonymically. There's no less than 100% virgin either. You're either a virgin or you're not.>stop fucking men so there's more virgin menThat's not exactly the point. If women don't value their own virginities, then men won't value theirs either. You want innocent moids, but moids need to be surrounded by virtue, in other men, but also in women, in order to have innocence. Virginity can't be truly promoted in  sex while not the other."
   },
   "reply_286995": {
      "reply id": "reply_286995",
      "content": "Anonymous 09/04/24 (Wed) 07:56:46 AM286995>>286987The point is that it's dumb in the end because we all know that it's just not going to happen.Why should we value our virginities, at all? Truly, like at all.Us being virgins doesn't make moids want to stay virgin, us not being virgins doesn't make them appreciate us, may as well do whatever the fuck we want tbh.I still think hooking up is dangerous and a health hazard in many ways, but from a moral standpoint it's retarded to get mad at women hooking up, it should be the lesser of problems unlike the possibility of rape, murder, kidnapping, disabilities and so on."
   },
   "reply_286996": {
      "reply id": "reply_286996",
      "content": "Anonymous 09/04/24 (Wed) 07:57:58 AM286996>>286963>what most women actually meanGoogle \"virginity is a concept\", and top results are about how it's \"made up\" and \"socially constructed\", and you'll see phrases like \"there is no such thing as a virgin\". >not virgin != promiscuousI never said it was. I only said promiscuity is the opposite of virginity.>>286983I never \"dismissed the original criticism\". I was only referring to the tranny logic, which prevails in the minds of zoomers."
   },
   "reply_287005": {
      "reply id": "reply_287005",
      "content": "Anonymous 09/04/24 (Wed) 08:10:32 AM287005>>286995Certainly us not being virgins will make moids not want to be virgins"
   },
   "reply_287016": {
      "reply id": "reply_287016",
      "content": "Anonymous 09/04/24 (Wed) 08:35:26 AM287016No sex with men is ever worth it ever"
   },
   "reply_287017": {
      "reply id": "reply_287017",
      "content": "Anonymous 09/04/24 (Wed) 08:37:26 AM287017>>286987If I'm a lesbian who has never had sex with a man does that make me a virgin even if I'm married to a woman and had a child?"
   },
   "reply_287020": {
      "reply id": "reply_287020",
      "content": "Anonymous 09/04/24 (Wed) 08:39:54 AM287020>>287017If you had sex with a woman, you are not a virgin."
   },
   "reply_287022": {
      "reply id": "reply_287022",
      "content": "Anonymous 09/04/24 (Wed) 08:47:26 AM287022 pigeons-1.jpg I don't think the origins of virginity as a concept were that deep. Being a virgin or having a low number of sex partners is desirable in both men and women because it implies self control. It's no different to someone who saves money compared to someone who spends impulsively and gets into debt. Casual sex is a risky behaviour that only leads to short term sexual gratification and has no long term benefits. Temperance and moderation are values that anyone would want in a romantic partner because people with low impulsivity are generally more successful in life.Do you want a nigel that can have one beer with his friends or do you want a binge drinking moid that has no control around alcohol?Do you want a nigel that lives modestly and saves his paycheck or do you want a moid that spends it all on payday?Do you want a nigel that ignores porn ads or do want a moid that instantly needs to coom because he saw a low resolution pair of tits?There's many examples of why a lack of self control is bad."
   },
   "reply_287177": {
      "reply id": "reply_287177",
      "content": "Anonymous 09/04/24 (Wed) 02:49:23 PM287177>>286801I can. Being a virgin as a woman doesn't make you entitled to virgin males. Being a virgin is good because you want to be a virgin for reasons outside of male acceptance or approval. Being a virgin is good if you're comfortable and happy with your virginity, that is all"
   },
   "reply_287184": {
      "reply id": "reply_287184",
      "content": "Anonymous 09/04/24 (Wed) 02:55:47 PM287184>>286987>If women don't value their virginity men won't value theirs either Wow, some of you need to read a book. Men have been discarding their virginity with a vengeance since women weren't allowed to leave the house without a male chaperone.  Men would take their sons to go fuck prostitutes and lose their virginity, and then marry those guys off to 17 year olds. Men won't value male virginity because Virgin has been used as an insult to them for a long while.  Stop forcing women to hold the bag for degenerate male sexuality. They only value female virginity because of their Madonna/whore complexes, they don't admire female sexual discipline at all. In fact, it enrages them."
   },
   "reply_287199": {
      "reply id": "reply_287199",
      "content": "Anonymous 09/04/24 (Wed) 03:06:05 PM287199>>287177But you didn't address the actual point in the argument. You only spoke alternative reasons why virginity can be good, but never why my reason is insufficient.>Being a virgin as a woman doesn't make you entitled to virgin malesYou can't demand a virgin if you aren't one yourself."
   },
   "reply_287221": {
      "reply id": "reply_287221",
      "content": "Anonymous 09/04/24 (Wed) 03:48:27 PM287221 69419190-53A5-4CE7… women are just embarrassing sometimes"
   },
   "reply_287240": {
      "reply id": "reply_287240",
      "content": "Anonymous 09/04/24 (Wed) 04:20:57 PM287240>>287221Man I wish the polyamorous thread on LC"
   },
   "reply_287250": {
      "reply id": "reply_287250",
      "content": "Anonymous 09/04/24 (Wed) 04:32:47 PM287250>>287199>You can't demand a virgin if you aren't one yourself Unfortunately, not a lot of XYs agree, which fucks over virginal or inexperienced women over quite a bit. Personally i think abstaining from sex until you're with someone you truly love and loves you back is a beautiful thing, but nowadays its rapidly becoming a pipe dream and I don't think anyone should abstain for that reason alone. You should abstain for your own health and comfort, not because you think it will get you a higher quality mate. Nowadays 12 year old boys develop ED and porn addictions."
   },
   "reply_287257": {
      "reply id": "reply_287257",
      "content": "Anonymous 09/04/24 (Wed) 04:38:24 PM287257>>274204Sex is better with deep feelings that can only be developed over a long period of time and when you've had time to align to each other sexually and learn the others' idiosyncrasies and preferences in bed.Anyone trying to defend promiscuity from the angle of \"sex good\" is some sort of retard in arrested development. Get a long term partner, if not at least a stable fwb that you've known for years. You will have 1000 times better sex that way."
   },
   "reply_287259": {
      "reply id": "reply_287259",
      "content": "Anonymous 09/04/24 (Wed) 04:39:18 PM287259>>287221>He enjoyed itWell, imagine my fucking shock. Also i hate when people use the term \"ran a train\" that's a specific thing and it usually refers to multiple rapists, one victim."
   },
   "reply_287265": {
      "reply id": "reply_287265",
      "content": "Anonymous 09/04/24 (Wed) 04:45:22 PM287265>>287177The version of understanding virginity is only good if it applies to both sexes. If it's bad for men and good for women, it's the old patriarchal systems of forcing one sided relationships."
   },
   "reply_287278": {
      "reply id": "reply_287278",
      "content": "Anonymous 09/04/24 (Wed) 04:58:19 PM287278>>287250I mean, you can't justly demand a virgin if you aren't one yourself >You should abstain for your own health and comfort, not because you think it will get you a higher quality mate.Why not both?"
   },
   "reply_287286": {
      "reply id": "reply_287286",
      "content": "Anonymous 09/04/24 (Wed) 05:08:31 PM287286 figure1sexmaritalh… >>287184Actually, it seems a good portion of men have had only one lifetime sexual partner. Although the graph only counts married men, and not all men. But it's not as bad as you say."
   },
   "reply_287293": {
      "reply id": "reply_287293",
      "content": "Anonymous 09/04/24 (Wed) 05:24:51 PM287293>>287286Those stats are so obviously fake lol"
   },
   "reply_287296": {
      "reply id": "reply_287296",
      "content": "Anonymous 09/04/24 (Wed) 05:27:05 PM287296>>287278Because you're not guaranteed a mate even if you do everything right your entire life. Wouldn't want it to lead to resentment >>287286Where'd you find this from? 4chins or leddit?"
   },
   "reply_287301": {
      "reply id": "reply_287301",
      "content": "Anonymous 09/04/24 (Wed) 05:36:00 PM287301Kek I just wanted to chime in that my boyfriend was a virgin when I met him, he’s probably the ideal for a lot of miners — handsome, intelligent, devoted, and no ex drama. I didn’t even set out looking for a virgin, it just happened.He chose a nasty filthy slut like me tho. Life’s not fair uwu"
   },
   "reply_287302": {
      "reply id": "reply_287302",
      "content": "Anonymous 09/04/24 (Wed) 05:38:05 PM287302>>287301>nasty filth slut like me>uwucommit self deletus"
   },
   "reply_287306": {
      "reply id": "reply_287306",
      "content": "Anonymous 09/04/24 (Wed) 05:42:04 PM287306 IMG_5033.gif >>287302"
   },
   "reply_287307": {
      "reply id": "reply_287307",
      "content": "Anonymous 09/04/24 (Wed) 05:44:12 PM287307>>287306She got that Crack whore phenotype"
   },
   "reply_287308": {
      "reply id": "reply_287308",
      "content": "Anonymous 09/04/24 (Wed) 05:49:52 PM287308>>287301Give him back to the virgins you big meanie"
   },
   "reply_287309": {
      "reply id": "reply_287309",
      "content": "Anonymous 09/04/24 (Wed) 05:50:42 PM287309>>287308But now he’s not a virgin anymore"
   },
   "reply_287334": {
      "reply id": "reply_287334",
      "content": "Anonymous 09/04/24 (Wed) 06:18:26 PM287334 occwpqbo3oq91.jpg >>287309So now he's like pic related then."
   },
   "reply_287337": {
      "reply id": "reply_287337",
      "content": "Anonymous 09/04/24 (Wed) 06:20:10 PM287337no ma’am"
   },
   "reply_287341": {
      "reply id": "reply_287341",
      "content": "Anonymous 09/04/24 (Wed) 06:22:31 PM287341>>287293>>287296https://ifstudies.org/blog/does-sexual-history-affect-marital-happinessBottom left corner says>Source: General Social Survey 1989-2016Which appears reputable. https://en.wikipedia.org/wiki/General_Social_Survey"
   },
   "reply_287547": {
      "reply id": "reply_287547",
      "content": "Anonymous 09/04/24 (Wed) 11:29:47 PM287547>>286399I knew a girl like this. She made the fact she looks at hentai her personality, loved Super Sonico, posted nudes, always tweeting about sex she was having with random men, and was in an open relationship with some they/them intersex person. I stopped talking to her but checked her Twitter years later and one of the first tweets I saw was her mentioning \"I hate men\". I think these people do this because they are not actually confident in their sexuality but trying to hide it by being hypersexual and a pickme instead."
   },
   "reply_287583": {
      "reply id": "reply_287583",
      "content": "Anonymous 09/05/24 (Thu) 12:11:39 AM287583I tried having a fwb and ended up with genital herpes from a disgusting rapist (of another woman after me) manwhore. Safe to stay I'm not doing that again. He didn't tell me he had it, but I blame myself. Now I'm left with immense shame over having a permanent std and if I'll ever get to settle down, I know I'm not having children anyway so that's not a risk at least."
   },
   "reply_287600": {
      "reply id": "reply_287600",
      "content": "Anonymous 09/05/24 (Thu) 12:26:57 AM287600>>287583Reminder that you can get genital herpes from oral herpes and it's contagious even when there's no outbreak. Anyone who's ever had a cold sore can give you genital herpes via hands or oralsame happened to me but I only had 1 outbreak and it never came back in years"
   },
   "reply_287615": {
      "reply id": "reply_287615",
      "content": "Anonymous 09/05/24 (Thu) 12:44:21 AM287615>>287600Yeah that’s what happened to me. He had oral herpes and transferred it to my genitals via oral sex. He had had outbreaks before but apparently thought it was gingivitis (I did not buy that).  It’s easy to manage and I hardly ever get outbreaks but it’s definitely a blow to my self esteem"
   },
   "reply_289341": {
      "reply id": "reply_289341",
      "content": "Anonymous 09/06/24 (Fri) 10:47:19 AM289341>>286868I used to think the exact same thing when I was younger, but sadly it's very easy to get disillusioned with modern day men.Sticking by some gross moid's side just because he's your first, he was a good liar in the beginning and you believe in pigeon pair-bonding is just not right and can only be detrimental, more so than just being single and engaging in hookup culture.Nevertheless, I agree than most times casual sex sucks and it's generally only worth it if you're really attracted to the moid. You get courted and a free meal or more, decent passionate sex too if you're lucky.I've experienced being in a relationship, it was good at first but moids drop the romantic passionate courting very fast once they believe they've bagged you."
   },
   "reply_289388": {
      "reply id": "reply_289388",
      "content": "Anonymous 09/06/24 (Fri) 12:35:19 PM289388>>289341Some anon on Lolcow said that she was in a sugar relationship but started getting emotionally attached, and while getting spat in the mouth during sex was humiliating she said the 23K $ for one thing + the other 23K $ she got for entering a threesome with the guy and another girl were enough to pay off all debts she had with college and other stuffShe said it was mentally draining so she has probably stopped doing these skitsIt's too bad that money and love are so tied together these days"
   },
   "reply_289389": {
      "reply id": "reply_289389",
      "content": "Anonymous 09/06/24 (Fri) 12:39:15 PM289389>>289341>You get courted and a free meal or more, decent passionate sex too if you're lucky.Those free meals and passionate sex only last for as long as he doesn't find you too ugly, too boring, or too old. Which won't be for very long. Let's be real, casual sex isn't sustainable for any woman. That's why most who have it eventually move on to try and settle down anyway. I know it might be hard, but if you did a find a moid that would stay with you without becoming abusive, avoidant, and uninterested he would clearly be worth more than one that does not even try to hide his body count and that tries to be perpetually 16."
   },
   "reply_289491": {
      "reply id": "reply_289491",
      "content": "Anonymous 09/06/24 (Fri) 02:49:27 PM289491>>287265>the equality memeRelationships with men will always be a power struggle because they dont even see you as human let alone want to be equals. Even the sluttiest whore is not as bad as a moid. A man's version of love is how much a woman can give and do for him while reciprocating as little as possible. The moment women decide they want to stop being sacrificial martyrs and take what benefits them maybe then they will stop suffering."
   },
   "reply_289497": {
      "reply id": "reply_289497",
      "content": "Anonymous 09/06/24 (Fri) 02:55:45 PM289497 8aubpc.png Damn, have any of you ever been in a healthy relationship ever? Have all of you seriously never met even one moid who was just a normal person? You know one who like never uses the internet unless it's to message his aunt Happy Birthday on Facebook? Seriously never??"
   },
   "reply_289511": {
      "reply id": "reply_289511",
      "content": "Anonymous 09/06/24 (Fri) 03:05:53 PM289511>>289388>It's too bad that money and love are so tied together these daysIt is but honestly the chances of finding a man who won't want to do some kind of cringe humiliating domination in bed is low. I'm willing to bed 99.999% of normie men are porn addicts and will at some point expect some sexual deviant stuff. Even the most innocent shy virgin moid will change and show his true colors once he gets comfortable with you.So it's really all about whether you want you want to be a bangmaid who splits bills and gets spit in the mouth by the 'man you love' or a single woman who gets spit in the mouth by some hot random dude or at least gets paid for it.>>289389>I know it might be hard, but if you did a find a moid that would stay with you without becoming abusive, avoidant, and uninterested Might as well look for a unicorn. Any and I really mean ANY man will get bored of you with time, will eventually find you unattractive (especially if you give him children) and will cheat or think of cheating constantly.It's really not worth it to settle down and be a maid to some scrote while also working. Get a job and be financially stable on your own, fuck and exploit scrotes until you can (I know women in their 50's who still do) and just be happy and free.I don't understand how women still romanticize the domestic servant lifestyle in this day and age."
   },
   "reply_289521": {
      "reply id": "reply_289521",
      "content": "Anonymous 09/06/24 (Fri) 03:16:13 PM289521>>289497There arent many benefits for dating a moid tbh. Like sometimes i see a moid with a normal skull and proportionate features and  and i think \"oh not bad\" but then i compare him to any becky whos considered average for a woman sitting next to me and she already has all those features with good skin and a nice body. Same thing for kindness, empathy, emotional intelligence, etc. Women will fawn over a guy not being disgusted at periods or not being outrightly misogynistic. The average woman does so much that i feel like im cucking myself for considering moids. Just the risk of getting pregnant is already a big disvantage for women, and on top of that moids arent even as beautiful and as good of a person as women."
   },
   "reply_289522": {
      "reply id": "reply_289522",
      "content": "Anonymous 09/06/24 (Fri) 03:19:18 PM289522>>289389>Those free meals and passionate sex only last for as long as he doesn't find you too ugly, too boring, or too old. Which won't be for very longAre you implying this doesn't happen in committed relationships?Every het marriage I see with my friends is fucking awful. They literally doormat and eat shit from their \"nice\" scrotes behind closed doors to make it work. The chances of finding a decent man whether casual or committed are against you–the difference with casual being that you didn't marry/share financially with the fuckers."
   },
   "reply_289525": {
      "reply id": "reply_289525",
      "content": "Anonymous 09/06/24 (Fri) 03:22:49 PM289525>>289521Anon some women are just not attracted to other women and can't be even if they try. It just seems like blackpill femcel delusion. I've been married ten years and I've never even had a pregnancy scare. Like sure, I've found \"a unicorn\" if that's what anons want to call it, but if I can meet a handsome, intelligent, compassionate man who is completely obsessed and devoted to me totally by chance just out and about why wouldn't any other straight woman be able to find that? We were even both virgins when we met. I'm just saying it's not impossible and I have a hard time believing that any anon that sincerely has a life offline has just not met any normal males in their lives. I think it's the chronically online anons who never go outside beyond going out for errands that push the blackpill the hardest, anons who have likely never even been in an irl relationship. I'll talk to blackpill anons one on one and find out their relationship experience is with a moid they met on 4chan and I'm supposed to be surprised they had a shitty experience."
   },
   "reply_289532": {
      "reply id": "reply_289532",
      "content": "Anonymous 09/06/24 (Fri) 03:26:01 PM289532>>289497>You know one who like never uses the internet unless it's to message his aunt Happy Birthday on Facebook? Seriously never??Anon, every man has a mini-computer in his pocket at any given time. It's called a smartphone and they are all using the internet on them. Just because he has an inactive Facebook profile does not mean he isn't using/hiding other avenues. This is how naive women sink decades of their lives into moids only to discover later that they are lying cheaters. They prey on fooling you into thinking they are incapable of doing harm."
   },
   "reply_289533": {
      "reply id": "reply_289533",
      "content": "Anonymous 09/06/24 (Fri) 03:26:24 PM289533>>289525Im also not attracted to women, but personally i just see how much is demanded from women and their efforts are barely reciprocated. And yes, you did find a unicorn."
   },
   "reply_289535": {
      "reply id": "reply_289535",
      "content": "Anonymous 09/06/24 (Fri) 03:28:31 PM289535>>286693bloody hell do you listen to yourself? You're getting used by moids over a free meal? All over mediocre sex that only he enjoys? Please PLEASE I beg you to think about what this means. You got brainwashed into thinking letting men use you is somehow empowering you.Please just try to learn to be happy on your own and in spaces where no men are involved"
   },
   "reply_289541": {
      "reply id": "reply_289541",
      "content": "Anonymous 09/06/24 (Fri) 03:33:57 PM289541>proven that men shit talk and dispose even the most attractive women who follow their moral codes>\"Sounds like we should just have fun and be taken out and fuck them only when we want to.\">Some anon: \"Noooooooooo don't do that don't you care about your value to them that's not power ahhhhhhhhhh.\"Hm."
   },
   "reply_289548": {
      "reply id": "reply_289548",
      "content": "Anonymous 09/06/24 (Fri) 03:39:19 PM289548>>289525obsessive and devoted men are the best"
   },
   "reply_289561": {
      "reply id": "reply_289561",
      "content": "Anonymous 09/06/24 (Fri) 03:47:19 PM289561>>289549if youre>>289525the same anonhow old were you when you two met? and how did you specifically meet?"
   },
   "reply_289564": {
      "reply id": "reply_289564",
      "content": "Anonymous 09/06/24 (Fri) 03:50:39 PM289564>>289541I wonder if the  from lolcow that has multiple bfs that handle shit for her is here. I do what she does but on a smaller scale, just a main with sides but I find it stressful as men are very emotionally needy. At a point Men is basically one of your hobbies and despite my criminally high sex drive I'd rather not be playing musical scrotes all the time there are more interesting things to be doing despite any perks like free handyman services and computer repair"
   },
   "reply_289573": {
      "reply id": "reply_289573",
      "content": "Anonymous 09/06/24 (Fri) 03:57:26 PM289573>>289561We were both 20, we met by chance downtown and we got on the same bus, turned out I only lived right down the street from him. He's the first man I ever felt attracted to, he looks like a noble prince. I saw him for the first time reading a book, one of my fav authors too. At the time his hair was nearly to his waist, golden blond curls. Right away he was doing everything he could to impress me, making me breakfast in the mornings, introducing himself to my grandma because I told him she was my greatest friend and asking for her blessing to date me, I would tell him about music and movies and he would actually listen to or watch them same day and message me to talk about them, he'd work until 12 at night and still rush home to get on his brothers computer to play a silly flash game with me. I grew up in a really fucked up home and a few weeks into knowing him my father and brother had a really violent fight that resulted in one of the windows being broken, blood all over the floor and bathroom sink. My dad called me in a panic and then passed out drunk. I was horrified and humiliated and I had to leave a date we were having to go and clean up this fucking mess and he actually came with me and helped me clean up all of this glass and blood and never once made me feel judged, he just wanted to be there for me. Didn't even judge my insane family, told me he loved them because they loved me. We didn't even have sex for the first time until we were 23 because we both wanted to feel like we were ready because we wanted to be sure that we would be together forever, and we will be. He will drop to his knees in tears and tell me how much he loves me, how completely devoted he is to me, and he's proven this to me in his actions again and again and again in the last ten years."
   },
   "reply_289579": {
      "reply id": "reply_289579",
      "content": "Anonymous 09/06/24 (Fri) 04:01:32 PM289579>>289573i know some nonas/women gush about their boyfriends but im usually a bit skeptical because you never know if theyve only dated for 3 months or 9 or whatever but if youve truly married him for 10 then i know its legit. im very happy for you nona <3 same age relationships also seem superior. who approached who?"
   },
   "reply_289602": {
      "reply id": "reply_289602",
      "content": "Anonymous 09/06/24 (Fri) 04:13:20 PM289602>>289573Cute story anon, I hope this is real and not a fanfic because it’s similar to what I hope for and I won’t settle for anything else."
   },
   "reply_289609": {
      "reply id": "reply_289609",
      "content": "Anonymous 09/06/24 (Fri) 04:15:28 PM289609>>289549All I'm trying to say is that there were and are BILLIONS of women like you who thought they had great relationships until they didn't one day. I hope it never happens to you anon, but please do not use your experience to dismiss the very real deception that other women have unfortunately have and will go through in the future."
   },
   "reply_289611": {
      "reply id": "reply_289611",
      "content": "Anonymous 09/06/24 (Fri) 04:15:56 PM289611>>289579Thank you nona! I approached him first, he was deep into his book. I was listening to my fav album at the time and I paused it to speak to him and when he retells the story (which he does every chance he gets, it's so sweet) he emphasizes how much that means to him because he knows how deeply attached I am to the music I love. When he tells the story he makes me sound like an ethereal goddess kek.>>289602Kekk it's real! I sincerely hope you find the same happiness one day anon. Never settle! Only top quality men or no men at all kek"
   },
   "reply_289626": {
      "reply id": "reply_289626",
      "content": "Anonymous 09/06/24 (Fri) 04:22:59 PM289626>>289609I think there needs to be a healthy medium anon, because I do agree with you. I think it's important to tell women that these things do and can happen, but they also don't happen in a vacuum with no red flags. People will say \"oh their relationship was so great!\" meanwhile they're having weekly fights or are lacking in communication at all. It's also important to remind women that healthy relationships do exist and they can have that. Women deserve to have the absolute highest standards for themselves and should never settle for less. Transparency and communication are two things a lot of relationships lack. My husband and I discuss everything, even if it's uncomfortable, because we can't build a strong relationship on fear or mistrust. If I can't tell him or he can't tell me \"hey, this thing you said/did hurt me/bothered me\" then why are we even trying? It's how we've managed to avoid having fights, because we share our insecurities with each other at the moment they begin to stir up rather than allowing it to build into something else. I watch a lot of true crime shit and drama, so I know the reality you're talking about does exist, I just don't want anons to think it's the only reality. Is that fair?"
   },
   "reply_289657": {
      "reply id": "reply_289657",
      "content": "Anonymous 09/06/24 (Fri) 04:46:21 PM289657>>289549>I refused to have any contact with any men until I found one that was the peak of my standards.im curious about one thing though, given you approached him first at the bus you technically had no way of knowing what his personality was like besides just the type of book he liked (and that you found him physically attractive)since you hadnt ever been in contact with men before, wasnt it kinda scary being the first to approach? especially since you had no way of knowing his true character"
   },
   "reply_289675": {
      "reply id": "reply_289675",
      "content": "Anonymous 09/06/24 (Fri) 05:02:06 PM289675>>289657Well like I mentioned he was the first guy I had ever felt real physical attraction to, up until that point I had only one 2D husbando that I liked and that was basically my only confirmation that I was even attracted to men to begin with. So I see this princely looking man with flowing golden locks reading one of my favorite authors, I couldn't not take my chance. I am a person who really loves to compliment others, it's almost compulsive with other women, so I just started off with a simple compliment of his hair and that's where the conversation picked up. When I say I avoided contact with males, I mean that in the romantic sense, it would be impossible to have total no contact with males in everyday life through school and work. If I had started speaking to him and was put off by his personality or if had started out nice and flipped after he had gained my trust or something, I would have dropped him immediately at any point. I grew up with two older brothers and an absolute shit father so I wasn't going to give any man even an ounce of my energy if he wasn't aligning with my vibes 100%. My husband and I have the kind of relationship where you can guess what the other person is thinking and finish each others sentences and jokes. It's that best friend energy I usually only get with other women. When you really click with someone, you just know it."
   },
   "reply_289764": {
      "reply id": "reply_289764",
      "content": "Anonymous 09/06/24 (Fri) 06:13:26 PM289764>>289626>but they also don't happen in a vacuum with no red flagsThey can and do. Some men are skilled liars and can mask for decades."
   },
   "reply_289868": {
      "reply id": "reply_289868",
      "content": "Anonymous 09/06/24 (Fri) 07:11:04 PM289868>>289764>>289764Nta but decades? Anon. That's not masking, that's someone changing over time. No one can mask for decades, you're giving men way too much credit. It's a little embarrassing. You sound paranoid."
   },
   "reply_289983": {
      "reply id": "reply_289983",
      "content": "Anonymous 09/06/24 (Fri) 07:58:23 PM289983I’m in my mid-20s and getting married terrifies me because of how fat and haggard men get. I genuinely cannot imagine tying myself down to a man knowing what’s to come. I have previously had a lot of fun in a short relationship with a young moid but he was completely serious about dating me. If I have accepted that men offer nothing of value to my life, I don’t want to settle down with one, and I only want to fuck men who are hot, is it smart to pursue hookups? Or because of things like choking and rape, would I be better off trying to find a naive hot young guy who I could let think I want a serious relationship with him so I can use his body? Then repeat this with like two other young guys so I can have a harem? Honestly I really just wanna try fucking a lot of hot men, I don’t want to settle down with just one. I’m also not the type to have terrible sex; I speak my mind and have literally laughed in men’s faces about their skills while I instructed them how to get me off. Most men are not worth this hassle but again I want to fuck someone extremely hot with a great body, something which I have never done before."
   },
   "reply_289990": {
      "reply id": "reply_289990",
      "content": "Anonymous 09/06/24 (Fri) 08:02:17 PM289990>>286693whoa a virgin?? I bet the ancient chinese doctor will pay a lot to fuck you!"
   },
   "reply_290003": {
      "reply id": "reply_290003",
      "content": "Anonymous 09/06/24 (Fri) 08:10:00 PM290003>>289983I have only have one sexual partner so I can't answer most of this, but if you do decide one day to commit to one guy don't \"settle\", find someone who takes care of themselves. Works out, dresses well, eats well. It's literally the bare minimum to find a man that can take care himself. Aging is inevitable and we're all going to look old one day but a man who takes good care of himself will look charming rather than haggard."
   },
   "reply_290056": {
      "reply id": "reply_290056",
      "content": "Anonymous 09/06/24 (Fri) 08:43:52 PM290056>>290003Even then the majority of good looking guys lose their hair and get fatter. I find them repulsive and am always shocked when I see what they used to look like. Look at marriage and family photos to see what the average marriage looks like and you’ll be horrified at how much men let themselves go. Finding a man who will actually keep his hair and maintain a fit body is like finding a needle in a haystack. It seems easier to just fuck the ones who haven’t been wrecked by whatever happens to men in their mid-20s."
   },
   "reply_290096": {
      "reply id": "reply_290096",
      "content": "Anonymous 09/06/24 (Fri) 09:03:45 PM290096 finasteride-before… >>290056Just tell him to use finasteride."
   },
   "reply_290209": {
      "reply id": "reply_290209",
      "content": "Anonymous 09/06/24 (Fri) 10:39:11 PM290209>>289497Yeah I'm confused about this as well. Seems far from reality.You have to assume their interaction with moids is not normal, but things like coomer orbiters online or chasing manwhores or something."
   },
   "reply_290211": {
      "reply id": "reply_290211",
      "content": "Anonymous 09/06/24 (Fri) 10:40:40 PM290211>>290209Alright tell us about all the cool and normal moids you know and how you met them then"
   },
   "reply_290268": {
      "reply id": "reply_290268",
      "content": "Anonymous 09/06/24 (Fri) 11:26:40 PM290268>>290211You meet them in normal places like school, work, hobbies, through other friends, in public places like libraries. They are just normal dudes who do normal dude things and spend maybe 3 hours a week max online because they have jobs and hobbies and friends. They go on hikes with big ass backpacks and like play an instrument and go on group vacations KEK I'm just describing the most normal white man I can think of"
   },
   "reply_290299": {
      "reply id": "reply_290299",
      "content": "Anonymous 09/06/24 (Fri) 11:43:05 PM290299>>290268You're describing a frat boy."
   },
   "reply_290467": {
      "reply id": "reply_290467",
      "content": "Anonymous 09/07/24 (Sat) 12:57:13 AM290467>>290268you sound like you've never really talked to any of those guys"
   },
   "reply_290505": {
      "reply id": "reply_290505",
      "content": "Anonymous 09/07/24 (Sat) 01:22:12 AM290505>>289868Look up the men who drop it after marriage and kids. Me giving men credit would be calling them noble and faithful to their relationships.I am calling them god damn liars."
   },
   "reply_290564": {
      "reply id": "reply_290564",
      "content": "Anonymous 09/07/24 (Sat) 01:59:48 AM290564>>289522>Are you implying this doesn't happen in committed relationships?No, not at all.>you didn't marry/share financially with the fuckersI'm just saying this is a quick filter for moids that would never be marriage material, because they don't try to hide their intentions in the first place. Wouldn't you want to know you're wasting your time sooner rather than later?"
   },
   "reply_290571": {
      "reply id": "reply_290571",
      "content": "Anonymous 09/07/24 (Sat) 02:06:49 AM290571>>290505I'm very familiar with those cases and there are always ignored red flags nona. It's social conditioning over generations for women to give men the benefit of the doubt, men aren't super geniuses slipping in and out of personas. It's not usually women's fault for not recognizing those red flags, it's just a fact of the matter."
   },
   "reply_290576": {
      "reply id": "reply_290576",
      "content": "Anonymous 09/07/24 (Sat) 02:14:24 AM290576>>290571Its not that hard. You only have to live on this planet 5 years to know full well."
   },
   "reply_291041": {
      "reply id": "reply_291041",
      "content": "Anonymous 09/07/24 (Sat) 03:45:42 PM291041>>289983Same anon but does no one actually relate to my post? I thought there would be at least one other woman who understands considering some of the earlier blackpilled replies here about how moids are incapable of love and make women’s lives worse off. At this point I just want to have experiences with pretty/hot young moids, solely for their looks."
   },
   "reply_291048": {
      "reply id": "reply_291048",
      "content": "Anonymous 09/07/24 (Sat) 03:52:34 PM291048>>291041Then just do that, why do you need validation from autistic women online who have likely never even been with a man physically"
   },
   "reply_291085": {
      "reply id": "reply_291085",
      "content": "Anonymous 09/07/24 (Sat) 04:14:08 PM291085>>291048Uh do you even lurk on LC or CC? There’s plenty of women who have relationship and sexual history with moids on here; i’m trying to get an idea if my thinking is warped (since I haven’t dated in years) and/or if there’s anyone who previously tried a similar arrangement and it didn’t work out or wasn’t satisfying. I want to hear perspectives from women who tried sexual relationships with attractive men only with the goal of bedding hot men and nothing else."
   },
   "reply_291089": {
      "reply id": "reply_291089",
      "content": "Anonymous 09/07/24 (Sat) 04:18:45 PM291089>>291085Uh, are you new because I think the posts over the last few years of lc are all the answer you need. If we were on lc right now you'd have anons calling you a cock sucking whore. I don't know why you're looking here of all places for advice on how many men you should sleep with. Seriously anon, get a grip. Live your life in the real world."
   },
   "reply_291111": {
      "reply id": "reply_291111",
      "content": "Anonymous 09/07/24 (Sat) 04:31:38 PM291111>>291041The closest I've heard to what you're talking about was a former friend's colleague - she only fucks buff younger men (I think she's in her 50s and looks great, actually) but at the end of the day she desperately pines for one particular dude who strings her along with empty promises and a fantasy of romance. She only started doing this after marrying and divorcing, and having a kid. Her life sounded empty and pathetically unfulfilling from my perspective, and she doesn't have the matching markers to you that I mention below so she's a useless example for you.The only way you'd be able to accurately predict whether or not you yourself would be happy or not doing what you're proposing is talking to another woman who has the same value structure as you, same expectations, same situation, same previous experiences, and has already churned through the men in question. Which is to say, really fucking unlikely on these boards because it's already a rare situation in the real world."
   },
   "reply_291113": {
      "reply id": "reply_291113",
      "content": "Anonymous 09/07/24 (Sat) 04:33:05 PM291113>>291089Yeah I know the radfem anons would probably mock my post (and I get it tbh) but I’ve been horny lately and don’t see the issue with purely wanting to get some quick enjoyment out of actual hot moids’ short-lasting beauty. Of course hearing them talk and behave like they do is a travesty so I’d have to minimize the time around them to avoid confronting their actual personalities and only sleep with them a few times before they get too comfortable and propose trying new things. That is dangerous however and I realize that they could also just assault me or strangle me the first time we have sex. So I think it’s probably not a feasible idea for a woman with actual self-preservation. If only male robots for female consumption were a thing."
   },
   "reply_291122": {
      "reply id": "reply_291122",
      "content": "Anonymous 09/07/24 (Sat) 04:41:11 PM291122>>291111I see, I’ve heard of divorced women doing this as well and not so much women of my age who just realize they want to bed pretty men. Seems like it takes a shit marriage and maturity to make the majority of women realize the only thing moids are good for (their fleeting beauty) and even then, they still want a relationship with them. I’ve also heard though that men find women who are actively seeking casual sex off-putting and instead like to manipulate the ones who actually want commitment because 1) it’s an ego boost to use pure-hearted women and make them obsessed with you and 2) women seeking casual sex or sex-focused arrangements are seen as lesser because they’ve “been around”.  This whole thing probably isn’t worth it (putting myself in harms way I mean) because of the types of moids who will have casual sex and I’m better off just having a number of “relationships” one after the other with men that I actually find attractive. Thanks for your response."
   },
   "reply_291174": {
      "reply id": "reply_291174",
      "content": "Anonymous 09/07/24 (Sat) 05:29:12 PM291174>>290056I only date asian men for this reason"
   },
   "reply_291333": {
      "reply id": "reply_291333",
      "content": "Anonymous 09/07/24 (Sat) 06:43:10 PM291333>>291174You might be onto something there kek. Most of my exes are Hispanic with no balding in the family but they manage to get fat quite quickly."
   },
   "reply_291362": {
      "reply id": "reply_291362",
      "content": "Anonymous 09/07/24 (Sat) 06:53:03 PM291362Advice for a virgin? I'm in my mid twenties and never dated. I hate the idea of having to wake up to a man next to me and share my home with him and just have a moid always there that I'm expected to see all the time and make plans with. However lately I feel hornier than I have in the past. I feel like hookups have a high chance of disappointing me but I'd like to maybe get a fwb I like and can see every once in a while. I'm worried about not knowing what to do and sucking at sex though. Most people my age started being sexually active long ago so I feel like I'd have no excuse for being awkward or just bad.I have no intention of getting into an actual relationship unless by some miracle I meet the perfect match for me."
   },
   "reply_291370": {
      "reply id": "reply_291370",
      "content": "Anonymous 09/07/24 (Sat) 06:54:46 PM291370>>290056>tfw your husbando was exactly thisFeels good man."
   },
   "reply_291491": {
      "reply id": "reply_291491",
      "content": "Anonymous 09/07/24 (Sat) 07:41:51 PM291491>>291333Eres latina nona? Nunca he salido con un latino o guero porque se gordan y ademas son muy machista. Los asiaticos se cuidan, quedan con su cabello, y tienen valores de familia. Ellos les gustan mujeres latina tambien. Pero todo es relativo. Fijate bien"
   },
   "reply_291767": {
      "reply id": "reply_291767",
      "content": "Anonymous 09/08/24 (Sun) 12:10:46 AM291767>>291174What race are you?"
   },
   "reply_292002": {
      "reply id": "reply_292002",
      "content": "Anonymous 09/08/24 (Sun) 04:42:24 AM292002>>291362just buy a dildo/sex toy. Why would you know what to do if you've never had sex? It obviously takes knowing your body to know what you like. Stop being stupid.Read the thread and decide for yourself if you're part of the golden 1% who will not regret having pointless sex. And if its worth risking your health for it."
   },
   "reply_292032": {
      "reply id": "reply_292032",
      "content": "Anonymous 09/08/24 (Sun) 05:23:28 AM292032>>289541You're the only one here bringing up men when the point of my post is you should be able to live without them but go off. Sounds like the only words you pay attention to must come from a moid's mouth"
   },
   "reply_292281": {
      "reply id": "reply_292281",
      "content": "Anonymous 09/08/24 (Sun) 01:13:17 PM292281>>292002I own sex toys. However, there's this thing called \"human contact\" that I want to experience that silicone just can't replace.Why are people here so condescending for absolutely no reason"
   },
   "reply_292315": {
      "reply id": "reply_292315",
      "content": "Anonymous 09/08/24 (Sun) 01:51:42 PM292315>>291767Chupacabra"
   },
   "reply_292325": {
      "reply id": "reply_292325",
      "content": "Anonymous 09/08/24 (Sun) 02:04:38 PM292325>>291122>I’ve also heard though that men find women who are actively seeking casual sex off-putting and instead like to manipulate the ones who actually want commitment because 1) it’s an ego boost to use pure-hearted women and make them obsessed with you and 2) women seeking casual sex or sex-focused arrangements are seen as lesser because they’ve “been around”.This really seems to be the truth, especially the first point. Men used to pump and dump to get an ego boost, then a large number of women became alright with the one night stand deal and met men where they were at. Now to get the same satisfaction, they have to string a woman (who could’ve been cool with a casual setup as long as it was up front) along by lovebombing and convincing her that they want something serious and THEN pulling away and becoming avoidant, while continuing to send her mixed signals and breadcrumbs to prolong her confusion and feelings for him. I personally believe this has to be more emotionally damaging than being P-n-D’d. >>292281As someone who used to dabble in casual sex and now feels fully satisfied with just sex toys, I totally agree that human contact is the only thing that could be missing. I’ve considered finding a “cuddle buddy” arrangement, but I think men would somehow find a way to fuck that up too. The way I see it, I’ll keep my sanity and stay away from the circus and hysterics that can cloud your mind 24/7 in exchange for feeling touch starved occasionally. But I’ve already done my time and had these experiences and decided it wasn’t for me! I feel like in your specific case, if you don’t try, you’ll always wonder. That’s a different kind of regret. There are absolutely ways to engage in casual sex and stay safe, and you (if everything you said in your post was true) won’t be mentally down and out forever based on trying it once and deciding it wasn’t for you. You already seem to have a rare mindset going into it that would keep you grounded."
   },
   "reply_292348": {
      "reply id": "reply_292348",
      "content": "Anonymous 09/08/24 (Sun) 02:54:27 PM292348>>286693>by drowning in moids' dicks they are only devaluing themselves and giving them more reason to talk badly about us.Who cares what moids think about us? Your giving the opinions of random moids so much power over your actions, if this really is the main reason your a virgin."
   },
   "reply_292360": {
      "reply id": "reply_292360",
      "content": "Anonymous 09/08/24 (Sun) 03:14:49 PM292360>>292281The human contact part is understandable but it's really not worth interacting with a scrote you aren't absolutely in love with. They're selfish and retarded and will absolutely fuck up anything you give them a chance to."
   },
   "reply_292369": {
      "reply id": "reply_292369",
      "content": "Anonymous 09/08/24 (Sun) 03:22:16 PM292369>>291113If you're horny enough go for it, but remember scrotes do everything for their egos to be stroked so you have to get rid of him first. The minute you find yourself liking the retard, its time to completely ghost him. That's usually what they do to women. Don't let them bully you into not wearing condoms, be on top of getting tested every few months, get on birth control, etc. i personally don't find it worth the effort anymore, i just use sex toys and my imagination. And I've also been able to \"substitute\" the desire for physical touch with going to the gym a lot and working out. But, if you really want sex and aren't celibate for other reasons like self reflection and healing, religion, not wanting to be bothered, etc.. I don't really see why you shouldn't just proceed with caution. At this point, women being celibate won't change the views scrotes have on us in a positive way. In fact, it makes them even more aggressive. I personally don't think an individual's sex life should be used as a political statement or a stance against \"the man\", but I'm just one person."
   },
   "reply_292454": {
      "reply id": "reply_292454",
      "content": "Anonymous 09/08/24 (Sun) 04:39:10 PM292454>>289983There are so many factors that are just being overlooked here"
   },
   "reply_292500": {
      "reply id": "reply_292500",
      "content": "Anonymous 09/08/24 (Sun) 05:15:45 PM292500>>286770Extremely based post"
   },
   "reply_292680": {
      "reply id": "reply_292680",
      "content": "Anonymous 09/08/24 (Sun) 07:12:28 PM292680>>292315So hispanic."
   },
   "reply_295366": {
      "reply id": "reply_295366",
      "content": "Anonymous 09/18/24 (Wed) 05:26:29 AM295366>>291174Are Asian guys always uncircumcised?>t. American who hates circumcised dicks"
   },
   "reply_295370": {
      "reply id": "reply_295370",
      "content": "Anonymous 09/18/24 (Wed) 06:44:02 AM295370>>295366Majority. The ones who are circumcised as christian. Asians in Asia would naturally be all uncircumcised."
   },
   "reply_295373": {
      "reply id": "reply_295373",
      "content": "Anonymous 09/18/24 (Wed) 06:52:38 AM295373>>286770>Handle hook-upsYou talk like it's a skill or talent. It's a giant psy op by corporations, the adult industry and horny men, who bombard women incessantly with the notion through tv and film that you should regularly be hooking up, especially young women. That hooking up is this glamorous, \"grown up\" thing you should do.>thoughtless hookup… As opposed to having a deep, meaningful connection with the guy who just met at the bar?"
   },
   "reply_295374": {
      "reply id": "reply_295374",
      "content": "Anonymous 09/18/24 (Wed) 06:54:31 AM295374 1726621809806640.j… I don't understand people who hook up>Going home with strangers and letting them sleep in your bed for the night? Are you nuts?>Oh he wants to have sex with you, this somehow makes it okay "
   },
   "reply_295384": {
      "reply id": "reply_295384",
      "content": "Anonymous 09/18/24 (Wed) 10:41:47 AM295384>>295374true"
   },
   "reply_295389": {
      "reply id": "reply_295389",
      "content": "Anonymous 09/18/24 (Wed) 01:29:39 PM295389>>295374i second this motion"
   },
   "reply_295391": {
      "reply id": "reply_295391",
      "content": "Anonymous 09/18/24 (Wed) 02:28:58 PM295391>>295370I thought koreans were circumcised?"
   },
   "reply_295427": {
      "reply id": "reply_295427",
      "content": "Anonymous 09/19/24 (Thu) 05:44:33 AM295427My question is whether hookup culture is even possible in the context of same sex relationships (les/bi women, not gay moids kek). I've been out as bi for years and never found it easy to find women for casual sex. I've never been a unicorn hunter either so it's not that, I've exclusively dated women."
   },
   "reply_295428": {
      "reply id": "reply_295428",
      "content": "Anonymous 09/19/24 (Thu) 06:10:20 AM295428>>295374Just different lifestyles, surely they do some kind of screening, friends of friends or things like that."
   },
   "reply_295446": {
      "reply id": "reply_295446",
      "content": "Anonymous 09/20/24 (Fri) 02:07:27 AM295446>>295374On top of that they call women like me delusional for waiting to meet a man whose not a porn addicted idiot or psycho. This is the only thread in CC that has made me actually mad in years"
   },
   "reply_295450": {
      "reply id": "reply_295450",
      "content": "Anonymous 09/20/24 (Fri) 02:33:19 AM295450>>295373>You talk like it's a skill or talent.because not getting attached to the other and keeping it temporary actually is an emotional skill that you either have or don't and is very hard to learn >… As opposed to … no, not hooking up with someone you don't even know who you don't realise you'll get attached to and who is going to break your fucking heart (which HURTS, by the way). sex isn't and can't be done purely physically"
   },
   "reply_295470": {
      "reply id": "reply_295470",
      "content": "Anonymous 09/20/24 (Fri) 05:12:25 PM295470 fox without a tail… >>295446It's just Aesop's fable of the tailless fox. They try to convince others it's good to slut around, so they don't have to regret their own actions."
   },
   "reply_295472": {
      "reply id": "reply_295472",
      "content": "Anonymous 09/20/24 (Fri) 05:41:38 PM295472>>291491tan real…"
   },
   "reply_295477": {
      "reply id": "reply_295477",
      "content": "Anonymous 09/20/24 (Fri) 06:51:47 PM295477>>295446most of the posters here are farmers from when their site went down. idk wtf is going on with them"
   },
   "reply_295485": {
      "reply id": "reply_295485",
      "content": "Anonymous 09/20/24 (Fri) 11:38:09 PM295485>>295446>>295470can you guys show which posts are calling you delusional for not sleeping around? most of this thread is shitting on hookup culture"
   },
   "reply_295499": {
      "reply id": "reply_295499",
      "content": "Anonymous 09/21/24 (Sat) 07:49:14 PM295499 IMG_2935.jpeg >>295485Well, I don’t know about posts here specifically, but many moids on 4chan will day ugly virgin girls cannot be femcels, but that chad will never marry them if thats who theyre waiting for and they “missed out on being a whore” if they’re 30+."
   },
   "reply_295512": {
      "reply id": "reply_295512",
      "content": "Anonymous 09/22/24 (Sun) 01:14:54 PM295512>>295499How does that make you feel?"
   },
   "reply_295513": {
      "reply id": "reply_295513",
      "content": "Anonymous 09/22/24 (Sun) 03:05:07 PM295513>>295446You're not missing anything, seriously. It's very difficult to find a moid who isn't a mentally ill person addicted to porn or something similar, but it's much better to be single than to hook up with a mediocre male just to report to society that you're not single."
   },
   "reply_295523": {
      "reply id": "reply_295523",
      "content": "Anonymous 09/22/24 (Sun) 10:56:00 PM295523>>295512About what? Not everyone gets thrills from random sex."
   },
   "reply_295524": {
      "reply id": "reply_295524",
      "content": "Anonymous 09/22/24 (Sun) 11:35:00 PM295524>>295499>“missed out on being a whore” if they’re 30+.I have relatives who disprove this."
   },
   "reply_295526": {
      "reply id": "reply_295526",
      "content": "Anonymous 09/23/24 (Mon) 12:09:21 AM295526>>295524>“missed out on being a whore” if they’re 30+.>I have relatives who disprove this.Do you mean>they're whores while being 30+>they were whores, so they didn't miss out on being one>they never wanted to be whores, so they didn't miss out on being one"
   },
   "reply_295528": {
      "reply id": "reply_295528",
      "content": "Anonymous 09/23/24 (Mon) 01:21:26 AM295528>>295526Option A."
   },
   "reply_295530": {
      "reply id": "reply_295530",
      "content": "Anonymous 09/23/24 (Mon) 05:55:56 AM295530>>273609>Is being a prostitute without getting paid worth it?"
   },
   "reply_295811": {
      "reply id": "reply_295811",
      "content": "Anonymous 09/30/24 (Mon) 08:21:17 PM295811 image_2024-09-30_2… no"
   },
   "reply_295918": {
      "reply id": "reply_295918",
      "content": "Anonymous 10/04/24 (Fri) 11:24:38 AM295918>>295530why do you think you see so many regular girls on OF now? It's just the advertising."
   },
   "reply_295920": {
      "reply id": "reply_295920",
      "content": "Anonymous 10/05/24 (Sat) 10:44:06 AM295920>>285893>Where the frick else am I meant to find an assortment of men to have casual sex withDuolicious>that'll let me ghost the weirdos without worrying they'll rape/murder me over it?nvm. maybe stay on tinder"
   },
   "reply_295921": {
      "reply id": "reply_295921",
      "content": "Anonymous 10/05/24 (Sat) 10:51:30 AM295921>>287022>being a virgin […] implies self controlUnless you're a virgin because you're too ugly for anyone to notice you"
   },
   "reply_295922": {
      "reply id": "reply_295922",
      "content": "Anonymous 10/05/24 (Sat) 10:55:36 AM295922>>289497>normal person>one who like never uses the internet unless it's to message his aunt Happy Birthday on FacebookYou seem to have normal people confused with the Amish"
   },
   "reply_295925": {
      "reply id": "reply_295925",
      "content": "Anonymous 10/05/24 (Sat) 03:54:40 PM295925>>295921Even really ugly moids could pay for a prostitute"
   },
   "reply_295931": {
      "reply id": "reply_295931",
      "content": "Anonymous 10/06/24 (Sun) 02:32:14 AM295931>>295925It’s a crime though"
   },
   "reply_295932": {
      "reply id": "reply_295932",
      "content": "Anonymous 10/06/24 (Sun) 02:53:58 AM295932>>295931>Not everywhere>Doesn't stop them and some women need the cash"
   },
   "reply_295963": {
      "reply id": "reply_295963",
      "content": "Anonymous 10/07/24 (Mon) 08:44:52 AM295963>>273609I find it depressing. You go out, have a fun night, meet a cute guy and bang, then it just ends. There's no more contact, because you both know that there's not much more to say. It's all just filling the hole that he left."
   },
   "reply_295966": {
      "reply id": "reply_295966",
      "content": "Anonymous 10/07/24 (Mon) 09:01:52 AM295966>>295963So dystopian, to think people are doing this to themselves."
   },
   "reply_295968": {
      "reply id": "reply_295968",
      "content": "Anonymous 10/07/24 (Mon) 12:06:32 PM295968>>295966Far more dystopian is that if you realise how nightclubs are essentially marketplaces to sell womens' bodies. The entire business model rests on men using nightclubs as a way to get laid. To that end they are willing to pay exorbitant amounts for drinks and entry fees. Women get in \"free\" because they are the product being sold. And to get recurring men, it is extremely in the interest for the nightclub to get as many women as possible into their hands. So they use subsidised/free alcohol and create an atmosphere to lower women's inhibitions as much as possible and get them to make as dangerous choices as possible (similar to casinos). In many places the free flow of drugs is quietly permitted by the club. Because no sane woman would otherwise bring home a man she just met in a shady place. It's no surprise that various studies show most women have been sexually assaulted in nightclubs. This video explains it well, although in a very whitewashed wayhttps://www.youtube.com/watch?v=Qr1Ddn3INFE"
   },
   "reply_295975": {
      "reply id": "reply_295975",
      "content": "Anonymous 10/07/24 (Mon) 06:39:48 PM295975>>273609No, the answer is NEVER.I might hate myself but I'd still rather saw off my toes than engage in hookup culture. There's literally nothing to gain from it, and if you're perma horny like me still 'having sex' isn't even a good argument when you remember moids are selfish self-centered assholes who wouldn't ever care about giving you an orgasm."
   },
   "reply_296193": {
      "reply id": "reply_296193",
      "content": "Anonymous 10/11/24 (Fri) 06:08:45 PM296193>>295968what even makes a woman go to such a place to begin with?surely, no worthwhile woman would visit such a den of filth, no?"
   },
   "reply_296195": {
      "reply id": "reply_296195",
      "content": "Anonymous 10/11/24 (Fri) 07:33:13 PM296195>>296193>what even makes a woman go to such a place to begin with?i want to dance"
   }
}