{
   "thread number": "117405",
   "original post": {
      "post id": "117405",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 05:11:24 AM",
      "post content": "maybe this post is stupid or redundant but I don't see this particular topic covered in much of the \"pick me\" discourse. I believe there is a subset of pick me girls who present in ways that don't immediately read as pick me, possibly even overtly touting feminist thought or social justice or being a \"girl's girl\" or the like that you can just subtly tell they're still looking for male validation, attention, possibly even go for taken men (might see this type of pick me in the \"female best friend\"). it's like sure they may not be tradwife Tate apologists or \"im so one of the boys im le gamer gurl teehee\" but there are subtle gestures or comments or you notice the content they like online or you see what they post and it just reeks of male gaze or male-centeredness. it's hard when you know they're aware enough of the pickme concept to not be overtly bitchy or competitive, but you just get this gut feeling they'd throw you under the bus anyway or try to steal your man to live out her \"she wears high heels I wear sneakers\" fantasy. it's the modern \"cool girl\" who doesn't know it's a death trap yet. the manic pixie who still thinks her magic is for attracting men. the indie/alt chick who only hangs around guys but never admits the real reason why. the artsy coworker who tries really hard to get your bfs attention outside of work. the \"mom friend\" who tells everyone about it, especially men she's just met. etc., etc."
   },
   "reply_117406": {
      "reply id": "117406",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 07:16:22 AM",
      "post content": "\"pick me\" is just a heterophobic put-down. I wouldn't read too much into it."
   },
   "reply_117407": {
      "reply id": "117407",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 08:24:01 AM",
      "post content": ">>117406fpbp you summed up what that other anon is talking about perfectly."
   },
   "reply_117414": {
      "reply id": "117414",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 01:03:43 PM",
      "post content": ">>117405you sound like a bitchnot every women sounds like op btw"
   },
   "reply_117415": {
      "reply id": "117415",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 01:12:26 PM",
      "post content": ">>117414actually, you know whats worse?women who actively try to be a \"girl's girl\", whatever the hell that means, and then talk badly about other women who aren't even bothering them. kind of like op. what are these people doing that's actively harming other women? nothing.no one talks about same gender aggression because society builds itself on this idea that you absolutely need to get along with every single member of your gender. some people in your gender are assholes and you want nothing to do with them. the ones who aren't are the people that are actually your friends. so anyways, please fuck off op with this random covert mean girls-esque behavior. you stupid"
   },
   "reply_117416": {
      "reply id": "117416",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 01:20:55 PM",
      "post content": ">>117415alsoplease shut the fuck up with these \"observations\". at this point everyone can tell who's some discord socialized annoying person in their cringe larp groups whining about fake discord drama made up for le attention and those who are genuinely just random anons on the internet. fuck off because no one likes the former."
   },
   "reply_117417": {
      "reply id": "117417",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 02:07:31 PM",
      "post content": ">>117415/threadOP you sound like you have severe issues."
   },
   "reply_117426": {
      "reply id": "117426",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 09:02:43 PM",
      "post content": "at this point you're just calling someone a pick me based off vibes and not liking them lol. which isn't that different from women calling other women pick mes in general but just shows that this was never about actually criticizing women who put down other women for men but some weird intrasexual female group competition"
   },
   "reply_117429": {
      "reply id": "117429",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 10:56:25 PM",
      "post content": ">>117426>just shows that this was never about actually criticizing women who put down other women for men but some weird intrasexual female group competitionA weird intrasexual female group competition is a very real thing under patriarchy and is part of how patriarchy keeps power."
   },
   "reply_117439": {
      "reply id": "117439",
      "username": "Anonymous",
      "date posted": "10/04/24 (Fri) 08:43:43 AM",
      "post content": ">>117429I don't see how that's the case. Market value is dictated by supply and demand. Do you expect that women will just start sharing men out of solidarity or something? I don't get it."
   },
   "reply_117466": {
      "reply id": "117466",
      "username": "Anonymous",
      "date posted": "10/05/24 (Sat) 01:34:23 PM",
      "post content": ">>117439>thinking women must compete with each other to bag a moid and not that it's a patriarchal enforced standard because men hate women and are afraid of female solidarityIt's so fucking bleak."
   },
   "reply_117467": {
      "reply id": "117467",
      "username": "Anonymous",
      "date posted": "10/05/24 (Sat) 02:00:25 PM",
      "post content": ">>117466So your idea of a matriarchal society is women getting stuck in harems for select few males?"
   },
   "reply_117468": {
      "reply id": "117468",
      "username": "Anonymous",
      "date posted": "10/05/24 (Sat) 04:01:13 PM",
      "post content": ">>117467Are you schizo?"
   },
   "reply_117484": {
      "reply id": "117484",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 01:40:16 AM",
      "post content": ">>117466women have agency and make the conscious decision to do this"
   },
   "reply_117485": {
      "reply id": "117485",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 03:10:38 AM",
      "post content": ">>117484They make the conscious decision to do the thing they've been groomed to do since birth, that sure makes me feel a whole lot better kek."
   },
   "reply_117486": {
      "reply id": "117486",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 03:31:33 AM",
      "post content": "Yeah, I agree that “pick me” girls can exist in any group or “box” of people, whether they’re into indie or alternative stuff or whatever else. Literally anyone can be a pick me. I think it’s just more surprising to some people when someone who’s indie or alternative turns out to be a pick me because those groups tend to present as if they’re living outside the norm, rejecting the mainstream idea of seeking male approval. But at the end of the day, it doesn’t really matter if they’re obvious or subtle about it—the fact is, they are what they are.And honestly, who cares? If you don’t vibe with them, just don’t associate with them. It’s really that simple."
   },
   "reply_117489": {
      "reply id": "117489",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 04:03:47 AM",
      "post content": ">>117485so women have zero agency. got it"
   },
   "reply_117490": {
      "reply id": "117490",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 05:31:33 AM",
      "post content": ">>117466>>117485Intrasexual competition isn't some conspiracy, women just fight for moids because they want the most desirable ones."
   },
   "reply_117491": {
      "reply id": "117491",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 05:59:19 AM",
      "post content": ">>117489Do any of us - moid or femoid - have agency? Think about it."
   },
   "reply_117492": {
      "reply id": "117492",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 07:15:42 AM",
      "post content": ">>117491Yes."
   },
   "reply_117493": {
      "reply id": "117493",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 07:42:04 AM",
      "post content": ">>117491Not sure. But if one doesn't take responsibility for one's actions and shift responsibility to someone else, one will be forced to live with a victim mindset."
   },
   "reply_117497": {
      "reply id": "117497",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 10:11:56 AM",
      "post content": ">>117406>>117414>>117415>>117416>>117417NTA OP but i have to disagree. There are extremely cringey women who's whole existence is centered around a man, finding a man, to the point they absorb his whole personality and have none left of their own. It is very real and we should call it out because its gross."
   },
   "reply_117498": {
      "reply id": "117498",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 10:14:20 AM",
      "post content": ">>117426More like.. We all have to share the same earth with the men these women encourage to believe they aren't scumbags when they totally are. Its gross behavior, period."
   },
   "reply_117499": {
      "reply id": "117499",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 11:17:43 AM",
      "post content": ">>117497You're a stranger, what gives you more right to mold a person than their lover? Should a women be more concerned over what her friends think than her spouse?"
   },
   "reply_117523": {
      "reply id": "117523",
      "username": "Anonymous",
      "date posted": "10/07/24 (Mon) 03:54:08 AM",
      "post content": ">>117499I think it's more like if you center your whole existence around a man, if the relationship falls through you're basically left with nothing because you don't have your own identity. Especially if you tailored yourself to be someone he likes you need to keep up a whole fake identity."
   },
   "reply_117552": {
      "reply id": "117552",
      "username": "Anonymous",
      "date posted": "10/07/24 (Mon) 10:50:51 PM",
      "post content": ">>117499Why would you mold yourself to your lovers personality? Its just wierd and obsessive. If you have to mold yourself to someone your whole life its living a lie for approval. What does it say about your relationship? It becomes nothing but work to live in your own home, who wants to live that way?"
   },
   "reply_117559": {
      "reply id": "117559",
      "username": "Anonymous",
      "date posted": "10/08/24 (Tue) 08:21:00 AM",
      "post content": ">>117552As an overly autonomous person i used to believe that a good relationship is one where neither side has to compromise, because people are not made of clay to be molded in this or that way. But it ended up to be true only to an extent and now i regret not being more flexible. I was childish. Actually people inevitably mold each other as they grow closer, its organic and as long as there is love its fine."
   },
   "reply_117562": {
      "reply id": "117562",
      "username": "Anonymous",
      "date posted": "10/08/24 (Tue) 12:16:09 PM",
      "post content": ">>117559Yeah that is clearly not the topic though. I'm talking about women who cozy up to someone with extreme religion, masculinity, domineering personality, or extreme toxic expectations and just become whoever that person wants.I have a friend who became this way. Even agreeing that women don't deserve life-saving abortion, or post-rape abortion. She became a complete pig for that man and i feel sorry for the daughter caught up in all that.Molding to a personality in the way you're describing is normal (but it has to be reciprocated )"
   },
   "reply_118110": {
      "reply id": "118110",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 10:51:05 PM",
      "post content": ">>117405im someone that can be considered alt and i've always hung around men because other women didn't want to talk to me and now i'm wondering if people see me as a pick-me"
   },
   "reply_118114": {
      "reply id": "118114",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 03:25:29 AM",
      "post content": ">>117405Yes. I had a friend whose entire personality and online presence was \"I hate men\" but the second she got male attention, she would throw any and all of us under the bus. She would get extremely jealous if I got male attention in front of her. She regularly put herself and her friends in dangerous and stupid situations for male attention. She ignored red flags in men because they gave her attention.She had weird self esteem issues ig."
   },
   "reply_118121": {
      "reply id": "118121",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 08:48:50 PM",
      "post content": ">>117405>pick-me>half of examples include “reee they’re trying to steal muh moid” Isn’t this just a home-wrecker lmao"
   }
}