{
   "thread number": "118003",
   "original post": " experience with fearful avoidant attachment or something  Anonymous 10/24/24 (Thu) 03:51:50 PM118003Is there any hope for people like this? I am looking for therapy but I also need to work on this internally. I don't know why I feel like I am completely unlovable. I am convinced that the second my object of affection starts spending a significant amount of time with me, he will realize how annoying and ugly I am. I don't believe anyone when they say they like me. It feels nice, but deep down I think they just want to get something from me. I've done the psychoanalysis and all that and I know why I'm like this. Now I just want to fix it. I hoped the right person would come alone and I wouldn't feel this way, but I don't think that will ever happen. All my life, all I have ever wanted was romantic love and a relationship. It is my only dream. I am devastated by the fact that I am incapable of it",
   "reply_118008": {
      "reply id": "reply_118008",
      "content": "Anonymous 10/24/24 (Thu) 06:04:05 PM118008>>118006But I am a female. wtf"
   },
   "reply_118012": {
      "reply id": "reply_118012",
      "content": "Anonymous 10/24/24 (Thu) 06:14:47 PM118012if you say you're incapable of achieving it, then you will be. you have to make the reality you want."
   },
   "reply_118019": {
      "reply id": "reply_118019",
      "content": "Anonymous 10/24/24 (Thu) 07:41:05 PM118019>>118010????>>118012I try to stay positive and confident but sometimes my self esteem just takes a crash that I can't come back from. Especially when I fail at forming a connection, it feels like it defines me and my future"
   },
   "reply_118020": {
      "reply id": "reply_118020",
      "content": "Anonymous 10/24/24 (Thu) 07:51:32 PM118020>>118015How is anything I posted unhinged are you retarded"
   },
   "reply_118021": {
      "reply id": "reply_118021",
      "content": "Anonymous 10/24/24 (Thu) 08:15:22 PM118021>>118015>>118020Oh my god shut up moid.(YOU CAN'T SIT WITH US)"
   },
   "reply_118022": {
      "reply id": "reply_118022",
      "content": "Anonymous 10/24/24 (Thu) 08:26:04 PM118022 G97UKqy.jpeg >>118021HANK! DONT FORGET RULE 7, HANK!"
   },
   "reply_118025": {
      "reply id": "reply_118025",
      "content": "Anonymous 10/24/24 (Thu) 09:30:36 PM118025>>118021Pfft if OP is that daft who am i sitting with? i wouldn't want to sit with you. No lies you sound like a degenerate moid wanking on the other side of the screen to broken abused target-practice women. We all know tranny's and moids are the mods running this place anyway."
   }
}