{
   "thread number": "269991",
   "original post": {
      "post id": "269991",
      "username": "Anonymous",
      "date posted": "04/28/24 (Sun) 03:35:49 AM",
      "post content": "Due to #34 reaching the reply limit.Previous threads:>>59700>>66270>>70600>>74796>>76876>>78254>>80203>>82952>>86556>>91969>>98118>>102150>>107266>>118215>>123390>>128346>>133749>>136173>>139266>>159378>>163861>>183288>>206754>>213866>>227017>>235988>>249460>>255893"
   },
   "reply_270003": {
      "reply id": "270003",
      "username": "Anonymous",
      "date posted": "04/28/24 (Sun) 05:56:34 AM",
      "post content": "First for male-hating dogs."
   },
   "reply_270111": {
      "reply id": "270111",
      "username": "Anonymous",
      "date posted": "04/29/24 (Mon) 05:00:55 PM",
      "post content": "https://www.telegraph.co.uk/news/2024/03/05/wpath-tansgender-hormone-therapy-cancer-links-leaked-emails/#comment"
   },
   "reply_270112": {
      "reply id": "270112",
      "username": "Anonymous",
      "date posted": "04/29/24 (Mon) 05:01:49 PM",
      "post content": "Does anyone else think the current trans shit is reaching an extinction burst?"
   },
   "reply_270122": {
      "reply id": "270122",
      "username": "Anonymous",
      "date posted": "04/29/24 (Mon) 05:55:41 PM",
      "post content": ">>270112I dunno. Maybe? I dont even know what is going on in the trans community anymore or the world in general anymore."
   },
   "reply_270124": {
      "reply id": "270124",
      "username": "Anonymous",
      "date posted": "04/29/24 (Mon) 06:14:11 PM",
      "post content": ">>270122same i've checked out of everything tbh"
   },
   "reply_270231": {
      "reply id": "270231",
      "username": "Anonymous",
      "date posted": "05/01/24 (Wed) 01:04:14 AM",
      "post content": ">>269991it's funny to me how a lot of trannies love video games that have a large male fanbase. u see them argue about which Civilization game is best or easter eggs in Fallout games. like can't they be better at hiding their maleness? I'm not saying that females can't play those games, it's just that why would trannies wanna play those games if they don't wanna be associated with any male stuff"
   },
   "reply_270255": {
      "reply id": "270255",
      "username": "Anonymous",
      "date posted": "05/01/24 (Wed) 08:18:25 AM",
      "post content": ">>270124Same nowadays my dream life would be living in a small house in the middle of nowhere, growing my own food and my only contact with society would be when I get to the nearby town to buy necessities every month or so"
   },
   "reply_270256": {
      "reply id": "270256",
      "username": "Anonymous",
      "date posted": "05/01/24 (Wed) 08:20:03 AM",
      "post content": ">>270255imagine this not being your dream from the get go kek"
   },
   "reply_270288": {
      "reply id": "270288",
      "username": "Anonymous",
      "date posted": "05/01/24 (Wed) 01:25:57 PM",
      "post content": ">>270287is that an axewound"
   },
   "reply_270300": {
      "reply id": "270300",
      "username": "Anonymous",
      "date posted": "05/01/24 (Wed) 02:48:38 PM",
      "post content": ">>270288it does not look like a true and honest female vagina. i think one of the spammers posted it"
   },
   "reply_270330": {
      "reply id": "270330",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 01:51:03 AM",
      "post content": ">>270329idk who this is."
   },
   "reply_270331": {
      "reply id": "270331",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 01:59:44 AM",
      "post content": ">>270329Ok you are gay we get it"
   },
   "reply_270332": {
      "reply id": "270332",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 02:01:34 AM",
      "post content": ">>270329>We are not attractive enough to an incel retardOh no what will we do… It's OVER ladies"
   },
   "reply_270340": {
      "reply id": "270340",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 02:38:39 AM",
      "post content": ">>270333 spoiler!!"
   },
   "reply_270343": {
      "reply id": "270343",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 02:51:16 AM",
      "post content": ">>270329That's a man and you are supa gae"
   },
   "reply_270344": {
      "reply id": "270344",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 02:54:44 AM",
      "post content": "why is there a seething incel troon literally shitting up the board?  I really think we need a war draft specifically for incels and TIMs.  Front of the line.Anyways I literally just talked to a girl online and she said at 14 she was spammed dick pics by a grown ass woman THAT SHE KNEW IRL.  I politely explained to her that if someone is sending you pictures of their cock they are a man and need to be prosecuted for sexually assaulting a minor. It's really upsetting to know this shit is happening and people will STILL respect the pronouns of their male assailant.  I fucking hate this world for blindly accepting trans people.  Women have been literally raped and murdered 100000000x more than trannies but trans people can earn pity points by threatening suicide."
   },
   "reply_270352": {
      "reply id": "270352",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 04:25:30 AM",
      "post content": ">>270344>trans people"
   },
   "reply_270372": {
      "reply id": "270372",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 06:04:53 AM",
      "post content": ">i hate troons>b-b-but this 46 years old scrote cosplaying a young girl is fine cause he looks goodFuck off ew"
   },
   "reply_270402": {
      "reply id": "270402",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 02:45:53 PM",
      "post content": ">>270377tbh I don't think most trannies even kill themselves as much as they claim they do.Like sure, I think their rates are higher because dedicating so much of yourself to living a lie is going to fuck your head, but I think trannies probably have a rate of self banning about as high as the average loser incel since most of them are practically the same person.  I'm actually surprised at how a lot of TIMs are not school shooters.  Like there are a ton of AGP school shooters but it seems like when you put them on estrogen they settle down and instead of killing kids en masse they settle on becoming rapists/groomers instead."
   },
   "reply_270410": {
      "reply id": "270410",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 04:01:09 PM",
      "post content": ">>2703771 yes they did lmao you felt called out?2 after you troon"
   },
   "reply_270415": {
      "reply id": "270415",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 04:19:31 PM",
      "post content": ">>270377Are you the moid that keeps spamming the site? or are you a simp woman?"
   },
   "reply_270442": {
      "reply id": "270442",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 09:17:35 PM",
      "post content": ">>270372who are you talking about"
   },
   "reply_270481": {
      "reply id": "270481",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 02:22:00 AM",
      "post content": ">>270415It's a tranny that spams this board"
   },
   "reply_270581": {
      "reply id": "270581",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 04:37:03 PM",
      "post content": "I actually hate tranny’s like Blaire White and their annoying ass kissing. They try so hard to prove that they’re one of the good sane tranny’s, as if they aren’t one and the same with the mentally ill copers that they love to criticize. If they were so self aware they would’ve checked themselves into a psych ward instead of cosplaying as a woman. And shame on the republicans in his comment section who claim to know better, yet continue to affirm this mentally ill man’s delusions by referring to him with feminine pronouns. They’re all up in his comments lying to him, telling him he can pass as a real woman and that he looks “pretty.”"
   },
   "reply_270582": {
      "reply id": "270582",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 04:51:24 PM",
      "post content": ">>270581When I was younger I thought Blaire White seemed sensible and every once in a while would say shit that seemed rational (Like saying trans women are a subset of men)  but these days Blaire is a fucking asshole and just goes around calling everyone who disagree with them ugly and its just so catty.  Also Blaire is getting too much work done and it's starting to look kind of gross.  I don't want to hate anyone strictly because they are trans but Blaire just comes off the same energy as the really mean gay men I've met in my life.Buck Angel is also annoying too, I find the Annoying Tranny the least obnoxious and most self aware but they are new to the scene.  The big thing about them is they are a Zionist which I just can't get behind.I feel like most of these \"not like the other trans\" youtubers also generally feel pressured to be far right.  Like maybe they will defend TERFS but if the realized radical feminism was actually a leftist movement they would change their tune."
   },
   "reply_270584": {
      "reply id": "270584",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 05:01:26 PM",
      "post content": ">>270582you mean The Offensive Tranny? I didn't know they (she?) were a Zionist. Eh, makes sense because they probably think they'd get killed for being a tranny in Palestine or something like that"
   },
   "reply_270585": {
      "reply id": "270585",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 06:31:02 PM",
      "post content": ">>270584oof shit yeah got them confused with the annoying orange.  Pretty sure that was the exact reasoning, that they'd get killed for being a tranny.I know the middle east hates homos but I actually don't know the finer details about how they treat trans individuals.  I'm guessing if they don't pass they will kill them.  I would assume there would be a lot more TIFs in fundamentalist muslim countries because that would work to their advantage in the sense that they would have more economic opportunities without having to deal with a wifebeating scrote and less risk of sexual harassment if they pass.  I don't understand why anyone in their would want to be a TIM in the fundamentalist islamic parts middle east unless they are a homosexual male who wants to be a prostitute or some shit."
   },
   "reply_270589": {
      "reply id": "270589",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 08:08:49 PM",
      "post content": ">>270585In some parts of the middle east, transition is the only way to be allowed to be homosexual with some degree of acceptance. I knew a Palestinian TIM who id'd that way for that reason"
   },
   "reply_270593": {
      "reply id": "270593",
      "username": "Anonymous",
      "date posted": "05/03/24 (Fri) 08:41:24 PM",
      "post content": ">>270589>Palestinian TIMOk I'm curious.  Was he still in Palestine? If so, what were his experiences like."
   },
   "reply_270610": {
      "reply id": "270610",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 01:50:21 AM",
      "post content": ">>270593He was raised in Saudi Arabia, but him and his mom left to and before he died, her and him moved to the Philippines (he was mixed with Filipino)."
   },
   "reply_270611": {
      "reply id": "270611",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 02:14:24 AM",
      "post content": ">>270610So wait he left saudi arabia because he was a gay tranny and moved to the philippines? It was kind of hard for me to understand what you wrote"
   },
   "reply_270614": {
      "reply id": "270614",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 02:48:23 AM",
      "post content": ">>270611He left with his mom to live in the Philippines bc the only other option was living with his dad."
   },
   "reply_270668": {
      "reply id": "270668",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 07:58:06 PM",
      "post content": ">>270112The trend subset of it, yes. It’s currently at the point where if I see a lesbian flag online and click on the profile, it is a man 100% of the time. Not exaggerating. I don’t follow any LGB stuff, so in the past year it has been every time, probably up to fifty individual times. That’s just not sustainable. I’m thinking it will be like bronies. They still exist, but they burned out after about ten years. We’re coming up on ten years since this became the thing low-functioning psychopathic and intellectually disabled males (both typically misdiagnosed as autism) latched onto. The gay ones will probably always exist and I don’t really care about them. But the “lesbians” will stop. Either detransing or more likely just no new ones and the rest getting too old to matter culturally, as with bronies."
   },
   "reply_270669": {
      "reply id": "270669",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 08:00:38 PM",
      "post content": ">>270402They just threaten it 24/7. People that will kill themselves just kind of do it. It’s a cluster B thing."
   },
   "reply_270670": {
      "reply id": "270670",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 08:10:37 PM",
      "post content": ">>270585If you’re anything but the average white dude the resurgence of interest in the Isreal/palestine thing (is it just me or is this a thing that’s always been going on and is only now coming up again because China is pushing it via TikTok to sow division?) is the most “let them fight” scenario in the history of the earth. Creating a country based on schizophrenic delusions (“religion”) was stupid, but also the only better outcome for women than them fighting for eternity like the Blood War from DND is to glass everything within a thousand mile radius of Jerusalem and put some caution tape up."
   },
   "reply_270673": {
      "reply id": "270673",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 09:00:13 PM",
      "post content": ">>270668>Mr. garrison is gay>Mr. Garrison becomes Ms. Garrison>Ms. Garrison becomes a lesbian (we are here)>Ms. Garrison becomes Mr. Garrison"
   },
   "reply_270676": {
      "reply id": "270676",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 09:48:41 PM",
      "post content": "The \"Dead By Daylight\" trans VA is dead now."
   },
   "reply_270677": {
      "reply id": "270677",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 09:51:37 PM",
      "post content": ">>270668You're naive if you think \"lesbians\" will stop. These are psychotic men desperate for sex with women who have aligned gaining it with a political crusade like banning Australia day. They will continue supporting it single mindedly and grow more and more vitriolic until the political climate progresses just enough for the government to capitulate and legislate denying sex to them a crime. It may take generations but their crosshairs are firmly set on this single unmet urge. Sex is a far stronger drive than race or religion and these people are more steadfast in their beliefs than the most radical Jihadi. Their numbers are too small to organise mass rallies or coordinated terror attacks but they grow each day. You will live to see weekly trans sex riots burn down cities and rape hostages in the name of total tranny revolution."
   },
   "reply_270681": {
      "reply id": "270681",
      "username": "Anonymous",
      "date posted": "05/04/24 (Sat) 10:55:55 PM",
      "post content": ">>270677The issue is that non trannie men will gun them all down.  They outnumber them and aren't cucked by artificial estrogen.Tale as old as time, moids will fight moids because both see women as a prize to be won"
   },
   "reply_270684": {
      "reply id": "270684",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 12:21:17 AM",
      "post content": ">>270676was it by the autoimmune disease or was it 41%ing?"
   },
   "reply_270689": {
      "reply id": "270689",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 03:24:01 AM",
      "post content": ">>270677Maybe. If they turn out to be more than keyboard warriors then I guess it’s time for the real fun to begin."
   },
   "reply_270696": {
      "reply id": "270696",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 04:10:57 AM",
      "post content": ">>270694It makes me happy that maybe karma is a tiny bit real sometimes, also also reinforces my belief that autoimmune disease is basically your brain punishing you for lying to yourself by fucking your shit up.May every troon have just the worst MS decline and die quickly to minimize the healthcare burden."
   },
   "reply_270697": {
      "reply id": "270697",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 04:12:57 AM",
      "post content": ">>269991If I see a lesbian flag and click on the profile and it’s a scrote one more time I’m going to fucking lose it. Not your word. Not your flag. Fuck OFF."
   },
   "reply_270698": {
      "reply id": "270698",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 05:23:43 AM",
      "post content": ">>270697Meet up with it then kill it."
   },
   "reply_270699": {
      "reply id": "270699",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 05:26:00 AM",
      "post content": ">>270698Nona!!! Martyr a disgusting AGP AND give moids a reason to fear women?!….Take me with you, I'll be the backup in case things go wrong.Maybe we'll go to the same prison and start a terf gang"
   },
   "reply_270700": {
      "reply id": "270700",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 05:28:07 AM",
      "post content": ">>270698God I wish. Violence is the only language these animals understand."
   },
   "reply_270756": {
      "reply id": "270756",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 09:52:39 PM",
      "post content": ""
   },
   "reply_270758": {
      "reply id": "270758",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 09:54:28 PM",
      "post content": ""
   },
   "reply_270760": {
      "reply id": "270760",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 10:31:51 PM",
      "post content": ">>270758>rubs tar on my face and puts on a shitload of red lipstick>changes my name to sheeneequaSo anyways, as someone who has lived as both a white and a black person…."
   },
   "reply_270761": {
      "reply id": "270761",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 10:33:25 PM",
      "post content": "https://twitter.com/eva_kurilova/status/1785487614205927832?s=46&t=TMUOZCqGbx3Pv9MjeQqrig"
   },
   "reply_270799": {
      "reply id": "270799",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 02:56:36 AM",
      "post content": ">get a tiktok from a tif saying she passes>she doesn’t >get a tiktok of a tif saying she passes>she doesn’t every time. how do they not see that they look like women with flat chests?"
   },
   "reply_270800": {
      "reply id": "270800",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 03:03:38 AM",
      "post content": ">>270799flat chests and scraggly facial hair.Even the ones who 'pass' on camera don't pass irl because they are 5'2 with wide hips and narrow shoulders.I get why you could hate yourself for being a girl, especially in a patriarchal society, but you're just shooting yourself in the foot when you put yourself on test and chop off your tits to try to pass as a scrote"
   },
   "reply_270804": {
      "reply id": "270804",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 03:48:02 AM",
      "post content": ">>270799they'll be like 5'1 and say shit like that lmao"
   },
   "reply_270805": {
      "reply id": "270805",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 04:33:08 AM",
      "post content": ">>270758This has to be fake right? There can’t be people like this. It’s just not possible.Tangentially I was thinking about the “my friend so and so was falsely accused!” thing, and I think the math works out that if your “friend” got accused of rape it’s more likely that this isn’t their first rape than that they were falsely accused."
   },
   "reply_270813": {
      "reply id": "270813",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 07:11:42 AM",
      "post content": ">>270805> There can’t be people like thisAn MRA/MGTOW/Incel what troons out? More likely than you think"
   },
   "reply_270814": {
      "reply id": "270814",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 07:38:22 AM",
      "post content": ">>270799d"
   },
   "reply_270817": {
      "reply id": "270817",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 08:45:42 AM",
      "post content": ""
   },
   "reply_270822": {
      "reply id": "270822",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 09:55:11 AM",
      "post content": ">>270817Why does it remind me of…"
   },
   "reply_270823": {
      "reply id": "270823",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 09:56:36 AM",
      "post content": ">>270822kekk so fucking ugly"
   },
   "reply_270831": {
      "reply id": "270831",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 10:46:39 AM",
      "post content": ">>270822>Spends hours putting expensive makeup on>can't be bothered to at least line his ugly stubbleMany such cases"
   },
   "reply_270869": {
      "reply id": "270869",
      "username": "Anonymous",
      "date posted": "05/06/24 (Mon) 10:40:05 PM",
      "post content": ""
   },
   "reply_270870": {
      "reply id": "270870",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 12:49:28 AM",
      "post content": ">>270869Oh wow,another deluded man pretending to be a girl winning in the women's division. What's the count on that now?"
   },
   "reply_270894": {
      "reply id": "270894",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 03:57:33 AM",
      "post content": ">>270676What's crazy to me is just how little people talk about the link between hormone replacement and autoimmune diseases. The amount of people who start taking hormones only to have a complete collapse of their immune systems as a direct result of those hormones is actually pretty fucking high, so even when they aren't 41%ing themselves their life expectancy is super low. Turns out \"pink pills\" aren't just magic girljuice medicine that turns you into an anime protagonist, hormones are seriously powerful chemicals that have far reaching and largely unmitigatable consequences. But you're not allowed to talk about the real serious health risks of any of this, or how \"puberty blockers\" will lead to them being so underdeveloped their lungs collapse and their brains don't form properly. It's all about muh heckin validation. At the end of the day, I pity them. But, it's going to take a lot more cases like this I think for normies to acknowledge reality."
   },
   "reply_270896": {
      "reply id": "270896",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 04:30:17 AM",
      "post content": ""
   },
   "reply_270898": {
      "reply id": "270898",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 05:19:32 AM",
      "post content": ">>270894> autoimmune diseasesI'd be more worried about cancer. Every sort of artificial hormone introduced causes huge amounts of cancer. Whether it's hormonal contraception or HRT."
   },
   "reply_270904": {
      "reply id": "270904",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 07:07:27 AM",
      "post content": ">>270896He's certainly hetero because that character looks like a generic blowjob sex doll, complete with unrealistic uncanny body proportions that not even real women can achieve. But transitioning totally isn't about living out a terrible, trashy fetish or anything… it's HEALTHY and a human right!I hate coomer failmales so much."
   },
   "reply_270906": {
      "reply id": "270906",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 07:14:26 AM",
      "post content": ">>270758>look up user>he got suspendedEven Reddit knew this loser was irredeemable shit lol. I hope he got told off before he got banned m."
   },
   "reply_270961": {
      "reply id": "270961",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 10:52:20 PM",
      "post content": ""
   },
   "reply_270962": {
      "reply id": "270962",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 11:28:33 PM",
      "post content": ">>270961>72cm hips>child-birthingThese are the hips OF a child"
   },
   "reply_270964": {
      "reply id": "270964",
      "username": "Anonymous",
      "date posted": "05/07/24 (Tue) 11:46:22 PM",
      "post content": ">>270961what the fuck is that?  Is that his weird neo vagina?  It looks scary"
   },
   "reply_270965": {
      "reply id": "270965",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 12:04:54 AM",
      "post content": ">>270961Disgusting and delusional."
   },
   "reply_270966": {
      "reply id": "270966",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 04:03:45 AM",
      "post content": ">>270964looks like his ass crack lmao"
   },
   "reply_270967": {
      "reply id": "270967",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 04:11:37 AM",
      "post content": ">>270966OMFG I didn't realize it was the back his ass is so flat I thought he had really fucked up SRS"
   },
   "reply_270969": {
      "reply id": "270969",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 05:27:42 AM",
      "post content": ">>270961>hormones will change my already set bone structureTrannies are stupid."
   },
   "reply_270972": {
      "reply id": "270972",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 06:22:05 AM",
      "post content": ""
   },
   "reply_270975": {
      "reply id": "270975",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 09:10:14 AM",
      "post content": ">>270973>There’s genuinely no way someone could be this deep in without being in some way psychologically femaleWell, they could just be, yknow, crazy. I think you're overthinking it."
   },
   "reply_270976": {
      "reply id": "270976",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 11:09:09 AM",
      "post content": ">>270961It's posts like this that make me wonder whether trannies are tricking themselves with a kind of powerful wishful thinking  or if they literally do not see the things the rest of us see. Like when dysmorphics see themselves as fatter than they are in a mirror, does the trannoid look at this and actually see a more wide-set pelvis than a sane person does."
   },
   "reply_270978": {
      "reply id": "270978",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 01:05:10 PM",
      "post content": ">>270973>psychologically female"
   },
   "reply_270995": {
      "reply id": "270995",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 06:34:26 PM",
      "post content": ">>270696are you retarded?? most people with autoimmune diseases are women. u are no better than all the male doctors that say \"you're just making it up.\" this is literally a sexist talking point, with the brain \"punishing you\". only difference is here youre saying its because theyre liars, men say its because theyre not homemakers or wives etc"
   },
   "reply_270996": {
      "reply id": "270996",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 06:40:49 PM",
      "post content": ">>270973what the fuck does this mean?? > no way someone could be in this deep without being in some way psychologically female…are you retarded?? what the fuck do you mean by psychologically female ?? you sound like a moid. implying that madness/insanity must surely be \"female thinking\" is like one of the most obvious ways to tell youre a man. gtfo"
   },
   "reply_270998": {
      "reply id": "270998",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 06:53:51 PM",
      "post content": ">>270973Anon TIMs are always psychologically male, they just morphed their misogyny into cosplaying their idea of being psychologically female.At best, they are feminine men, but they are always male, even mentally."
   },
   "reply_270999": {
      "reply id": "270999",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 06:58:05 PM",
      "post content": ">>270995>most people with autoimmune disorders are female>mostClearly he was the exception and not the rule."
   },
   "reply_271002": {
      "reply id": "271002",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 11:18:35 PM",
      "post content": ">>270995Dude there are some serious retards on this site as of late"
   },
   "reply_271004": {
      "reply id": "271004",
      "username": "Anonymous",
      "date posted": "05/08/24 (Wed) 11:59:48 PM",
      "post content": ">>271002>as of latetrannies are always raiding womens spaces, nona.  They hate being left out even though none of us care about their tranny exclusive places"
   },
   "reply_271012": {
      "reply id": "271012",
      "username": "Anonymous",
      "date posted": "05/09/24 (Thu) 02:27:16 AM",
      "post content": ">>270995idk how you got sexism from what she said but go off"
   },
   "reply_271019": {
      "reply id": "271019",
      "username": "Anonymous",
      "date posted": "05/09/24 (Thu) 11:57:09 AM",
      "post content": ">>270817JFC the meme is real."
   },
   "reply_271027": {
      "reply id": "271027",
      "username": "Anonymous",
      "date posted": "05/09/24 (Thu) 02:17:31 PM",
      "post content": ">>270756Jesus they're not even hiding it."
   },
   "reply_271060": {
      "reply id": "271060",
      "username": "Anonymous",
      "date posted": "05/10/24 (Fri) 11:12:04 AM",
      "post content": ">>270231the metal gear solid fanboys are the worst to deal with, and they tend to believe themselves to be quite smart and extremely ~aware~ of the toxic meta narratives that supposedly plague societyone kojimasucker literally corrected me when i decried 'the medical industrial complex' to the 'military industrial complex' bc his knowledge of such a thing was only ever in the context of pervy games that fed him tom clancy talking points with man ass. he could not conceive of the very thing that preys upon him.im pretty pleased to see someone so stupid be punished so much for his willing blindness to this shit. plus he screamed at me and threatened me despite being six foot something and having at least 30% more muscle mass than i did bc i wouldn't tolerate him berating me for not responding the correct way to twitter tranny talking points."
   },
   "reply_271063": {
      "reply id": "271063",
      "username": "Anonymous",
      "date posted": "05/10/24 (Fri) 03:33:22 PM",
      "post content": ">>270973How does that follow? It’s just delusional. There are people that think they’re dead."
   },
   "reply_271064": {
      "reply id": "271064",
      "username": "Anonymous",
      "date posted": "05/10/24 (Fri) 03:34:19 PM",
      "post content": ">>270995Tranny detected, male ejected"
   },
   "reply_271065": {
      "reply id": "271065",
      "username": "Anonymous",
      "date posted": "05/10/24 (Fri) 03:36:52 PM",
      "post content": ">>271035>express a genuine wish that at skinwalking low functioning psychopaths fucking die, as they should>get called a trannyYeah ok"
   },
   "reply_271073": {
      "reply id": "271073",
      "username": "Anonymous",
      "date posted": "05/10/24 (Fri) 09:17:54 PM",
      "post content": ""
   },
   "reply_271266": {
      "reply id": "271266",
      "username": "Anonymous",
      "date posted": "05/13/24 (Mon) 11:15:13 AM",
      "post content": "I find pics of old Tims in make up funny"
   },
   "reply_271525": {
      "reply id": "271525",
      "username": "Anonymous",
      "date posted": "05/15/24 (Wed) 06:46:49 AM",
      "post content": ">>270585I don't understand why anyone would want to be a woman in the first placeIt's fucking miserable"
   },
   "reply_271644": {
      "reply id": "271644",
      "username": "Anonymous",
      "date posted": "05/17/24 (Fri) 01:12:58 PM",
      "post content": ">>270975I mean that's what she said isn't it?"
   },
   "reply_271656": {
      "reply id": "271656",
      "username": "Anonymous",
      "date posted": "05/17/24 (Fri) 06:02:45 PM",
      "post content": "New Troon study: Risk of Suicide and Self-Harm Following Gender-Affirmation Surgery>With the growing acceptance of transgender individuals, the number of gender affirmation surgeries has increased. Transgender individuals face elevated depression rates, leading to an increase in suicide ideation and attempts. This study evaluates the risk of suicide or self-harm associated with gender affirmation procedures.https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11063965/Tl;dr troons more likely to attempt suicide or self harm after their surgeries than before."
   },
   "reply_271664": {
      "reply id": "271664",
      "username": "Anonymous",
      "date posted": "05/17/24 (Fri) 10:38:14 PM",
      "post content": "Honestly don't understand why everyone is mad JK Rowling compared being trans to trying to become black because one likes stereotypically black things. Not sure if it's actually new or not but it just showed up in my tumblr  feed."
   },
   "reply_271665": {
      "reply id": "271665",
      "username": "Anonymous",
      "date posted": "05/17/24 (Fri) 11:18:55 PM",
      "post content": ">>271664Why is it always black people getting dragged into these weird comparisons and hypotheticals though? Trannies randomly bring up black women, too. Like, I've noticed it's never Indians or the Chinese people use for these things kek"
   },
   "reply_271666": {
      "reply id": "271666",
      "username": "Anonymous",
      "date posted": "05/17/24 (Fri) 11:37:08 PM",
      "post content": ">>271073lmao"
   },
   "reply_271895": {
      "reply id": "271895",
      "username": "Anonymous",
      "date posted": "05/21/24 (Tue) 05:04:31 AM",
      "post content": ">>271656What's the new number to replace 41%?"
   },
   "reply_272035": {
      "reply id": "272035",
      "username": "Anonymous",
      "date posted": "05/24/24 (Fri) 08:34:28 PM",
      "post content": "Earnestly: who are there so many male troons in computer science?"
   },
   "reply_272036": {
      "reply id": "272036",
      "username": "Anonymous",
      "date posted": "05/24/24 (Fri) 08:46:00 PM",
      "post content": ">>272035It's either because a lot of trannies are on the spectrum and gravitate towards typical autist interests or because online nerd culture is where they become acquainted with the concept."
   },
   "reply_272037": {
      "reply id": "272037",
      "username": "Anonymous",
      "date posted": "05/24/24 (Fri) 11:42:21 PM",
      "post content": ">>272035companies have female quotas and it's easier to turn men into women than women into programmers"
   },
   "reply_272039": {
      "reply id": "272039",
      "username": "Anonymous",
      "date posted": "05/25/24 (Sat) 12:10:41 AM",
      "post content": ">>272035AGPs have higher rates autism/aspergers. Also high IQ"
   },
   "reply_272040": {
      "reply id": "272040",
      "username": "Anonymous",
      "date posted": "05/25/24 (Sat) 12:15:19 AM",
      "post content": ">>272035Prison gay is unironically a thing. I was friends with a very short unmanly moid, like 5'2, who could not grt a girlfriend. He became a they/them then a troon. Whether it's because of some subconscious imposed idea that he wasn't a man or just a desperate attempt for affection, most troons are unwanted males. It's why they're also often the most disgusting. You'll almost never see a hot guy troon out."
   },
   "reply_272041": {
      "reply id": "272041",
      "username": "Anonymous",
      "date posted": "05/25/24 (Sat) 12:15:55 AM",
      "post content": ">>272039Doesn't explain why they are so absent in other high IQ fields like law, medicine or chess."
   },
   "reply_272044": {
      "reply id": "272044",
      "username": "Anonymous",
      "date posted": "05/25/24 (Sat) 01:47:46 AM",
      "post content": ">>272041Those all involve far more social interaction than programming."
   },
   "reply_272082": {
      "reply id": "272082",
      "username": "Anonymous",
      "date posted": "05/25/24 (Sat) 11:16:09 PM",
      "post content": ">>272035Autism, which can be understood as self-absorption. Non-auto-gynephilia can be assumed as the default state of a man. Man + autism = AGP. AGP + Internet = Trooning out. It's simple math.>>272041Autism spectrum does not mean high IQ at all, quite the opposite: They are literally retarded. Law and medicine as fields are about dealing with people, and people react negatively to autists. Computers do not."
   },
   "reply_272093": {
      "reply id": "272093",
      "username": "Anonymous",
      "date posted": "05/26/24 (Sun) 12:53:05 AM",
      "post content": ">>272035I remember reading an interesting case study done back in the 70s that showed that many MtF's were into technology and computer science. I think this study was conducted in a university too but I may be mistaken. A lot of them were nerdy soft spoken stem dudes before trooning out."
   },
   "reply_272128": {
      "reply id": "272128",
      "username": "Anonymous",
      "date posted": "05/26/24 (Sun) 01:50:28 PM",
      "post content": ">>272041I used to date an Ivy League law student and the 2 things I learned from that experience that you are getting wrong is that law is definitely not a high IQ field and that there are a lot of trannies in it.I remember one party I was dragged to where the person everybody kissed ass to was a tranny involved with Harvard."
   },
   "reply_272139": {
      "reply id": "272139",
      "username": "Anonymous",
      "date posted": "05/26/24 (Sun) 06:34:32 PM",
      "post content": ""
   },
   "reply_272148": {
      "reply id": "272148",
      "username": "Anonymous",
      "date posted": "05/26/24 (Sun) 08:11:25 PM",
      "post content": ">>270344>STILL respect the pronouns of their male assailant.reminds me how i was describing my abusive ex… mid conversation i was corrected by my crush \"it's she! me correcting pronouns does not mean i respect or agree with her tho but you must say she!\"well, i gave him the analogy \"if someone was raped, would you also correct the pronouns of her rapist?\" and he got the point and apologized sincerely. also wtf, who the hell cares, literally the tranny will never know he was \"misgendered\" anywayalso my still crush/best friend/ex has considered trooning out himself too. i am going to cry so hard if this comes true and he ruins his life. certain people he's with have been brain rotting him lately. he bought and wore eyeshadow in private too. fml."
   },
   "reply_272149": {
      "reply id": "272149",
      "username": "Anonymous",
      "date posted": "05/26/24 (Sun) 08:56:54 PM",
      "post content": "Want some rage, nonas?  Check out this Wikipedia troon/autist drama, in which self-professed autistic anarcho-communist Dronebogus calls a gender-critical columnist a \"transphobic wackadoodle\" (in complete violation of Wikipedia's so-called rules against personal attacks), then gets another user permanently banned for making very light anti-troon comments:https://en.wikipedia.org/wiki/Wikipedia:Reliable_sources/Noticeboard/Archive_436#Student_newspaper_for_controversy_on_a_BLPhttps://en.wikipedia.org/w/index.php?title=Talk:Gender-affirming_surgery&diff=next&oldid=1221435817https://en.wikipedia.org/wiki/Wikipedia:Administrators%27_noticeboard/IncidentArchive1155#LadybugStardust_and_transphobic_remarkshttps://en.wikipedia.org/wiki/User_talk:LadybugStardust#May_2024https://en.wikipedia.org/wiki/User_talk:Ponyo#LadybugStardustScreencaps of the drama on Imgur: https://imgur.com/a/sRHjGRtTroons then started leaving messages of support on the TRA sperg's talk page:https://en.wikipedia.org/wiki/User_talk:Dronebogus#thanks_for_making_my_day_betterhttps://en.wikipedia.org/wiki/User_talk:Dronebogus#A_fox_for_you!Wikipedia has been completely taken over by these troon autists.Have a look at this guy's pages:https://en.wikipedia.org/wiki/User:Dronebogushttps://en.wikipedia.org/wiki/User_talk:DronebogusI think I may have stumbled across the next great lolcow.>self-inserts as Wikipedia-tan and probably goons to her>describes himself as autistic, \"a mentally ill child\", and \"a leftist commie POS\">uses the phrase \"submissive and breedable\">cripplingly addicted to userboxes, collects them like they're fucking Pokemon>one of them is about that Nyanners girl who sings cutesy songs about wanting to be raped as a little girl>three of them are about his waifus>the other five hundred and thrembo are standard troon humor>one of them says that he \"wants to turn America into a GAY COMMUNIST ANIME.\">has a second section at the bottom for userboxes that don't even apply to him; I didn't even notice this at first>they're also cringe-inducing troon humorNonas, this is truly the perfect specimen.This appears to be yet another case of an actual natal woman being driven off of the site by an overbearing autist man."
   },
   "reply_272160": {
      "reply id": "272160",
      "username": "Anonymous",
      "date posted": "05/27/24 (Mon) 08:14:12 AM",
      "post content": ">>271665There are people who claim that they are transblack"
   },
   "reply_272179": {
      "reply id": "272179",
      "username": "Anonymous",
      "date posted": "05/27/24 (Mon) 11:29:40 AM",
      "post content": ">>272139Should've underlined the unironic \"I'm a ginger so it might just be that\" too, pornsickness at its finest."
   },
   "reply_272219": {
      "reply id": "272219",
      "username": "Anonymous",
      "date posted": "05/28/24 (Tue) 06:22:31 PM",
      "post content": ">>272149Wikipedia is a tranny circlejerk.  The user you posted about is very much the typical Wikipedo editor: a porn-obsessed tranny activist neckbeard."
   },
   "reply_272228": {
      "reply id": "272228",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 12:44:33 AM",
      "post content": ">>270972Who cares"
   },
   "reply_272235": {
      "reply id": "272235",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 02:38:19 AM",
      "post content": "Troons are gross but at least they're getting themselves voluntarily sterilized right?"
   },
   "reply_272240": {
      "reply id": "272240",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 04:42:04 AM",
      "post content": "FYI this is the endgame for troons lmao. The straight ones anyway"
   },
   "reply_272247": {
      "reply id": "272247",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 05:21:26 AM",
      "post content": ">>272149Good god, this is bad lmfao. Ladybug's comments on \"gender reassignment surgery\" were honestly a little too nice and she still gets banned. I'm so sick of this moid shit, they already have everything now they have to take over everything women have to. Just so done lol"
   },
   "reply_272265": {
      "reply id": "272265",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 02:15:17 PM",
      "post content": ">>272240Sorry for the pixelated meme. I had to post it."
   },
   "reply_272266": {
      "reply id": "272266",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 02:28:00 PM",
      "post content": ">>272240they are disgusting, selfish narcs in life and this is the tortured last leg of it that they deserve."
   },
   "reply_272300": {
      "reply id": "272300",
      "username": "Anonymous",
      "date posted": "05/29/24 (Wed) 10:32:55 PM",
      "post content": ">>272240>80 in 2024>transitioned in 1974doubt"
   },
   "reply_272311": {
      "reply id": "272311",
      "username": "Anonymous",
      "date posted": "05/30/24 (Thu) 02:50:48 AM",
      "post content": ">>272300you do know trannies and gender reassignment surgery existed back then right?"
   },
   "reply_272401": {
      "reply id": "272401",
      "username": "Anonymous",
      "date posted": "05/30/24 (Thu) 11:20:40 AM",
      "post content": ">>272040tbh a friend of mine had an ex bf who's pretty hot, was thinking abt trooning out, it's just a question of self confidence"
   },
   "reply_272414": {
      "reply id": "272414",
      "username": "Anonymous",
      "date posted": "05/30/24 (Thu) 01:39:41 PM",
      "post content": ">scroll around some sites to chill for a bit and even out my mood from stressful life stuff>run across the troon flag or some unfunny \"meme\" about eggs or \"girldicks\" or cringey tranny logic every 10 minutes>some cool art, engineering stuff, pet pics–\"GUYS MY EGG CRACKED\">\"DID YOU KNOW THAT CONSERVATIVES WON'T CONSIDER MY MARRIAGE TO A WOMAN LEGAL BECAUSE I'M A ~~GIRL~~ BUT DON'T CONSIDER ME A GIRL LOL GOTTEM\">any time I come close to forgetting about it, another one comes up>mood is now even worse>realize it's almost June which will only multiply this crap>remember this place exists, stumble back to scream into the void for a secIt's like going for a walk in a nice area, minding your own business to take your mind off things, but every 50 steps a sexual predator in a dress flings rancid feces at you and screams about how you're not respecting his genitals enough. Like, fuck off, I wasn't even thinking about you, but I suppose that's a crime to entitled narcissists. You just HAVE to shove your crap in everyone's face, god forbid you just be a person and exist without going \"EVERYONE LOOK HOW TRANS I AM, HAHA I AM SO TRANS, BIOFEMS WISH THEY LOOKED THIS GOOD LOL IGNORE MY STUBBLE THO\". No no, can't have that, gotta manpost about how \"girl\" you are and show off your latest plans to look more like a sex doll marketed toward men.The moderation teams are all trannies, so you also can't say anything against them or you get dogpiled by a bunch of seething scrotes for not going along with their sex fantasy roleplay. Even YouTube keeps doing this; there's no troon shit in my watch history and I continuously junk recommendations that have troon shit in it, but they keep popping up. It's like the worst game of whack-a-mole I never asked to play. No, I don't want to watch a video about a \"transing journey\" or some guy doing voice training to sound like a guy failing to sound like a woman, or how hard \"Jessica\" has it because she wasn't allowed to fap in the womens' bathroom when a mom kicked him out so she could let her daughter pee in peace. I just want to live my life and not think about horny men in dresses that steadily keep erasing what little rights and progress we've managed to get back from them because they failed at life. Maybe I just want to see someone's cool crafts for a while or hear what someone thought of a book without someone going \"HEY LOOK, THERE'S TRANNIES\" or whatever inane shit they're doing and whining how oppressed they are over their AGP.Oh, and they don't recognize your marriage because they think you're \"a girl\", it's because you're a deranged abomination whose entire identity is his junk and sexual orientation. I just want to stop being reminded this shit exists. Can I not have a month, a week, a fucking day, SOME PLACE where there isn't a constant drip-feed of troon propaganda or getting raided by them for not having troon propaganda? If you septic smelling pill-poppers and child groomers have nothing to do with my everyday life, then fucking prove it and stop shoving the fetish that amounts to your entire personality into my facealldayeverydayholySHITfuckoff. Just fuck off, keep to your weird chats where you compare each other to how much you (don't) look like an anime character, shove frozen tomato juice in your surgery holes, and try to find other mentally ill men desperate enough for sex that they'll say you ~definitely don't look like a man~ if it means getting what they want from you for a while. Low quality male attention is the cheapest shit in the world, that you keep bragging about getting any for cross-dressing for gooners just speaks of how much you struggle to get it and how little attention in general you received in life. You're a male and you fail, yet advertising this and how pornsick you are is somehow seen as a brave accomplishment. Congratulations on being a man with a twisted brain, I guess? Making your whole personality estrogen doses and shit that reinforces gender roles, furthering the idea that actual women can't be women unless they wear the \"hyper feminine\" shit men get turned on by? I'd tell you to eat a dick, but you'd probably like that. Hell, if you're a \"transbian\" then you'd probably eat your own as a rite.I'm so tired of all of this. Trannies themselves are what keep me peaked even when I'm minding my own business and not thinking about them. They're this tiny percentage of the population and I can count the number I've seen in person with my hands alone (and they've all been weird and gross, so the number is also low due to not wanting to see even more), yet everything fucking revolves around them and you're not allowed to think of anything else for even a second or you're being a \"transphobe\". They're also absolutely everywhere online and I can't stop running into them there. The closest I can get to avoiding it for a while and getting a peaceful break is to avoid all internet, but I do a lot of online work and can't dodge ALL of it, and even outside they have those fucking flags up everywhere in business windows or whatever.>\"Go along with it or else we'll ruin your life! We'll also beat, rape and kill you, which is definitely not something men do and have always done to get their way. I'm definitely not a man, shut up. Watch as I am more of a 'real' woman than you because I think and act exactly like a man.\"No, I'm not going to fucking pretend you're a woman, Patrick. Fuck off Michael, naming yourself Lily and cleaning your face a bit better doesn't make you female. Yes, Robert, I've seen your leaked    Discord logs about how you want to be a sex slave object because it's \"a proper girls' role\" and so know all your ignorant pro-feminist rambling on social media is ignorant for a reason, since it's just you LARPing to feel \"euphoria\" and you don't actually give a shit about anyone's rights except the ones you can use to get sexual gratification. Posting pics of yourself wearing striped socks and injecting drugs to ruin your immune system doesn't make you a teen anime girl, Walter.All of your disgusting bullshit is negatively affecting laws and medical care for people and setting back our rights and freedoms–no, we are not allies, you are actively eroding the small island we managed to pile up just because people rightly see you as repellent and aberrant, it's not the same thing–all because you have something wrong with your head and need to make it everyone else's problem. Actually being a woman vs being a man who wants to be one are not comparable in any way that matters, stop flattering yourselves and looking for connections where there are none. Other men are the ones beating and killing you, and that's normal male behavior that they do amongst themselves. You are ill men, we are not allies. It's not my job to make you comfortable in spite of your sexual deviancy, nor is it my job to cater to your delusions and provide a constant stream of reassuring lies about you being what you aren't. No woman's life should revolve around ruining their own just so you get a date with her, just so you don't feel bad about how your ideas of being a super hot porn star prostitute just MAY not line up with reality. That the lie you tell yourself may not be true.Unlike the men, I accept that these cretins being everywhere is reality even if I absolutely despise that this is the state of things. I can't change this on my own, and I can't make it actually all go away, as hugely positive that would be for everyone. I'm just one person, and when the world is run by men no one takes you seriously unless you're also one. Or, rather, they'll seem to take you seriously if you say the things they want, if it gets them \"good boy\" points for possible benefits. All I'm asking for is some fucking PEACE AND QUIET so I don't have the most obnoxious Straw of Back Breaking being waved in my face constantly. Just talk about something else. Do you not have any other interests? Are you just incapable of posting content or having a conversation without throwing the troon flag out there and talking about how gender euphoric you get when you see yourself cross-dressing in a mirror? Keep your retarded fetish flag shit where it's appropriate and not literally everywhere else. The world's shitty and full of moidery as it is, at least give me a break from THIS. Let me have some fucking PEACE. HOLY SHIT, I'm so tired of pornsick men."
   },
   "reply_272455": {
      "reply id": "272455",
      "username": "Anonymous",
      "date posted": "05/31/24 (Fri) 01:54:45 AM",
      "post content": ">>27189511x more likely to attempt suicide3x more likely to be dead9x more likely to suicide/self harm7x more likely to have PTSD"
   },
   "reply_272580": {
      "reply id": "272580",
      "username": "Anonymous",
      "date posted": "06/01/24 (Sat) 11:28:14 PM",
      "post content": ">>272579>damaged afabWhat does this even mean? Women who are tomboys or victims of assault are damaged? That's literal moid rhetoric. Also, most FTMs aren't autoandrophiles. They're just traumatized, autistic, or lesbians, but that doesn't make them \"damaged\" aside from the damage the do to their own bodies and minds."
   },
   "reply_272581": {
      "reply id": "272581",
      "username": "Anonymous",
      "date posted": "06/01/24 (Sat) 11:35:03 PM",
      "post content": ">>272580i think they are mentally damaged from the misogyny theyve experienced or from some level of sexual abuse that caused them to want to chop their tits off in order to never be sexualized by men again. its these types that are lulled into the aap troon cult."
   },
   "reply_272582": {
      "reply id": "272582",
      "username": "Anonymous",
      "date posted": "06/02/24 (Sun) 01:26:46 AM",
      "post content": ">>272579>hateful echo-chamber>justified disgust and anger is \"hateful\"ok"
   },
   "reply_272584": {
      "reply id": "272584",
      "username": "Anonymous",
      "date posted": "06/02/24 (Sun) 01:40:32 AM",
      "post content": ">>272579you sound so annoying"
   },
   "reply_272792": {
      "reply id": "272792",
      "username": "Anonymous",
      "date posted": "06/05/24 (Wed) 11:52:26 PM",
      "post content": ""
   },
   "reply_272918": {
      "reply id": "272918",
      "username": "Anonymous",
      "date posted": "06/07/24 (Fri) 03:58:32 PM",
      "post content": ">>270670>If you’re anything but the average white dude the resurgence of interest in the Isreal/palestine thing (is it just me or is this a thing that’s always been going on and is only now coming up again because China is pushing it via TikTok to sow division?) is the most “let them fight” scenario in the history of the earthI don’t get what you mean. Are you talking about white moids who hate both jews and muslims?"
   },
   "reply_273232": {
      "reply id": "273232",
      "username": "Anonymous",
      "date posted": "06/12/24 (Wed) 09:57:18 AM",
      "post content": ""
   },
   "reply_273267": {
      "reply id": "273267",
      "username": "Anonymous",
      "date posted": "06/12/24 (Wed) 07:28:22 PM",
      "post content": ">>273232female inmates should all band together to castrate scrote trannies"
   },
   "reply_273288": {
      "reply id": "273288",
      "username": "Anonymous",
      "date posted": "06/13/24 (Thu) 02:24:38 AM",
      "post content": "Had this moid show up on the front page of Reddit while I was doomscrolling. Based Toronto airport employees clocked him instantly lmao. The comments are like “omg but you pass so well” like cmon. The shitty wig and man jaw are so obvious. He’s using instagram poses to hide it too. I had a good chuckle scrolling through his profile."
   },
   "reply_273440": {
      "reply id": "273440",
      "username": "Anonymous",
      "date posted": "06/15/24 (Sat) 02:33:03 AM",
      "post content": ">>270896Am ashamed that I was once subscribed to his channel.(At least it was in the beginning, when he wasn`t political and just wanted to share what he learned in uni)"
   },
   "reply_273478": {
      "reply id": "273478",
      "username": "Anonymous",
      "date posted": "06/15/24 (Sat) 02:01:15 PM",
      "post content": ">>272035Little to no physical activity messing with brain chemistry. Causes men to latch onto stray thoughts, based on the reoccurring thought this usually causes depression but for autogynephiliacs it usually causes \"gender dysphoria\" https://www.youtube.com/watch?v=i7kh8pNRWOo"
   },
   "reply_273665": {
      "reply id": "273665",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 08:31:29 AM",
      "post content": "Do you think Empress (the Denuvo cracker) is actually a woman? Her terfposting sounds like what a moid would come up with tbh but if the boss of piracy was actually a woman I could die happy"
   },
   "reply_273670": {
      "reply id": "273670",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 11:28:08 AM",
      "post content": "A Christian church I have driven past for years put a rainbow piece of cardboard in their window a few years ago, and just recently there is a tranny flag planted right by road like it's a conquered territory. It's grim, and I have to drive past it almost every day and be reminded of trannys."
   },
   "reply_273695": {
      "reply id": "273695",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 05:40:34 PM",
      "post content": ">>273665It's not unlikely. The sci-hub creator is also a woman."
   },
   "reply_273699": {
      "reply id": "273699",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 06:44:19 PM",
      "post content": "I'm not sure about empress but fitgirl reacts like how I would expect a woman to online (uninvolved, defeated, shy, but open to talk about whatever). I learnt at some point she's bi tho so maybe she's a tranny after all…"
   },
   "reply_273701": {
      "reply id": "273701",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 06:54:47 PM",
      "post content": ">>273699Yes. Every bisexual is trans."
   },
   "reply_273702": {
      "reply id": "273702",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 07:04:24 PM",
      "post content": ">>273701I'm sorry but if a woman says she's bi the chances of \"her\" being trans go up. Not saying all bisexuals are troons"
   },
   "reply_273703": {
      "reply id": "273703",
      "username": "Anonymous",
      "date posted": "06/18/24 (Tue) 07:06:57 PM",
      "post content": ">>273699i understand if you said gay since the chances of it being true are suspicious but many women identify as bisexual nowadays"
   },
   "reply_273925": {
      "reply id": "273925",
      "username": "Anonymous",
      "date posted": "06/23/24 (Sun) 11:47:24 AM",
      "post content": "Why are tims always so arrogant about their appearance with the whole \"replacing real women\" thing?"
   },
   "reply_274029": {
      "reply id": "274029",
      "username": "Anonymous",
      "date posted": "06/25/24 (Tue) 06:40:12 PM",
      "post content": ">>273925Why do you think? A woman is only a \"woman\" when she's presenting as sexually attractive for a man. Right wing men are open about comparing non-sexually attractive women to trash or crazy cat ladies, other men are just more subtle about it. Unrelated, been musing a bit to myself lately, and looking into narcisstic parents. A lot of what I've learned mirrors a lot of what you see in trans communities. Not every trans identifying person is a narcissist but there's almost at least one narcissist among them.Every slight criticism is an attack against them, you're not allowed to question anything (that counts as criticizing as well), any misdeed that they do can be brushed away with an excuse like \"because of living in a transphobic society\" (look into the Audrey shooting), and of course, imprinting it all onto their children that they must believe what they believe, down to having mini-mes.Getting out of trans communities was probably the best thing I had ever done, I'm just grateful that my own family never actually believed in it, despite it also being a dysfunctional mess. Maybe writing this out will help someone else, I don't really know."
   },
   "reply_274127": {
      "reply id": "274127",
      "username": "Anonymous",
      "date posted": "06/28/24 (Fri) 07:58:31 PM",
      "post content": ""
   },
   "reply_274203": {
      "reply id": "274203",
      "username": "Anonymous",
      "date posted": "06/30/24 (Sun) 12:07:26 PM",
      "post content": ""
   },
   "reply_274296": {
      "reply id": "274296",
      "username": "Anonymous",
      "date posted": "07/02/24 (Tue) 08:12:50 PM",
      "post content": ">>274203He 100% has an annoying effeminate scrote voice and thats why they make fun of him"
   },
   "reply_274298": {
      "reply id": "274298",
      "username": "Anonymous",
      "date posted": "07/02/24 (Tue) 08:14:34 PM",
      "post content": ">>273925Jealousy"
   },
   "reply_274516": {
      "reply id": "274516",
      "username": "Anonymous",
      "date posted": "07/06/24 (Sat) 11:03:54 PM",
      "post content": ">>272414I physically cringe whenever I hear or read \"girldick\". It's ALWAYS posted about by a gay man talking about his ferishes, or by a troon bragging about how big \"\"\"her\"\"\" dick is. It can't be anything but a fetish."
   },
   "reply_274517": {
      "reply id": "274517",
      "username": "Anonymous",
      "date posted": "07/06/24 (Sat) 11:05:10 PM",
      "post content": ">>272414I physically cringe whenever I hear or read \"girldick\". It's ALWAYS posted about by a gay man talking about his ferishes, or by a troon bragging about how big \"\"\"her\"\"\" dick is. It can't be anything but a fetish."
   },
   "reply_274681": {
      "reply id": "274681",
      "username": "Anonymous",
      "date posted": "07/07/24 (Sun) 07:59:28 PM",
      "post content": ">>272148what a larp"
   },
   "reply_274697": {
      "reply id": "274697",
      "username": "Anonymous",
      "date posted": "07/08/24 (Mon) 06:27:49 AM",
      "post content": ">>273925It's pure cope and wishful thinking, they wouldn't say it if it weren't. They want to believe it's possible, or that they somehow have some other qualities that puts them above. But they know they don't. They hated women before and they hate women even more after. They want to pretend they can determine what defines womanhood since they know they're not women and can never be. They pathetically pretend that this reality is proof of being distinct and above women, while at the same time their whole thing is that they're just women like any other. But clearly even they know that's not true in any way. In the case of the homosexual ones, they know men despise them, yet they specifically want a straight man as proof. That combined with trooning out because of porn, their whole transition being shaped by porn, means they define womanhood like so >>274029. What else would they have to define it? Well if they weren't pornsick to begin with it would be bizarre to them. That's why there's no real troon, no good ones. Because they wouldn't exist otherwise."
   },
   "reply_274770": {
      "reply id": "274770",
      "username": "Anonymous",
      "date posted": "07/10/24 (Wed) 12:18:48 AM",
      "post content": ">>273925Honestly, I don't think it even is misogyny. For trannies, they have the reality of their existence reinforced into their minds every day, that reality being that they will never be women. It's so stark and obvious that even just claiming they are women is a political act that, thankfully these days, gets a lot of push back. They literally cannot argue that they're just women because they clearly aren't. Every time they stand in line at the grocery store next to an actual woman and are forced to confront their freakish proportions, their fake voice, their moid body odors, the facial hair already regrowing by noon, it's a reality that is too apparent.And so ironically I think they just break and shoot for the impossible, because the category ABOVE women isn't real, so how can you deny them? At least, so it goes in their delusions. Sure I'm not as attractive as a woman - I'm actually MORE attractive! And and and… we're even BETTER at socializing with men and they'll enjoy us MORE and… well, it's cope at the end of the day, but it's a level of delusion that is at least safer from every day challenges. Now they don't have to feel like less of a woman when they're in line at the grocery store, because they're comparing themselves internally to something else. He doesn't have to be a woman anymore, he can be better because he says the n word on imageboards or some other stupid criteria. Like every other kind of narcissism, they're shielding their low self esteem with delusions of grandeur. It's actually very consistent with the mental illnesses we all know they have.Of course this will fail too eventually. The literal only thing a trans \"woman\" can bring to the table that a real woman can't is a penis, so the only men they attract are homosexuals, which drives them completely insane. But that's life. In a sane world they'd be given medication to treat the dysphoria instead of just indulging it and mutilating them for tens of thousands of dollars."
   },
   "reply_274771": {
      "reply id": "274771",
      "username": "Anonymous",
      "date posted": "07/10/24 (Wed) 02:44:08 AM",
      "post content": ">>274770> thankfully these days, gets a lot of push back.but nona these troons are getting emboldened because of the fact when it comes to identify politics, they're literally at the highest on the totem pole and have the highest victim points. it doesn't help that women are too nice to say anything about it so there's no pushback> only men they attract are homosexualsi've seen way too many AGPs in relationships with lesbian women but at that point can you even call those women lesbian? but still, the fact that these women identify as lesbian yet still date these trannies just affirms the trannies delusions>In a sane world they'd be given medication to treat the dysphoria instead of just indulging it and mutilating them for tens of thousands of dollars.what a fucking insane time we live in . i really hope we can look back on these times and laugh"
   },
   "reply_274809": {
      "reply id": "274809",
      "username": "Anonymous",
      "date posted": "07/11/24 (Thu) 05:58:23 AM",
      "post content": ""
   },
   "reply_274814": {
      "reply id": "274814",
      "username": "Anonymous",
      "date posted": "07/11/24 (Thu) 12:00:40 PM",
      "post content": ">>274771>when it comes to identify politics, they're literally at the highest on the totem poleI don't think that's the case anymore, thankfully. There was a time where they were untouchable but even now they're being barred from women's sports and it's not uncommon for people to just flood any event with trannies involved with angry comments. Not saying they don't have power, but the tide is turning I'd say. The absurdity of it all is collapsing in on itself. Too many people reporting a collapse of their immune system due to hormones, too many young girls growing up and regretting their surgeries, too many weird trannies getting locked up for sexual crimes. They're still absolutely powerful, but they're not untouchable like they used to be. Here's hoping that trend continues till all of it becomes illegal. I'm still amazed doctors can make money off convincing young girls to cut their breasts off."
   },
   "reply_274824": {
      "reply id": "274824",
      "username": "Anonymous",
      "date posted": "07/11/24 (Thu) 06:56:50 PM",
      "post content": ">>274770I think it's a kind of power play. They are forcing you agree to to their obvious lies, and enjoying their power and your humiliation that comes from being forced to accept their lies."
   },
   "reply_274827": {
      "reply id": "274827",
      "username": "Anonymous",
      "date posted": "07/11/24 (Thu) 08:27:20 PM",
      "post content": ""
   },
   "reply_274832": {
      "reply id": "274832",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 02:37:17 AM",
      "post content": ">>274771>>274770>In a sane world they'd be given medication to treat the dysphoriaBut there's no a drug to remove real gender dysphoria currently? Quite the opposite it's called gender-affirming care. The problem if gender dysphoria is genuine and not internet-meme-induced, it can't be removed by pills or even conversion therapy(a method moids use to try to fix lesbians btw). You surely can detrans some of them with fake dysphoria but not everyone. Unless I'm missing something"
   },
   "reply_274834": {
      "reply id": "274834",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 03:51:12 AM",
      "post content": ">>274832idk I have a theory that if you gave them their own sex hormones instead of cross-sex hormones they might detrans. But this theory has never been tested because they call it conversion therapy."
   },
   "reply_274847": {
      "reply id": "274847",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 11:55:04 AM",
      "post content": ">>274834Their own body was already giving them their own sex hormones, so I don't get how this would work, the purpose of hormones is just to get corresponding sex characteristics so they wouldn't feel bad. This sounds similar when moids say to lesbians that they should have more sex with men to fix their sexuality."
   },
   "reply_274856": {
      "reply id": "274856",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 07:22:44 PM",
      "post content": "Rule 41: if it exists, troons have already ruined it."
   },
   "reply_274859": {
      "reply id": "274859",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 08:43:34 PM",
      "post content": ">>274832Pretty sure there actually were trials for drugs that would directly treat the dysphoria that seemed to be fairly effective at removing the dysphoria specifically, but the studies were small in scale and ultimately got defunded for being transphobic once trans became a legitimate identity to the average normie. I forget what it was called though so fair enough if I'm wrong about that. >>274834This has also been tried with somewhat promising results."
   },
   "reply_274860": {
      "reply id": "274860",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 08:49:10 PM",
      "post content": ">>274859Just wanted to add that half the problem now is that people CAN'T look into medical fixes for dysphoria because of the political implications. Finding funding for it is impossible and even if you did, it'd be defunded after a while due to the controversial nature of the research.If you don't endlessly reinforce these peoples' delusions you get unpersoned, even in scientific circles."
   },
   "reply_274865": {
      "reply id": "274865",
      "username": "Anonymous",
      "date posted": "07/12/24 (Fri) 10:42:55 PM",
      "post content": ">>274859> Pretty sure there actually were trials for drugs that would directly treat the dysphoria that seemed to be fairly effective at removing the dysphoria specificallycan you give any links about this?>>274860>people CAN'T look into medical fixes for dysphoria because of the political implicationsit still can be researched like in china and russia without any political implications, but they're not doing this"
   },
   "reply_274867": {
      "reply id": "274867",
      "username": "Anonymous",
      "date posted": "07/13/24 (Sat) 01:52:20 AM",
      "post content": ">weird fetish post on the front page of reddit… must be a tranny>checks user history>yep“Actual lesbians” lol"
   },
   "reply_274894": {
      "reply id": "274894",
      "username": "Anonymous",
      "date posted": "07/13/24 (Sat) 07:52:13 PM",
      "post content": ">>274865>>274865>it still can be researched like in china and russia without any political implications, but they're not doing thisAt least in the case of China they make it illegal to be too feminine as a man and have straight up jailed men for being crossdressers online, so I don't know that they have any interest in a serious or normal approach to the issue."
   },
   "reply_274899": {
      "reply id": "274899",
      "username": "Anonymous",
      "date posted": "07/13/24 (Sat) 10:07:13 PM",
      "post content": ">>272037And that's even though women make for better programmers than men. It's just that most of us understandably don't like to punish ourselves even more by suffering overtly hostile (male dominated) environments."
   },
   "reply_274901": {
      "reply id": "274901",
      "username": "Anonymous",
      "date posted": "07/13/24 (Sat) 10:59:04 PM",
      "post content": ">>272792Dear Lior,  …no"
   },
   "reply_274902": {
      "reply id": "274902",
      "username": "Anonymous",
      "date posted": "07/13/24 (Sat) 11:03:18 PM",
      "post content": ">>273288no amount of makeup can cover up those predator eyes he triggered my fight or flight response"
   },
   "reply_274909": {
      "reply id": "274909",
      "username": "Anonymous",
      "date posted": "07/14/24 (Sun) 03:33:48 AM",
      "post content": ">>274127Why, thank you, Moid William Golding"
   },
   "reply_274995": {
      "reply id": "274995",
      "username": "Anonymous",
      "date posted": "07/14/24 (Sun) 08:53:11 PM",
      "post content": ">>274902>Implying you can tellOkay bigot, whatever you have to tell yourself to sleep at night ;) if you sincerely think you can tell which person is trans by an image alone, the only person you're fooling is YOURSELF.Look at this one, not so easy is it HUH? Bet you can't even tell which one is trans… CIS pig…"
   },
   "reply_275010": {
      "reply id": "275010",
      "username": "Anonymous",
      "date posted": "07/15/24 (Mon) 01:22:01 AM",
      "post content": ">>274995\"red carpet girl mode :3\""
   },
   "reply_275035": {
      "reply id": "275035",
      "username": "Anonymous",
      "date posted": "07/15/24 (Mon) 01:33:39 PM",
      "post content": ""
   },
   "reply_275135": {
      "reply id": "275135",
      "username": "Anonymous",
      "date posted": "07/18/24 (Thu) 12:59:30 AM",
      "post content": "These threads have really slowed down lately. Wasn't too long ago where a thread would hit the bump limit in a reasonable timeframe, now they're lasting months and months every time."
   },
   "reply_275158": {
      "reply id": "275158",
      "username": "Anonymous",
      "date posted": "07/18/24 (Thu) 02:50:46 PM",
      "post content": ">>275135this place in itself has really slowed"
   },
   "reply_275159": {
      "reply id": "275159",
      "username": "Anonymous",
      "date posted": "07/18/24 (Thu) 02:54:37 PM",
      "post content": ">>275135Everyone that posted on here went to the lc one, it's faster.cc is dead in general."
   },
   "reply_275200": {
      "reply id": "275200",
      "username": "Anonymous",
      "date posted": "07/19/24 (Fri) 04:11:11 PM",
      "post content": ">>275199lolcow kek"
   },
   "reply_275324": {
      "reply id": "275324",
      "username": "Anonymous",
      "date posted": "07/22/24 (Mon) 08:11:06 AM",
      "post content": ">women go throu menopause>men don't"
   },
   "reply_275327": {
      "reply id": "275327",
      "username": "Anonymous",
      "date posted": "07/22/24 (Mon) 09:01:55 AM",
      "post content": ">>275324Mtfs are already masculine and hairy, so they will never \"age gracefully\"."
   },
   "reply_275345": {
      "reply id": "275345",
      "username": "Anonymous",
      "date posted": "07/22/24 (Mon) 02:57:55 PM",
      "post content": ">>272414I used to think they were only mentally ill but don't I see now; They are evil. Never forget it."
   },
   "reply_275417": {
      "reply id": "275417",
      "username": "Anonymous",
      "date posted": "07/24/24 (Wed) 05:48:46 AM",
      "post content": "just saw on reddit that the troon in Mr Beast group is a hentai lolicon gooner, a pedophile and shared revenge porn of a icarly girl, after years of people defending that he was a woman and should be respected… dude was actually a perv, disgusting man. I hope he become a %"
   },
   "reply_275428": {
      "reply id": "275428",
      "username": "Anonymous",
      "date posted": "07/24/24 (Wed) 10:03:38 AM",
      "post content": ">>275417He's been one for awhile, you could literally tell it was going to Troon out by what it's interests were.I've always been curious at how these things reach critical mass considering this was the norm for it from the start.And imagine being fabulously wealthy, having a family, a business you liked and still doing these things. These \"people\" are truly mentally ill."
   },
   "reply_275439": {
      "reply id": "275439",
      "username": "Anonymous",
      "date posted": "07/24/24 (Wed) 11:45:43 PM",
      "post content": ">>275159true kek i am a lolcow tourist coming to check out what terfy content cc can provide me. enjoying the discussion on the narc tranny mind, sad to see how slow the site is now"
   },
   "reply_275455": {
      "reply id": "275455",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 07:27:22 PM",
      "post content": ""
   },
   "reply_275456": {
      "reply id": "275456",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 08:03:10 PM",
      "post content": "sorry to interrupt the ongoing convo but,,, what made you guys turn to being terfs? i don't really view trans girls as women totally, but i don't care much about them generally. bathroom discourse is silly to me, i don't really care about them using the same bathroom as the rest of us. but, i do think that some radfem views are understandable."
   },
   "reply_275457": {
      "reply id": "275457",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 09:05:59 PM",
      "post content": ">>275456I ended up peaking after interacting with a transbian TIM. I'd moved to a new small town and tried to establish new friendships. On a local forum I gathered a group chat for \"young women wanting new female friends\". He tried to join that, but before accepting I asked the other women their opinion since the way he talked was a bit unstable. Turns out the women knew him.He had harassed them previously, acted a fool in other group chats and - most shockingly for me at the time - did not even try to look like a woman. Like the dude literally had a long beard and looked like he was unfamiliar with the concept of personal hygiene. Looking back it isn't surprising that he also was (a specific type of) a communist and autistic.Later on the same local forum I formed a meetup group for local lesbians. Guess who tried to join once again"
   },
   "reply_275458": {
      "reply id": "275458",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 09:22:13 PM",
      "post content": ">>275457did you meet chris chan?"
   },
   "reply_275459": {
      "reply id": "275459",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 09:41:06 PM",
      "post content": ">>275458Pretty much. Only visible difference between them is probably the fact that this TIM might be a bit more intelligent (using the term very lightly) since he did some of the harassment at uni before dropping out.On some level I feel bad for these individuals, but on the other hand I'm so done with being harassed by intellectually disabled males. Too bad we are not locking them up in institutions."
   },
   "reply_275461": {
      "reply id": "275461",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 09:52:24 PM",
      "post content": ">>275417>Did you know he's a pedophile that sexually harasses women with revenge porn, masturbates to lolicon and has a porn addiction?Well you did say he was a tranny so I kinda just assumed most of that anyways"
   },
   "reply_275463": {
      "reply id": "275463",
      "username": "Anonymous",
      "date posted": "07/25/24 (Thu) 09:58:59 PM",
      "post content": ">>275457This is pretty common. The people that are most pro-trans only seem to encounter them online where they're seeing the 3 of them that can present well and behave normally enough on camera to not be viscerally disgusting, but what turns people is when they meet one in real life or see one in a sports match. Once they're forced to actually witness the undeniable differences it's hard to go back."
   },
   "reply_275469": {
      "reply id": "275469",
      "username": "Anonymous",
      "date posted": "07/26/24 (Fri) 02:14:31 AM",
      "post content": ">>275463true. i was trans myself until a male close to me turned trans and i saw how they only did it to \"trans-max\" because they couldn't get a boyfriend as a male and coveted straight men. i saw how he was still a misogynistic person, believing being a woman was a set of regressive stereotypes, he didn't even view women as full people, and loving that he was no longer a ciswhiteman. once you can analyse the psychology up close of these people (aka be abused be a narcissist) you peak pretty quick."
   },
   "reply_275677": {
      "reply id": "275677",
      "username": "Anonymous",
      "date posted": "07/30/24 (Tue) 03:13:17 PM",
      "post content": "I was reading a thread where someone asked \"Would you rather be an attractive transwoman or an ugly cis woman?\" And the answers were like 80% in favor of being a pretty transwoman.Then I remember reading a different thread where trannies were making fun of Older women, saying how they look worse than young transwomen. of course this is silly because you're comparing two different age groups, and trannies only look good in photos. But it still confused me. Isn't being a woman what they want? I mean you can either be a woman or not be a woman and they choose to not be a woman in exchange for being pretty/youthful. Is it more that trannies want to be Young and cute and not necessarily women? sometimes I wonder if this is all an age-regression fixation. Like trannies associate being a woman with being youthful and baby-like, and that is what they really want, to not grow up, to deal with whatever trauma that makes them hate growing older. You also see them really focus on what they call \"male-aging\" which I'm not sure is different than \"female-aging\"? Like women and men both age, and maybe they age at different rates but it's not as if a man who takes estrogen will not age. If you're taking estrogen and you look like a man at 20, why would you not look like a man at 50? over and over I see it. Nobody wants to be older but trannies REALLY hate it. Puberty Blockers are a big issue with them, but is it not because they want to avoid becoming more masculine but they perceive puberty as the gateway between \"youth\" and \"adulthood\" and they wish to stop it to avoid becoming an adult? You see it again with the diaper fetish. The bimbo fetish also has elements of youth fetishization. The bimbo wants to be \"Dumb\", that is to have no responsibilities, to be taken care of, to be a child, in essence. I want to go back to the puberty thing because it's so fascinating to me. I've heard them talk about something called \"Second male puberty\"? What the hell is that? Human beings only have 1 puberty. But I think it comes down to not wanting to be \"fully-grown\". As long as there's another developmental milestone ahead of them they can say they're not an adult, they're still young.And note you see all this as well in FtMs!!! They want to be Young twinks, not adult men. Young young young. Is it all just peter pan syndrome?"
   },
   "reply_275679": {
      "reply id": "275679",
      "username": "Anonymous",
      "date posted": "07/30/24 (Tue) 04:43:01 PM",
      "post content": ">>275677I think part of it is just that they know they wont age like the gender they want to be. Old trannies are a miserable sight. You can get away with a certain level of androgyny when you're young, but time takes its toll. \"Passing\" trannies are already basically unicorns, but trannies that \"pass\" above a certain age are on another level of rarity.Though it's worth noting virtually all the data we have (and also basic common sense…) shows extreme overlap between tranny brains and people with all kinds of mental illnesses, so I don't doubt there's an autistic obsession with youth as well. ESPECIALLY since virtually everyone that develops this desire to transition has been molested (ie, had their youth stolen) as kids."
   },
   "reply_275685": {
      "reply id": "275685",
      "username": "Anonymous",
      "date posted": "07/30/24 (Tue) 09:27:49 PM",
      "post content": ""
   },
   "reply_275695": {
      "reply id": "275695",
      "username": "Anonymous",
      "date posted": "07/31/24 (Wed) 12:23:58 AM",
      "post content": ">>275677Many of them choose to transition with the belief that they will become more attractive (HSTS aim to attract straight men, while most AGPs are \"former\" incels who fell for the transmaxxing meme). Younger people are more attractive than older people, which leads to the goal of looking as young as possible for trannies. Not to mention that most AGPs are pedophiles, but I think everyone knows that."
   },
   "reply_275742": {
      "reply id": "275742",
      "username": "Anonymous",
      "date posted": "08/01/24 (Thu) 03:43:39 AM",
      "post content": ">>275677“attractive transwoman” is an oxymoron 💀"
   },
   "reply_275763": {
      "reply id": "275763",
      "username": "Anonymous",
      "date posted": "08/01/24 (Thu) 07:05:11 PM",
      "post content": ">>275677> trannies only look good in photos. hunter schafer is seen as the like paragon of a passing tranny and in every pic of him on google he looks like a tall white dude - the masculine, beady eyes, sharp male jaw, rectangular body etc. even blair white doesn't pass. they're masculine looking down to their brick-like forearms. I never realized how much grace the natural female body had until I saw these mentally ill men try to emulate them."
   },
   "reply_275764": {
      "reply id": "275764",
      "username": "Anonymous",
      "date posted": "08/01/24 (Thu) 07:09:42 PM",
      "post content": "nothing says “i’m a real woman guys for real” quite like defending dog porn on a subreddit dedicated towards deplatforming violence against women, admitting you participate in unnamed “taboo” paraphilias (taboo often = illegal), and then further antagonizing the woman who posted it to begin with.they’re getting too hard to clock these days, ladies. it might be over for us."
   },
   "reply_275767": {
      "reply id": "275767",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 12:02:38 AM",
      "post content": "gotta rant. there's this trans-identifying woman i keep coming across thanks to mutuals that i can't stand.  bad enough that she's sexist (calls herself a man), homophobic (calls herself a fag), and dresses like a suicide girl with a pube beard (i think she's imitating postal dude this month?), but her art SUCKS.  it's the same \"man's\" face and hands in the same 3-4 poses over and over, just decorated differently to show it's supposed to be different characters.  and her composition is ass so she usually just puts a red circle behind his head and calls it a day.  she seems to get a lot of attention from other fujoshi who also call themselves gay men.anyway i learned today that she has a twin sister! who also pretends to be a gay man and dresses the same way!  how much of a FAILURE of a parent do you have to be to have your daughters turn out that way??  i'd imagine both parents were ultra conservatives who hammered in that girls' place in life were to be pretty incubators.  well gosh, i wonder why they didn't want to be called women /s i'd be rooting for them as weird but cool gnc women if they did all the same things but admitted they were women."
   },
   "reply_275768": {
      "reply id": "275768",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 12:24:49 AM",
      "post content": ">>275762Anon this is a bio woman with high testosterone. She competed in the 2020 Tokyo Olympics and lost, Kellie Harrington wiped the floor with her. If she was a moid, she would’ve destroyed Kellie, and every other female boxer. Pls don’t be retarded and listen to moid rumors"
   },
   "reply_275769": {
      "reply id": "275769",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 01:00:23 AM",
      "post content": ">>275768Post proof or 41%"
   },
   "reply_275770": {
      "reply id": "275770",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 01:24:15 AM",
      "post content": ">>275769Even an amateur moid boxer has a significant advantage against a female professional boxer. Do you think a moid would lose 5-0 with a female boxer while they’re at the same professional level? Use your brain."
   },
   "reply_275772": {
      "reply id": "275772",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 02:35:13 AM",
      "post content": ">>275770Kek. He looks like a faggot, so I absolutely believe a faggot moid with faggot arms could lose against a woman, yes.>Aggressively and manipulatively shills against antitranny sentiment that no else on this site gives a fuck aboutWhy is your type always this obvious? 41% it is."
   },
   "reply_275773": {
      "reply id": "275773",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 03:00:02 AM",
      "post content": ">>275772there's a certain irony in telling people to provide proof and then telling them to kill themselves when they do lol, least obvious moid post"
   },
   "reply_275775": {
      "reply id": "275775",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 03:57:12 AM",
      "post content": ">>275772>”post proof or kys”>posts proof>”I don’t believe you, kys” Can you at least pretend to be a woman when you’re on this site? Nobody here is defending trannies, I just don’t like when ugly bio women get caught up in tranny bullshit."
   },
   "reply_275777": {
      "reply id": "275777",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 04:04:31 AM",
      "post content": ">>275776Do you happen to live in socal? Wanna hook up?"
   },
   "reply_275778": {
      "reply id": "275778",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 04:07:36 AM",
      "post content": ">>275777maybe"
   },
   "reply_275779": {
      "reply id": "275779",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 05:26:26 AM",
      "post content": ">>275776Difference between an ftm and a radfem is six months.Difference between a radfem and an ftm is also six months.The existence of dimorphic sexes in an intelligent species is almost proof of god, because it's hard to believe that something that cruel and evil could happen by chance."
   },
   "reply_275784": {
      "reply id": "275784",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 08:56:10 AM",
      "post content": "Question, what decides ones sex,their genitals at birth or their chromosomes?Are these people women or not?>born with XX chromosomes.>born with a penis and testicles.>can't produce sperm.>over all, look like moids.https://en.wikipedia.org/wiki/XX_male_syndrome"
   },
   "reply_275804": {
      "reply id": "275804",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 09:10:20 PM",
      "post content": ">>275773>Posts \"proof\">Debunks proof>Uhh it's ironic you tell me to 41% after I posted proof though!!Why do you troons have to infest this site?>>275775He was found to have XY chromosomes after he failed entry into the olympics in 2023. It's either a tranny or an intersex male.https://www.politico.eu/article/culture-war-women-boxing-angela-carini-olympics-imane-khalif-testosterone-giorgia-meloni/"
   },
   "reply_275809": {
      "reply id": "275809",
      "username": "Anonymous",
      "date posted": "08/03/24 (Sat) 02:00:33 AM",
      "post content": ">>275784personally i have no real opinion about intersex people other than that i hate it when people use them to make transgenderism seem more valid. the two really don't have much to do with eachother."
   },
   "reply_275844": {
      "reply id": "275844",
      "username": "Anonymous",
      "date posted": "08/04/24 (Sun) 04:38:22 AM",
      "post content": ">>275768It means that even with that fucking advantage she has she is still shit lmaoAngela was right to ditch.That was no fair fight."
   },
   "reply_275900": {
      "reply id": "275900",
      "username": "Anonymous",
      "date posted": "08/05/24 (Mon) 04:43:09 AM",
      "post content": ""
   },
   "reply_275931": {
      "reply id": "275931",
      "username": "Anonymous",
      "date posted": "08/05/24 (Mon) 11:30:47 PM",
      "post content": ">>275900Jumpscare warning"
   },
   "reply_276162": {
      "reply id": "276162",
      "username": "Anonymous",
      "date posted": "08/14/24 (Wed) 03:11:20 PM",
      "post content": ">>275763>never realized how much grace the natural female body had until I saw these mentally ill men try to emulateThat is such a good observationFor a long time I felt lacking in grace and femininity. And even though everyone would tell me otherwise I found it hard to believe because my brain apparently chose to compare my body to drawn illustrations of women or instagram type models. But what actually helped alleviate my body dysmorphia is seeing the grotesqueness of TIMs. That shit really reset my brain lmao"
   },
   "reply_276172": {
      "reply id": "276172",
      "username": "Anonymous",
      "date posted": "08/15/24 (Thu) 01:00:40 PM",
      "post content": ">>276162> But what actually helped alleviate my body dysmorphia is seeing the grotesqueness of TIMsBruh you just found the first real purpose for TIMs"
   },
   "reply_276299": {
      "reply id": "276299",
      "username": "Anonymous",
      "date posted": "08/20/24 (Tue) 06:26:50 AM",
      "post content": ">>273665Would be pretty based if she only cracked games that put tranny shit in"
   },
   "reply_276300": {
      "reply id": "276300",
      "username": "Anonymous",
      "date posted": "08/20/24 (Tue) 06:35:45 AM",
      "post content": ">>274894Jail might actually be an effective treatment. You don't get to be a retard, say stupid things to people, or get anime/internet/discord in jail."
   },
   "reply_276301": {
      "reply id": "276301",
      "username": "Anonymous",
      "date posted": "08/20/24 (Tue) 06:37:33 AM",
      "post content": ">>275010Omfg look at them big ass hands around the tiny little phone. He needs an ipad mini for the same effect"
   },
   "reply_276307": {
      "reply id": "276307",
      "username": "Anonymous",
      "date posted": "08/20/24 (Tue) 04:27:48 PM",
      "post content": ">>275456That troon up in Canada that got a women's rape crisis center closed down because they were women only. Then I learned my home state of California allowed men in women's prison since the 'civil rights' bill passed which includes gender identity. in 2022, 39 men were approved to be sent to a women's jail. Men are allowed in women's changing rooms, gym showers, and other places a woman or girl could be vulnerable and alone. I don't want these predators anywhere near a woman where she could easily be assaulted."
   },
   "reply_276374": {
      "reply id": "276374",
      "username": "Anonymous",
      "date posted": "08/22/24 (Thu) 02:39:27 PM",
      "post content": ">>275345I think about this post often. I think everyone should see this rant at least once in their life, it verbalizes all the thoughts I have"
   },
   "reply_276384": {
      "reply id": "276384",
      "username": "Anonymous",
      "date posted": "08/22/24 (Thu) 08:41:39 PM",
      "post content": "test or whatever"
   },
   "reply_276385": {
      "reply id": "276385",
      "username": "Anonymous",
      "date posted": "08/22/24 (Thu) 08:50:17 PM",
      "post content": ">>275804>Found to have XY chromosomesYup, this is the only \"proof\" we have so far, and it's pretty solid. It has never been refuted, no counterarguments against it. No proof that it's a female, whereas the available proof we have says intersex or male.>>275768And now he won the gold. Not just anyone can win the gold, what are the odds that someone who failed a gender test before and was found to have XY chromosomes happens to be the best in the world, beating all other competitiors?50% of the population is female. Less than 1% of the population would have this one particular intersex trait that would actually help them win an olympic level boxing competition. People accuse him of having the trait, his chromosomes are checked, he goes on to win the gold. The odds are just so astronomically low that everyone is lying and it's a biological female.In fact, it's MUCH more suspicious that he was losing all previous competitions with 5-0's and getting stomped but suddenly gets accused of being a man, the IOC now takes over with their looser rules, and suddenly he wins."
   },
   "reply_276386": {
      "reply id": "276386",
      "username": "Anonymous",
      "date posted": "08/22/24 (Thu) 09:56:56 PM",
      "post content": ">>270972Close but the word they're looking for is \"misandry\", you can't be misogynistic towards males."
   },
   "reply_276387": {
      "reply id": "276387",
      "username": "Anonymous",
      "date posted": "08/22/24 (Thu) 10:07:58 PM",
      "post content": ">>272041>>272039Most autists do NOT have high IQ, they typically have depressed IQ somewhere around 85 (though it varies greatly.) It's only extreme fringe cases where one of them has \"high IQ\", so fringe that it's 1 in every 100 at most.The reality is that it's just about socialization, it's a job where you don't talk to anyone and just do little things in your head all day, and it's a stereotype that they shill to each other. Trannies have grown up online and their population has exploded thanks to all this new tech, they go from their tech echo chamber that makes them a tranny in the first place into another tech echo chamber.No, the intelligent ones are hardly ever out there. It's autism, and usually the negative form of it. Those pictures you see here of trannies posted are the average, and they are not intelligent. That's the main reason so many of them lack self-awareness, they're functionally retarded and literally cannot understand that as an abstract concept. You're most likely to find the intelligent ones in pro gaming or speedrunning (male hobbies btw), and even then they're so rare that you can only name a handful of them, they're just VERY loud."
   },
   "reply_276388": {
      "reply id": "276388",
      "username": "Anonymous",
      "date posted": "08/22/24 (Thu) 10:23:25 PM",
      "post content": ">>274809>and while it only feels mildly painful, I bleed a lot for the next three days>While this might be affirming, it's awful to deal with>I have to wear padsHuh? Did he just want the \"period\" to affirm himself but without the bleeding or the pads? I don't get it. And yes, some woman's periods are just like that, usually periods happen because a woman is just pushing a hard piece of silicone inside of her and bleeding to keep her pussy open. You go girl!"
   },
   "reply_276394": {
      "reply id": "276394",
      "username": "Anonymous",
      "date posted": "08/23/24 (Fri) 03:59:08 AM",
      "post content": "How are Aus s handling the Tickle vs Giggle outcome today? The court ruled that Roxy Tickle, a  transwoman whose primary motivation for transitioning was so he could use the women's hockey team's changing rooms, has the right to use a female-only app because of his \"gender\". Sall Grover raised over $500,000 to be told that sex isn't real. Thanks, Gillard."
   },
   "reply_276442": {
      "reply id": "276442",
      "username": "Anonymous",
      "date posted": "08/24/24 (Sat) 12:46:34 AM",
      "post content": ">>276394Just more insanity, Aus is a nanny state bordering on police state (see UK for the future of Aus). The logical next in being unable to discrimate based on sex is for non trans males to be able to join women-only spaces and jerk off their disgusting moid dicks in women's toilets"
   },
   "reply_276465": {
      "reply id": "276465",
      "username": "Anonymous",
      "date posted": "08/24/24 (Sat) 10:06:08 AM",
      "post content": ">>276442I don't know about the rest of Australia but in Victoria all new public toilets are unisex, so any outrage at men jerking off will be met with a shrug from the politicians who designed this. Just moid things."
   },
   "reply_276549": {
      "reply id": "276549",
      "username": "Anonymous",
      "date posted": "08/26/24 (Mon) 10:08:20 AM",
      "post content": "I hate all moids no matter what if they wear a dress or not. Trannies are just the latest weapon to kill women. Crush all moid skulls with stones"
   },
   "reply_276567": {
      "reply id": "276567",
      "username": "Anonymous",
      "date posted": "08/26/24 (Mon) 06:23:45 PM",
      "post content": ">>276465>All new public toilets are unisexIt's completely ridiculous too, unisex toilets make sense for small businesses. What happens when you're at any large business where they actually NEED to have a large amount of toilets?Oops, get fucked, haha, now every toilet has to be its own separate room, raising the cost of construction 2-3 times higher than normal. Now the guy cleaning can't just mop the floor and change the garbage, he has to mop 10 floors and change 10 garbages.Short-term you can sort of justify it by saying that they're big businesses and they can afford to make a few more discrete shitting rooms, long-term it just means the janny now has to take care of 8 times the number of restrooms, so you can expect everything to be covered in piss and shit. Discrete rooms? More like places where people will smoke and shoot up and fuck. Bored men will jack off in their completely private rooms. Alcoholics will get drunk. There will literally be piss all over the floor because the janitor now has to do several times the amount of work."
   },
   "reply_276573": {
      "reply id": "276573",
      "username": "Anonymous",
      "date posted": "08/27/24 (Tue) 02:05:11 AM",
      "post content": ">>272414Poetry, anon."
   },
   "reply_276610": {
      "reply id": "276610",
      "username": "Anonymous",
      "date posted": "08/27/24 (Tue) 08:18:03 AM",
      "post content": ">>276567I'm very concerned about how easy it is to film women in unisex toilets."
   },
   "reply_281805": {
      "reply id": "281805",
      "username": "Anonymous",
      "date posted": "08/31/24 (Sat) 12:19:55 PM",
      "post content": "Fuck off, Ms Honey does not deserve this."
   },
   "reply_281913": {
      "reply id": "281913",
      "username": "Anonymous",
      "date posted": "08/31/24 (Sat) 02:17:47 PM",
      "post content": ">>281805>even trying to achieve the looks and natural charm of ms honeyScrotes are insane"
   },
   "reply_286907": {
      "reply id": "286907",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 04:32:06 AM",
      "post content": "I’m reading the tranifesto and im actually surprised theres nothing interesting about this. Theres like 20 more volumes we’ll never get to see, that prob has the good stuff. If you guessed self-hatred, autism, penis envy, and job hunting on turbo autism + art major difficulty = lmao…you were right.  Her raging at boomerdad was a little funny, i’m sure he said all the boomer lines when she was job hunting. It’s on the Tennessee Star website but you have to put in an email and then they send  you a link."
   },
   "reply_286916": {
      "reply id": "286916",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 04:53:18 AM",
      "post content": ">>286907Any ideas about why the police officer said it kept him up at night?"
   },
   "reply_286940": {
      "reply id": "286940",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 05:41:45 AM",
      "post content": "Has it ever occured to trannies that becoming trans only raises their expectations to levels they will never achieve and this is what causes a lot of them to either kill themselves or detransition, and that they'd be much happier if they just accepted their actual selves and not an idealized fantasy genderbent 'sona they made up?>>272579>not saying that transitioning is wrongwho let this retard in"
   },
   "reply_286944": {
      "reply id": "286944",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 05:49:48 AM",
      "post content": "I found a \"passing\" TiM for first time in my life, that I legit wasn't able to tell and only learn about it because a mutual told me. I wonder how does he do it, is this what people call \"intersex\"? Because I can't explain how a moid could remotely look or sound female"
   },
   "reply_286973": {
      "reply id": "286973",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 07:04:10 AM",
      "post content": ">>286916He was probably up all night trying to find “paige”, a big booty brown girl MC was obsessed with."
   },
   "reply_287249": {
      "reply id": "287249",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 04:31:59 PM",
      "post content": ">>286907Some other good ones I found: ok, this one was funny. she called her dad a faggot for loving the cats (and not loving her, aww). She mentioned wanting to kill her dad too, I wonder if he knew he narrowly avoided a bad end.Her mom wanting Audrey to be a perfect daughter. They seemed to not believe in the tranny nonsense about changing your…sex?Being a pornpilled coomer and wanting to basially destroy a brown girls asshole, she mentioned anal sex twice; going slow in the vagina and then pounding the ass. Is she aware that doesn't feel good? i mean, i never did it. does it feel good?But yeah, the cop had to be new for this to disturb him. There was a lot of 'boohoo i want to die'. I expected to see a lot more white hatred and more things about the church, like a molesting, but it just wasnt there. I think she killed kids just to feel important and targeted kids because kids are innocent and have unlimited potential. People feel worse when kids are hurt, making her even more infamous. She should have just sperged out online and had the potential to become the girl chris-chan lolcow. Her art was about as shitty as his. yes, I grew up on imageboards but I don't enjoy seeing trainwrecks or disgusting things online. The surpreme gentleman's manifesto was way more interesting."
   },
   "reply_287258": {
      "reply id": "287258",
      "username": "Anonymous",
      "date posted": "09/04/24 (Wed) 04:38:52 PM",
      "post content": ">>272039where is this narrative coming from where all autists are suddenly genius? have we all forgotten that autism is a neurological disability? that the vast majority of autists cannot care for themselves, nor talk to begin with? high functioning autists really do seem to believe their own autistism is what everyone autistic goes through."
   },
   "reply_287685": {
      "reply id": "287685",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 02:14:42 AM",
      "post content": "I think that the psychoanalysis take on trannies is the correct way of thinking about this (or it might be some other field of psychology, I can't remember). Essentially, it's misguided personality exploration. If you're brought up in a household with common sense, you're taught by your parents that people are different EVEN within the confines of their sex, and so you're free to explore your different sides (animus for women, anima for men) and maybe even integrate them into your personality in order to become a more complete person. But if a boy is born into a household where the parents promote very rigid gender roles (\"girls should play with dolls, boys should play with cars\") and this boy is being shamed for being too feminine, then later in life he's going to believe that \"I'm a feminine person, therefore I was born into the wrong body and really I'm a female\" while the healthy adult man realizes \"I'm a guy with a feminine personality, this gives me strengths like greater empathy and people-knowledge\". The latter way of thinking is more nuanced, while the former way is more black-and-white which is why autism is such a prominent comorbidity for trannies.Obviously in most societies, this self-introspective dissonance (maybe I am a woman after all…?) is no issue, but it DOES become an issue in a society like ours where we're so technologically advanced that HRT is a thing, and we've given the individual such a huge autonomy over their own life. There's obviously no \"bully culture\" anymore either, for better or for worse.The reason why gender exploration as a child is a-ok but gender exploration as an adult is dangerous is because the latter becomes sexual in nature, meaning it becomes hedonistic, and at that point we have a problem. Also, besides being fucking gross, transitioning implies sterilization, which is problematic if you want the species to continue on living. It also seems to generate extreme depression.It's a shame that this perspective is never being brought to light. I think it could fix the tranny epidemic. Sidenode - I think it's very funny that Monty Python of all people either consciously or unconsciously saw the link between \"unhealthy personality/gender stereotypes → transitioning\" as evident by The Lumberjack Song, several decades before the epidemic broke out."
   },
   "reply_287718": {
      "reply id": "287718",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 03:00:12 AM",
      "post content": "Replace the word \"more\" with \"less\" and I agree with this post entirely.  I want to see less hairy tits and top surgery scars, less \"pregnant dads\", less romanticization of phalloplasty, less transmasculinity in every piece of media that supposedly failed to consider these people, and definitely way less jumping headfirst into masculinizing transitions.  This shit is definitely not a fundamental force of nature and truth of life etc etc."
   },
   "reply_287746": {
      "reply id": "287746",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 03:20:17 AM",
      "post content": "Posting an oldie but a goldie"
   },
   "reply_287849": {
      "reply id": "287849",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 07:37:57 AM",
      "post content": ">>287685>It also seems to generate extreme depression.This isn't talked about nearly enough. The only time I've ever seen it mentioned is in some lc thread or gendercrit blog post, which had many examples of Reddit Aidens on the FtM subreddit asking if it's normal to feel like shit and hate your body even more after \"coming out as trans\".The obvious reason for the high rates of depression and suicide (at least in pre-transition trannies, since the side effects of HRT and surgery seem to be even bigger reasons) is that being trans means inducing severe self-hatred and body dysmorphia.When you start thinking that maybe you were meant to have a body of the opposite sex, or that you'd like to have that body because you think it'll be better, and other people encourage this idea and tell you that you can actually become the opposite sex, what happens is that you start to look at your own body as trash, and your ideal body as your ultimate goal. And after you set that goal for yourself, thinking that your current body and self are not the real you, you start to compare yourself to actual men/women and start to notice things about your behavior and appearance that you had never cared about before becoming trans. This is what those FtM posts were about, and the others told them it's completely normal, and to try to ignore these new feelings of discomfort, because feeling like this is good, actually.The way you walk, the way you sound, your height, your hands, etc. None of those were such a massive problem before you started to believe you're actually a man; the worst part is that you can't do much, if anything, about it, because most of those things are innate and impossible to change, let along change them in a way that you like. Becoming trans intensifies your insecurities and gives you even more things to be insecure and anxious about; it makes you hate yourself, your actual self, more than ever before, contrary to tranny claims that it's about \"accepting and loving yourself\". You learn to reject and hate your actual self and to seek something you'll never achieve.And when you start to transition, the more you try to \"change sex\", the more you realize it's futile. You will never be able to be a person of the opposite sex. And then, for the more stubborn who keep going despite it all, after all the hormones and surgery, your whole body is in pain, collapsing even, and it all comes crashing down upon you.It's no wonder it generates extreme depression, as you said. We can't have it all in life, having opposite sex genitals is just one of the infinite things all of us have to live with, it shouldn't be a big deal. Not wanting to accept that reality speaks of a childish, stunted mindset. Plenty of \"cis\" people have to live with the fact that they'll never be very tall or very short; surgeries exist, and the results are extremely shitty because you simply cannot transform a developed body like that. I wanted to be a natural blue-eyed blonde in my childhood, but as I grew up I had to accept my black hair and eyes, just like everyone else has to accept things about their physical reality that they didn't like at first. Trannies should just stop fixating on their impossible \"goals\", AKA stop being trannies, and instead they should learn to accept themselves and live with the fact that they'll never be something else that they physically are not and cannot be, also deal with their actual issues while they're at it. This would stop them from being so miserable."
   },
   "reply_288260": {
      "reply id": "288260",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 05:08:31 PM",
      "post content": "No amount of women saying “I hate men” will ever compare to the way men hate us."
   },
   "reply_288269": {
      "reply id": "288269",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 05:12:30 PM",
      "post content": ">>286907it's also all in her thread on the other farms. spoiler for crudely drawn cock in ass"
   },
   "reply_288331": {
      "reply id": "288331",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 05:42:06 PM",
      "post content": ">>288260why the fuck does this shit happen so often in these shithole countries? It's either India, Middle East, or Africa. Although, I guess in western countries, its still fairly common to have family annihilators and what not but I'd rather die from a gunshot to the head than get splashed by acid and all the weird shit these shithole country moids do."
   },
   "reply_288371": {
      "reply id": "288371",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 06:10:15 PM",
      "post content": ">>288269Damn I could have saved her,s he's not even unfortunate lookingI'd be willing to suck on the strap and pretends it's a dick if that's what she wanted I swear to god"
   },
   "reply_288503": {
      "reply id": "288503",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 07:52:55 PM",
      "post content": ">>288269This is hilarious"
   },
   "reply_288667": {
      "reply id": "288667",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 09:47:18 PM",
      "post content": ">>288260>Daughter who didn't want to be named tries to help her>Gets attacked>>288331I thought Kenya was one of the safest places in Africa but they list it happening to two more runners."
   },
   "reply_288673": {
      "reply id": "288673",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 09:53:06 PM",
      "post content": ">>288371please love yourself nona.. you're talking about a 28 year old retarded ugly woman who killed 3 children. besides, she wouldn't want you to suck on her strap, she only wants to fuck black girls in the ass. she wouldn't go near your pussy because female genitalia is yucky and probably dysphoria-inducing for her or something. if you're fine with being sodomised by an ugly retard then uh.. i'd say go for it but she's already dead"
   },
   "reply_288675": {
      "reply id": "288675",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 09:55:05 PM",
      "post content": ">>288269kek"
   },
   "reply_288718": {
      "reply id": "288718",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 10:38:39 PM",
      "post content": ">>288269>too bad i am a sad boy born with a very puny vagina….EVerYth1NG hUR7s yeah so would getting fucked in the ass by that goofy ass cock"
   },
   "reply_288723": {
      "reply id": "288723",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 10:44:58 PM",
      "post content": ">>288269It feels like she saw interracial anal pornography when she was too young, the obsession with dark skinned women and anal sex is so weird."
   },
   "reply_289193": {
      "reply id": "289193",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 06:23:13 AM",
      "post content": ">>288269She was probably pornsick since childhood"
   },
   "reply_289505": {
      "reply id": "289505",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 03:03:16 PM",
      "post content": "It's so fucking frustrating trying to talk to other feminists sometimes about trans topics, especially large group conversations. \"I don't want this discussion to devolve into a hate filled circlejerk!\" well I DO and I'm fucking pissed and I need a space where we can rage out and talk about how horrible this shit is and how we've been harmed by it. Hearing lesfems say this in particular is jarring. Aren't you fucking mad? Who cares about optics. Let's have a discussion slot where we just say slurs for an hour, who gives a fuck? Why does every damn thing we post have to be about outreach. \"We don't want to alienate any women who might ID as trans or have mixed feelings\" I literally don't fucking care! They alienate themselves, for us, every day! They can't even view our fandom blogs if we reblog a post about not liking dick, why do you think it will change anything if we say rude things among women who are majority like-minded anyway? It's even worse when it's not an exclusively radfem space. Some of us are just rude lesbians, sorry about it I guess."
   },
   "reply_289639": {
      "reply id": "289639",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 04:30:45 PM",
      "post content": ">>289505>a space where we can rage out and talk about how horrible this shit isExactly, it's so ironic that spaces created exactly for that purpose are the ones mostly filled with scrotes (for example the various lesbian subreddit), so jarring."
   },
   "reply_289687": {
      "reply id": "289687",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 05:10:45 PM",
      "post content": ">>289505The sheer amount of gold star genuine lesbians I've met who are diehard tranny supporters and drag race enjoyers. Sadly being a lesbian does not make you instantly based, even lesbians who agree with other aspects of feminism back off instantly when you bring up your anger about the trans shit. I've had my own lesbian cousin Not All Men me when I tried to talk about women's issues with her. Lesbians need to call 911 on themselves before it's too late kek"
   },
   "reply_289756": {
      "reply id": "289756",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 06:06:48 PM",
      "post content": ">>289687These are actually women who are gender critical, they just want to be nicefems about it and it drives me fucking crazy. They want to have a nuanced discussion about whatever the fuck, and that's great and all, but this is the only irl space I get and I just want to bitch about stuff."
   },
   "reply_289791": {
      "reply id": "289791",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 06:36:20 PM",
      "post content": ">>269991The OP image is funny because it reminds me of a story I've told on LC's 2X before (TRA friend has a man-hating dog, troon friend of hers visited and it was ridiculous seeing the excuses she made to hide that the dog was being super aggro bc it identified the troon as male).I have an update to that story.  Recently a different troon friend visited and I was shocked to hear that the dog was completely fine this time– in fact, it allegedly \"loved\" the troon.  A few days later, I hear something from a third friend present at this event that completes the story: the dog had been drugged this time, and actually turned super aggro towards the troon at the end of the visit as the drug wore off.  The extent to which TRAs will go to defend the fragile fake womanhood of troons is insane."
   },
   "reply_290754": {
      "reply id": "290754",
      "username": "Anonymous",
      "date posted": "09/07/24 (Sat) 07:21:06 AM",
      "post content": "I had to use Facebook today to find some news. Not even 5 minutes in and I had already witnessed a disgusting display of misogynistic \"humor\" in the comments getting triple the positive reactions that the woman he was replying to had. And below this piece of shit were two other tiny-dicked scrotes also being disgustingly, openly misogynistic to her for no reason other than she had the gall to worry about a kitten's health instead of laughing at le funny meme (she also got called a Karen, it seems \"Karen\" just means \"any woman that says something I don't approve of\" now).I reported the three of them to both Facebook and the group admins, but I doubt the latter give a shit, they would probably laugh along.How did we get to this point? Maybe it was this bad before and I didn't notice because I was a pickme? But it's as if any remotely meme-related community on Facebook has been completely taken over by misogynistic scrotes and their pickes who are free to reply to women's innocuous comments in the most hateful ways without anyone batting an eye. Why the fuck is the userbase on Facebook so intensely woman-hating? It's scary as fuck. I guess that'd explain why my ex, who suddenly started texting me last month, wanted to \"debate\" with me about feminism so bad. He's still using that shithole of a site.>>275784As I understand it, the terms \"male\" and \"female\" refer to the reproductive system. In the case of XX males, it seems that the second X chromosome erroneously receives an exclusively male/Y chromosome gene during the process in which genetic information is copied. So it's kinda like a mix of male and female characteristics, of which the most notable is male genitals. I would say this would make the person male, despite the chromosomes. The only thing cromosomes are supposed to do is dictate how the organism will develop, but sometimes chromosomes have the wrong genetic information, or some other kind of genetic accident happens, so they're not always an indicator of one's sex (in my opinion, since I consider genitals to be the determining factor for sex).But like the other anon said, none of this has to do with trannies, because trannies aren't about genetics, they're about feelings and dumb ideas about how people of either sex \"should\" behave. They are never intersex."
   },
   "reply_290783": {
      "reply id": "290783",
      "username": "Anonymous",
      "date posted": "09/07/24 (Sat) 08:20:16 AM",
      "post content": ">>287746well, he has to go to the hospital to get it taken out. thats almost like childbirth lmao. the doc can even sew up his ass at the end"
   },
   "reply_290826": {
      "reply id": "290826",
      "username": "Anonymous",
      "date posted": "09/07/24 (Sat) 10:22:06 AM",
      "post content": ">>289687I think gold stars are even more susceptible to this, because it's easier to be tolerant when you're not exposed to moid bullshit and just ignore them. My goldstar gf used to be like this (though not an avid supporter), but even she's starting to peak as she sees lesbian places being infiltrated and overtaken by troons as well as having to deal with scrotes at work."
   },
   "reply_291203": {
      "reply id": "291203",
      "username": "Anonymous",
      "date posted": "09/07/24 (Sat) 05:48:15 PM",
      "post content": ">>290826Once again, exposure and education only drives down support for troons"
   },
   "reply_291402": {
      "reply id": "291402",
      "username": "Anonymous",
      "date posted": "09/07/24 (Sat) 07:07:32 PM",
      "post content": ">>290826I've always been a goldstar and I've deeply hated troons since 2013 solely due to the fact that a man can't ever become a woman. No need to get \"exposed to moid bullshit\", just simple logic. Maybe women should stop being retarded?"
   },
   "reply_291781": {
      "reply id": "291781",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 12:27:52 AM",
      "post content": ">>286907link?"
   },
   "reply_291823": {
      "reply id": "291823",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 01:39:07 AM",
      "post content": ">>289687It's extremely disappointing when women (especially lesbians) defend men. I literally do not get it. I've been harassed by men all my life and saying \"I'm not into men/I'm a lesbian\" somehow made it worse. I will never defend men. They think trannies and fags are somehow less predatory than straight men, but we all know that isn't true."
   },
   "reply_291830": {
      "reply id": "291830",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 01:44:31 AM",
      "post content": ">>290754I feel bad for any woman named Karen. I've seen women just existing online get called Karen. It's evolved into just another slang for calling a woman i dont like a 'bitch.' I hate anyone who uses the name Karen to insult anyone. It's uncreative. >>291402Agree with you. It has nothing to do with being a gold star. I honestly hate that term. Just dont be a pick me retard. Men have never hid their true selfs. Look at crime statistics. It's easy to see men invading women only spaces like clubs, bathrooms, gyms or worse: lesbian bars."
   },
   "reply_291890": {
      "reply id": "291890",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 02:42:19 AM",
      "post content": ">>291823so unfortunate, i see many lesbians online saying that lesbians can like dick and that women can have penises. then i get called a terf for saying i dont want to date a MTF. now apparently FTM can be lesbian and they're called \"lesboys\" so retarded"
   },
   "reply_291928": {
      "reply id": "291928",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 03:16:46 AM",
      "post content": ">>286916The pointlessness of it. Like us, he was probably expecting an actual manifesto and not pornsick scribbles from a woman who played with stuffed toys. Why did she have to kill children?>>287258>Where is this narrative coming from where all autists are suddenly genius?Boymoms."
   },
   "reply_292116": {
      "reply id": "292116",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 07:42:22 AM",
      "post content": "One of my friends complained about an acquaintance. He is 27 years old and apparently wants kids but his girlfriend doesn't want any. I asked her how old his girlfriend was and she replied with 21. No shit sherlock ofc she doesn't want kids. Seriously men who have girlfriends that are more than 5 years younger give me the creeps. I also cannot help but side eye my male colleagues that are in their late twenties at office parties when they bring their gfs that are in their early twenties."
   },
   "reply_292257": {
      "reply id": "292257",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 12:22:02 PM",
      "post content": ">>292116Is the man a tranny? If not it's the wrong thread"
   },
   "reply_292261": {
      "reply id": "292261",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 12:28:56 PM",
      "post content": ">>292116every single one of them should just put the shotgun to their faces for intentionally choosing young naive women who wouldn’t put up with their shit if they were older as partners"
   },
   "reply_292301": {
      "reply id": "292301",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 01:41:59 PM",
      "post content": ">>291890>many lesbians online saying that lesbians can like dick and that women can have penisesA lot of bihets pretend to be lesbians so thats why you'd see retarded comments like those by \"lesbians\""
   },
   "reply_292510": {
      "reply id": "292510",
      "username": "Anonymous",
      "date posted": "09/08/24 (Sun) 05:22:42 PM",
      "post content": ">>292301This. If you actually go down the post history of women like that you will always find out they have/had a bf, they enjoyed sex with him, they lust after male celebs/characters and they got enlightened by the lesbian(bisexual) masterdoc. Every single time."
   },
   "reply_293007": {
      "reply id": "293007",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 12:29:59 AM",
      "post content": "Do you guys have any TERF YouTubers that you would recommend?"
   },
   "reply_293217": {
      "reply id": "293217",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 05:27:28 AM",
      "post content": ">>293007Hannah Berrelli on TikTok"
   },
   "reply_293221": {
      "reply id": "293221",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 05:32:50 AM",
      "post content": ">>292510My controversial opinion is that if there wasn't the unspoken libfem assumption that all bi women prefer men, less would be wrongfully convinced they're really lesbians just because they prefer women"
   },
   "reply_293230": {
      "reply id": "293230",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 05:56:52 AM",
      "post content": ">>293221agreed. i believe the problem could also be mitigated by the popularization of terms indicating preferences, such as febfem or kinsey scale ids. the misunderstanding of bisexuality as a 50/50 thing really did some damage, i can understand how those \"basically gay/straight\" people would be hesitant to call themselves bi (though i do believe that some of the types described in >>292510 arent really attracted to women at all and are just repeating the same stock phrases)."
   },
   "reply_293271": {
      "reply id": "293271",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 06:58:44 AM",
      "post content": ">watching a youtube video about a Pokemon project by some programmers>see obvious male's avatar in the comments, long hair and incredibly masculine facial structure, cannot possibly be mistaken for a woman even with the photo's shit quality>name is \"Emma Starr\">kek>visit his channel to hear voice>get hit with a hilariously horrible falsetto akin to SSB9's>instanly burst out laughing and cacklingDo they really think they're fooling anyone? Holy shit.>>292116That kind of scrote is usually worried about not being able to pass down his genes because they're reaching 30 and haven't had kids, so they look for a young \"fertile\" and of course naive woman. They disgust me."
   },
   "reply_293350": {
      "reply id": "293350",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 01:25:51 PM",
      "post content": ">>293271Every time!! I just watched a new video (movie review) by this youtuber who randomly had a person on his channel and he was like 'go check her out if you can' when it was SO obviously a big hulking dude with a deep male voice. Like, what the fuck is going on. One comment was like \"That's a man though…\"  I hate libfem women so much, but libfem men are just as bad, if not worse, since MTF trannies dont affect them at all."
   },
   "reply_293548": {
      "reply id": "293548",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 04:01:48 PM",
      "post content": ">>290826its more understandable when you realize a lot of people can't handle the stress from having a non-mainstream opinion especially when there's negative consequences if anyone ever finds out. They'll have the opinion privately but you'll never find out. >>290826because they're in the LGBT group they cant say anything about trannies or they'll get ostracized."
   },
   "reply_294026": {
      "reply id": "294026",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 11:01:08 PM",
      "post content": "I had to see this now you do too"
   },
   "reply_294044": {
      "reply id": "294044",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 11:56:13 PM",
      "post content": ">>294026>think potato wedge instead of salt and vinegar chipsHe goes through all that effort of describing his brainrot and then hits you with this line. How is that the best he comes up with"
   },
   "reply_294054": {
      "reply id": "294054",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 12:39:27 AM",
      "post content": ">>293271I love when mantroons post long videos of themselves talking, because you can skip through the video and hear their voices gradually drop as they tire of (or straight up forget) putting on the creepy nasally falsetto."
   },
   "reply_294212": {
      "reply id": "294212",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 07:13:55 AM",
      "post content": ">>294026tumblr heritage post"
   },
   "reply_294350": {
      "reply id": "294350",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 01:45:05 PM",
      "post content": ">>294026>how affirming it is to the identity…this is insane, how can people talk like this and not realize how insane this sounds."
   },
   "reply_294452": {
      "reply id": "294452",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 04:16:43 PM",
      "post content": ">>273665kek no. he went into turbo autism mode when hogwarts legacy was released and made it his life mission to crack it. pretty much confirmed hes a larper"
   },
   "reply_294593": {
      "reply id": "294593",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 07:20:38 PM",
      "post content": ">>275456late reply but I'm a \"terf\" because I won't let myself get memed into getting raped by roleplaying moids. Their handmaidens get really mad at me and tell me I haven't found the right dress-wearing dick yet every time, but I ignore them. The bathroom debate seems silly to you because you haven't been personally affected by male violence and violation in regards to that yet - for example, South Korean moids are infamous for installing spycameras in women's bathroom stalls to get fetish material. There are copycat cases popping up in other countries by moids who saw that and got inspired. Do you really not care about increasing that non-zero chance?Sensible men who aren't sexual predators will choose to use the men's bathrooms instead of going into women's ones to see if there's a window of opportunity to commit a misogynistic hate crime.As for MTFs who fear violence at the hands of other males, I sympathize, but the answer is not \"let's make women feel unsafe instead.\" The best solution for everyone involved is a 3rd bathroom (family use/disability accessible/private)."
   },
   "reply_295269": {
      "reply id": "295269",
      "username": "Anonymous",
      "date posted": "09/15/24 (Sun) 07:52:25 AM",
      "post content": "A TIM flashed me on my way to the store today. I wanna puke."
   },
   "reply_295306": {
      "reply id": "295306",
      "username": "Anonymous",
      "date posted": "09/16/24 (Mon) 06:09:28 PM",
      "post content": ">>275677AGP aside, a lot of the reason they get drawn to trooning is not wanting to grow up yet and take on the responsibilities of being an adult man. You know, sucking it up, being a provider, being the one in charge, that stupid hierarchical infighting they do constantly, and so on. They can talk about female pressure all they want, but other men and male society is the toughest on men and not all of them can cope.Women mistakenly get viewed by a lot of men as \"pretty things that just sit there and get attention/sex while everyone looks after them and they don't have to work\", which gets conflated with their desire to stay a perma-child. They ALSO want to get attention/sex and be more attractive (women are attractive to them, so a natural choice) and have someone look after them while they just sit at home… cooking and sewing or something? Free of all the \"real\" responsibilities. It reflects a lot of the shitty things men seem to believe about what it is women actually do and how little respect they have for the work they're capable of noticing. So they pound down estrogen and say they're women, and that gets mixed up with their perma-child desires so they're actually \"girls\", and they spend so long sexualizing women and themselves and their idea of \"girlhood\" that it not infrequently turns into youth obsession and even pedo tendencies.TiMs are typically trying to escape abuse, trauma, and objectification, or have been taught to think of femininity as weak and inferior (moid societal conditioning). Unfortunately for them, many are still attracted to men, but men drove them to this in the first place so they gravitate to fiction where the men have no chance of hurting her and can also be thoughtful without it being the act of a stealth shitbag. This media typically has teen anime guys, and that's what you see emulated. Add in that gay culture has its preferred subtypes with \"young twink\" being a big one, and that most women aren't going to turn into buff and rugged lumberjacks. Not too many choices to aim for.t;dr: yes but also misogyny"
   },
   "reply_295307": {
      "reply id": "295307",
      "username": "Anonymous",
      "date posted": "09/16/24 (Mon) 06:19:31 PM",
      "post content": ">>294593hes a man, he can defend himself"
   },
   "reply_295309": {
      "reply id": "295309",
      "username": "Anonymous",
      "date posted": "09/16/24 (Mon) 06:37:55 PM",
      "post content": ">>295306To me, its more acceptable to be a single failed male who has a meh job and never gets married. Troons are universally reviled for being degenerates and perverts. They age horribly and most don't good to begin with. They're only propped up by the LGBT allies who are just lying through their teeth until they get peaked. Most guys want kids and don't want to marry a man and if they do. Lesbians can see through that bullshit and even in the dark, a mans body is clearly a man."
   },
   "reply_295310": {
      "reply id": "295310",
      "username": "Anonymous",
      "date posted": "09/16/24 (Mon) 06:40:42 PM",
      "post content": ">>273699Fitgirl is 100% a man.Read this articlehttps://torrentfreak.com/meet-fitgirl-the-repack-queen-of-pirated-games-200604/>While FitGirl was building a personal home archive, she (we will use this pronoun) stumbled upon public repacks released on pirate sites.I also remember reading somewhere he would describe himself as an 'unusual' girl or something."
   },
   "reply_295364": {
      "reply id": "295364",
      "username": "Anonymous",
      "date posted": "09/18/24 (Wed) 03:06:43 AM",
      "post content": ">>295310what about this tells you he/she is a man?"
   },
   "reply_295431": {
      "reply id": "295431",
      "username": "Anonymous",
      "date posted": "09/19/24 (Thu) 12:27:07 PM",
      "post content": ">>295364>she (we will use this pronoun)Does this not tell you anything? It sounds like they're referring to fitgirl as if it's just a persona thing judging by the way it's worded in this article."
   },
   "reply_295447": {
      "reply id": "295447",
      "username": "Anonymous",
      "date posted": "09/20/24 (Fri) 02:22:24 AM",
      "post content": "i wouldn't even consider myself a terf… but trans women cannot stop themselves from inserting themselves into spaces where they shouldnt be. i dont mean like,,, bathroom discourse. i mean like, discussions about womanhood online. you are not a woman in the way that i am a woman. you were not born and raised in a society that tells you to be complacent. you were raised as a man. and like, people are calling this \"bioessentialism\" as if it not common knowledge that men and women are raised differently?"
   },
   "reply_295458": {
      "reply id": "295458",
      "username": "Anonymous",
      "date posted": "09/20/24 (Fri) 11:53:07 AM",
      "post content": ">>295431thats just the articles opinion, not a factdo you have more info on picrel?i tried to go through reddit, archive.org and kiwifarms for anything on fitgirls discord and his/her \"manchild tantrum\" but couldnt find anything"
   },
   "reply_295482": {
      "reply id": "295482",
      "username": "Anonymous",
      "date posted": "09/20/24 (Fri) 08:17:13 PM",
      "post content": ">>295458what? gender is not an opinion kek why are you acting so obtuse?"
   },
   "reply_295483": {
      "reply id": "295483",
      "username": "Anonymous",
      "date posted": "09/20/24 (Fri) 09:23:42 PM",
      "post content": ">>295482are you saying if the article worded it like fitgirl was a real woman youd 100% believe it wasnt a tranny?"
   },
   "reply_295496": {
      "reply id": "295496",
      "username": "Anonymous",
      "date posted": "09/21/24 (Sat) 02:19:00 PM",
      "post content": ">>269991"
   },
   "reply_295497": {
      "reply id": "295497",
      "username": "Anonymous",
      "date posted": "09/21/24 (Sat) 02:59:18 PM",
      "post content": ">>295496Does he have an anime pfp? If so, weeb men must be avoided at all cost"
   },
   "reply_295508": {
      "reply id": "295508",
      "username": "Anonymous",
      "date posted": "09/22/24 (Sun) 07:22:31 AM",
      "post content": "This is so ironic."
   },
   "reply_295509": {
      "reply id": "295509",
      "username": "Anonymous",
      "date posted": "09/22/24 (Sun) 10:50:01 AM",
      "post content": ">>295508pickmes don't understand cognitive dissonance"
   },
   "reply_295510": {
      "reply id": "295510",
      "username": "Anonymous",
      "date posted": "09/22/24 (Sun) 11:18:29 AM",
      "post content": ">>295509its a troon"
   },
   "reply_295511": {
      "reply id": "295511",
      "username": "Anonymous",
      "date posted": "09/22/24 (Sun) 11:54:01 AM",
      "post content": ">>295510the tumblr account says she is cis lesbian but who knows"
   },
   "reply_295600": {
      "reply id": "295600",
      "username": "Anonymous",
      "date posted": "09/26/24 (Thu) 08:09:01 AM",
      "post content": ">browsing videos about people playing music>click one of someone in a dress without looking much at the thumbnail>video plays, instantly greeted with manface, giant man hands, Adam's apple>\"That's a man.\">he speaks, it is indeed a man calling himself a womanI was doing so well dodging troon content this week, damn it.>>295306*TiFsFirst half of the post made a typo happen and I didn't notice until now."
   },
   "reply_295672": {
      "reply id": "295672",
      "username": "Anonymous",
      "date posted": "09/28/24 (Sat) 04:01:37 AM",
      "post content": "HOW do people say with complete sincerity and big smiles that it's such a great thing that we recognize that some people are just born with a natural instinct to despise their bodies nothing to do about it nothing to see here move along? How? It makes me sick. Thank God I moved back to Boomerton where I can get away from it all and get stared at in the breakfast aisle for having visible tattoos and a healthy weight instead."
   },
   "reply_295697": {
      "reply id": "295697",
      "username": "Anonymous",
      "date posted": "09/28/24 (Sat) 10:53:40 PM",
      "post content": "The LDR subreddit has been full of troon couples recently. The worst one was where it was a guy dating someone old enough to be his grandfather."
   },
   "reply_295763": {
      "reply id": "295763",
      "username": "Anonymous",
      "date posted": "09/29/24 (Sun) 11:02:47 PM",
      "post content": ">>295697what the fuck am i looking at. are they both girl trannies or guy trannies what"
   },
   "reply_295771": {
      "reply id": "295771",
      "username": "Anonymous",
      "date posted": "09/30/24 (Mon) 04:52:24 AM",
      "post content": ">>295431I think the idea is that by being vague about their gender they're protecting their identity, as if Fitgirl is some Wikileaks-tier internet criminal being pursued by videogame companies and they're protecting their cover."
   },
   "reply_295772": {
      "reply id": "295772",
      "username": "Anonymous",
      "date posted": "09/30/24 (Mon) 05:06:07 AM",
      "post content": ">>295771that and/or they just dont want to look dumb if fitgirl turns out to be a man"
   },
   "reply_295774": {
      "reply id": "295774",
      "username": "Anonymous",
      "date posted": "09/30/24 (Mon) 05:46:40 AM",
      "post content": ">>295772its a woman"
   },
   "reply_295775": {
      "reply id": "295775",
      "username": "Anonymous",
      "date posted": "09/30/24 (Mon) 05:47:11 AM",
      "post content": ">>295774its a woman im not fucking dumb"
   },
   "reply_295776": {
      "reply id": "295776",
      "username": "Anonymous",
      "date posted": "09/30/24 (Mon) 05:50:50 AM",
      "post content": ">>295775and not a cc usera toxic lolcow one"
   },
   "reply_295777": {
      "reply id": "295777",
      "username": "Anonymous",
      "date posted": "09/30/24 (Mon) 05:55:29 AM",
      "post content": ">>295776also its funny how lolcow users never realize theyre the true lolcow"
   },
   "reply_295833": {
      "reply id": "295833",
      "username": "Anonymous",
      "date posted": "10/01/24 (Tue) 09:03:17 PM",
      "post content": ">>295497you know whats funny about this? some TIMs actually look cute, but this was on a \"voice training\" server where they try to sound like women, and all the selfies were literally just men"
   },
   "reply_295835": {
      "reply id": "295835",
      "username": "Anonymous",
      "date posted": "10/01/24 (Tue) 09:04:04 PM",
      "post content": ""
   },
   "reply_295836": {
      "reply id": "295836",
      "username": "Anonymous",
      "date posted": "10/01/24 (Tue) 09:04:43 PM",
      "post content": ""
   },
   "reply_295837": {
      "reply id": "295837",
      "username": "Anonymous",
      "date posted": "10/01/24 (Tue) 09:06:41 PM",
      "post content": ""
   },
   "reply_295843": {
      "reply id": "295843",
      "username": "Anonymous",
      "date posted": "10/01/24 (Tue) 11:52:08 PM",
      "post content": "am I unbanned"
   },
   "reply_295867": {
      "reply id": "295867",
      "username": "Anonymous",
      "date posted": "10/02/24 (Wed) 04:30:48 PM",
      "post content": ">>273925I have noticed gay men who transition hate women more than any other group of tims. Interesting."
   },
   "reply_295868": {
      "reply id": "295868",
      "username": "Anonymous",
      "date posted": "10/02/24 (Wed) 04:47:11 PM",
      "post content": ">>275695>(HSTS aim to attract straight men, while most AGPs are \"former\" incels who fell for the transmaxxing meme).Both are transmaxxing \"ex\" incels.HSTS are as bad as AGPs, and even more misogynistic in some cases."
   },
   "reply_295872": {
      "reply id": "295872",
      "username": "Anonymous",
      "date posted": "10/02/24 (Wed) 09:04:12 PM",
      "post content": ">>295867gay men are very misogynistic so that tracks"
   },
   "reply_295876": {
      "reply id": "295876",
      "username": "Anonymous",
      "date posted": "10/02/24 (Wed) 11:29:48 PM",
      "post content": ">>295872im ok with lesbian woman tho"
   },
   "reply_295877": {
      "reply id": "295877",
      "username": "Anonymous",
      "date posted": "10/02/24 (Wed) 11:30:38 PM",
      "post content": ">>295876i mean technically i waas born a woman tho im only comfy with lesbians"
   },
   "reply_295878": {
      "reply id": "295878",
      "username": "Anonymous",
      "date posted": "10/02/24 (Wed) 11:32:19 PM",
      "post content": "also tell me what tims are cause ive never heard of what a tim is"
   },
   "reply_295893": {
      "reply id": "295893",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 02:35:02 PM",
      "post content": ">>295872Honestly it hurts my brain when nonas think HSTS somehow aren't as bad as AGP.If you spend time in troonoid spaces you notice that most of female hate and misogyny actually comes from HSTS.This is because they want to have a competition with women and want to attract straight men.This drive them insane.Did you forget this?Straight man = manBisexual man = man Homosexual man = manAGPs and HSTS are equally bad."
   },
   "reply_295895": {
      "reply id": "295895",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 04:48:01 PM",
      "post content": ">>295878think \"trans-identifying male\" in this context, not sure"
   },
   "reply_295902": {
      "reply id": "295902",
      "username": "Anonymous",
      "date posted": "10/03/24 (Thu) 08:53:33 PM",
      "post content": ">>295893they're both the same flavor of mentally ill and both disgust me. i think AGPS instinctively  disgust women more because it's like despite being a tranny, they still want access to womens bodies and don't even put effort in trying to pass unlike hsts. but yeah they're men at the end of the day"
   },
   "reply_295911": {
      "reply id": "295911",
      "username": "Anonymous",
      "date posted": "10/04/24 (Fri) 12:22:53 AM",
      "post content": ">>295458\"fitgirl\" has a woody for amelie and talks in \"hello fellow girls\" speak the way any other tranny would. you're not going to get a concrete answer about the identity of a repacker or a cracker. its just about ego and one upping one another in piracy spaces. why do you think a real woman would admit to being one if it was another thing that could make it easier to reveal her identity?"
   },
   "reply_295934": {
      "reply id": "295934",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 07:58:06 AM",
      "post content": "Fellow TERF here been peaked for a while now and everyday seems to be a new reminder for why I hate trans people. So I am a biracial black woman and I have an Instagram account. Today I posted a really cute picture of myself made up where I felt confident and happy and I uploaded it to my account for my followers to see. Next thing I know, I get a weird comment from someone I don't know saying \"Ew why do you look like that?\" Usually I ignore such a comment but today I chose to entertain it since I was bored and merely said \"Well I think I look cute thank you very much.\" Next thing I know, this person is tagging me on their account and they've made a whole reel where they used my new picture and put it side by side with a monkey, basically saying I look like a monkey. They continually kept making racist memes and reels of me, even taking one of my pictures and turning it into their profile icon as some sort of sick joke. One of my friends saw this and started to call them out in the comments. And when my friend commented \"he or her needs to stop\". The troll replied in an annoying cutesy way \"it's actually they them! Teehee\". I swear to fucking God you can't even exist on the internet as a woman without some chronically online tranny harassing you. I've tried reporting the account dozens of times yet Instagram is not doing shit, even with their so called \"strict bullying policy\". I guess we can see who the real \"protected class\" is."
   },
   "reply_295935": {
      "reply id": "295935",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 07:58:26 AM",
      "post content": "Fellow TERF here been peaked for a while now and everyday seems to be a new reminder for why I hate trans people. So I am a biracial black woman and I have an Instagram account. Today I posted a really cute picture of myself made up where I felt confident and happy and I uploaded it to my account for my followers to see. Next thing I know, I get a weird comment from someone I don't know saying \"Ew why do you look like that?\" Usually I ignore such a comment but today I chose to entertain it since I was bored and merely said \"Well I think I look cute thank you very much.\" Next thing I know, this person is tagging me on their account and they've made a whole reel where they used my new picture and put it side by side with a monkey, basically saying I look like a monkey. They continually kept making racist memes and reels of me, even taking one of my pictures and turning it into their profile icon as some sort of sick joke. One of my friends saw this and started to call them out in the comments. And when my friend commented \"he or her needs to stop\". The troll replied in an annoying cutesy way \"it's actually they them! Teehee\". I swear to fucking God you can't even exist on the internet as a woman without some chronically online tranny harassing you. I've tried reporting the account dozens of times yet Instagram is not doing shit, even with their so called \"strict bullying policy\". I guess we can see who the real \"protected class\" is."
   },
   "reply_295936": {
      "reply id": "295936",
      "username": "Anonymous",
      "date posted": "10/06/24 (Sun) 08:00:13 AM",
      "post content": ">>295935Shit i made this post one too many times and now I can't delete. My bad"
   },
   "reply_295952": {
      "reply id": "295952",
      "username": "Anonymous",
      "date posted": "10/07/24 (Mon) 01:04:55 AM",
      "post content": ">>295837ok this one made me laugh it's almost like this guy slept on his head the wrong way and it got squished into a funny shape"
   },
   "reply_295959": {
      "reply id": "295959",
      "username": "Anonymous",
      "date posted": "10/07/24 (Mon) 03:38:53 AM",
      "post content": "> Met Tranny on a game> He heard my voice so he said \"We're friends now\"> Asks me my pronouns and sexuality, etc.> Says he can \"send\" me pics on discordWut? I don't want to see your ugly dick pics"
   },
   "reply_295994": {
      "reply id": "295994",
      "username": "Anonymous",
      "date posted": "10/08/24 (Tue) 06:38:12 PM",
      "post content": "i got banned by a tranny mod on lgbt for being realistic when responding to their sexist perverted groomer points and opinions. for \"posting child porn\"… i wish there was a way to demod that faggot for such a thingrecently had the displeasure of coming across a crossdresserlike blatantly fake tits, wig and lmao their frame lolol skele-men, when will you learn?"
   },
   "reply_296026": {
      "reply id": "296026",
      "username": "Anonymous",
      "date posted": "10/09/24 (Wed) 12:13:44 PM",
      "post content": "I've seen a lot of trannies who turn into vtubers (dont watch them but they come to my timeline too much ffs get out) that whenever i look at their models, it's always like some big breasted character which i always think they are just being perverts. It might be their escapism but god i find it so funny when their model does not match their awful look at times. Same with other artists that i see on twitter and have to fucking press the \"not interested\" button so they don't appear anymore.I feel like they always oversexualize women a lot and are not realistic about their own shit. It's always with them, whenever i see other artists, they draw themselves with a more realistic self image and seems just more natural to see than a moid drawing themselves as as more unrealistic version of themselves that is gross to look at knowing that they look like shit."
   },
   "reply_296058": {
      "reply id": "296058",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 02:24:55 AM",
      "post content": "look at the bigger picture ladies, this entire trend will just solidify how fucking retarded men are."
   },
   "reply_296059": {
      "reply id": "296059",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 02:32:20 AM",
      "post content": ">>296058"
   },
   "reply_296125": {
      "reply id": "296125",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 07:34:47 PM",
      "post content": ">>296119Being black and constantly fetishized is suffer from both political ends of the spectrum"
   },
   "reply_296159": {
      "reply id": "296159",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 10:51:39 PM",
      "post content": ">>296059gemmy and keyed"
   },
   "reply_296164": {
      "reply id": "296164",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 11:29:43 PM",
      "post content": ">>296059gurl u cant say that. like ur obv white asf thats BLACK PEOPLES CULTURE take it out of ur mouth. like that is not ur word yes some ppl dont need permission but thats BLACK PEOPLE SPECIFICALLY, theyre allowed 2 if theyre comfortable not u. gurl, i hate to break it to u but thats racist-"
   },
   "reply_296165": {
      "reply id": "296165",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 11:31:39 PM",
      "post content": ">>296125 they never said anthing abt fetishization tho?? like what i think its weird but colored couples arent.. yk it has nothing 2 do abt that"
   },
   "reply_296166": {
      "reply id": "296166",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 11:33:30 PM",
      "post content": ">>296165like i mean what they said was creepy"
   },
   "reply_296167": {
      "reply id": "296167",
      "username": "Anonymous",
      "date posted": "10/10/24 (Thu) 11:37:41 PM",
      "post content": ">>296164>gurl u cant say that. like ur obv white asf thats BLACK PEOPLES CULTURE take it out of ur mouth. like that is not ur word yes some ppl dont need permission but thats BLACK PEOPLE SPECIFICALLY, theyre allowed 2 if theyre comfortable not u. gurl, i hate to break it to u but thats racist-"
   },
   "reply_296170": {
      "reply id": "296170",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 12:29:04 AM",
      "post content": ">>296165why do you type like a teenage retard?>>296164>>296167samefag/go back"
   },
   "reply_296172": {
      "reply id": "296172",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 01:01:51 AM",
      "post content": ">>296170..the r slur AND the f slur with a random ass accusation..!! i BELONG here and seeing an obviously WHITE woman saying a SLUR meant for ONLY people with dark skin to say.. like the rules said im not allowed to use uppercase letters so ill avoid doing that too much but imagine DEFENDING somebody who is DISRESPECTING a raceial culture, GOING INTO THEIR personal bubble and just saying the slur like what, how many times was that?? that is off the rails im done YOU should be against whoever trolled us with that video."
   },
   "reply_296173": {
      "reply id": "296173",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 01:23:20 AM",
      "post content": ">>296172if things on the internet make you this mad just log off it cant be good for you"
   },
   "reply_296175": {
      "reply id": "296175",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 02:33:11 AM",
      "post content": ">>296059gurl how big is your forehead"
   },
   "reply_296191": {
      "reply id": "296191",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 02:34:19 PM",
      "post content": ">>296173She's not real anon that's a samefagging man."
   },
   "reply_296231": {
      "reply id": "296231",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 10:19:48 PM",
      "post content": "lolcow is down so now you guys have to witness this vomit-inducing garbage. I will never forgive men for what they have done to yuri.>>296172Go back"
   },
   "reply_296239": {
      "reply id": "296239",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 10:41:32 PM",
      "post content": ">>296231Any \"cis lesbian\" that 1. Brings a tranny home to fuck, and2. Is obsessed enough about terfs to mention it during foreplayIs not a lesbian that is most definitely a bihet or straight woman."
   },
   "reply_296249": {
      "reply id": "296249",
      "username": "Anonymous",
      "date posted": "10/11/24 (Fri) 11:30:58 PM",
      "post content": ">>296059"
   },
   "reply_296315": {
      "reply id": "296315",
      "username": "Anonymous",
      "date posted": "10/13/24 (Sun) 03:32:59 PM",
      "post content": ">>296231Thanks, I hate it."
   },
   "reply_296365": {
      "reply id": "296365",
      "username": "Anonymous",
      "date posted": "10/14/24 (Mon) 11:10:01 PM",
      "post content": ">just one more operation bro. just let me have one more and i'll stop. "
   },
   "reply_296367": {
      "reply id": "296367",
      "username": "Anonymous",
      "date posted": "10/15/24 (Tue) 01:32:00 AM",
      "post content": ">>296365This reads like horror. Makes me think he is gonna steal a woman’s eyes"
   },
   "reply_296368": {
      "reply id": "296368",
      "username": "Anonymous",
      "date posted": "10/15/24 (Tue) 02:03:55 AM",
      "post content": ">>296367yeah, that's where my mind went with it too."
   },
   "reply_296414": {
      "reply id": "296414",
      "username": "Anonymous",
      "date posted": "10/15/24 (Tue) 06:25:55 PM",
      "post content": ">>295893AGP are more likely to physically hurt a woman, HSTS are more likely to emotionally hurt a woman. I hate HSTS a little less."
   },
   "reply_296570": {
      "reply id": "296570",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 11:00:11 AM",
      "post content": ">>296231"
   },
   "reply_296571": {
      "reply id": "296571",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 11:11:31 AM",
      "post content": ">>296570(you)"
   },
   "reply_296572": {
      "reply id": "296572",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 11:16:54 AM",
      "post content": "as a gentle reminder, most people would just click off if they felt they could. i don't hate other women."
   },
   "reply_296576": {
      "reply id": "296576",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 01:28:11 PM",
      "post content": ">>296570This honestly reads like someone larping in order to clown on troons. Be more subtle."
   },
   "reply_296577": {
      "reply id": "296577",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 01:30:32 PM",
      "post content": ">>296570A troon would not have this level of self awareness. They are delusional and believe everything they do is brave and beautiful, including watching cartoons fuck."
   },
   "reply_296628": {
      "reply id": "296628",
      "username": "Anonymous",
      "date posted": "10/21/24 (Mon) 07:27:04 AM",
      "post content": "Rare footage of some cute trans girls having a swim"
   },
   "reply_296631": {
      "reply id": "296631",
      "username": "Anonymous",
      "date posted": "10/21/24 (Mon) 07:38:11 AM",
      "post content": ">>296628kek"
   },
   "reply_296638": {
      "reply id": "296638",
      "username": "Anonymous",
      "date posted": "10/22/24 (Tue) 02:58:33 AM",
      "post content": "any @cervixpierver threads?"
   },
   "reply_296688": {
      "reply id": "296688",
      "username": "Anonymous",
      "date posted": "10/24/24 (Thu) 06:04:07 AM",
      "post content": "The troon thread on lc is raided with jealous dysphoric men who called a pretty girl with a round face, which looked like a doll, ugly kek because they only feel better after gaslighting people, I mean their entire being is just gaslighting so it makes sense.What a sad existence kek"
   },
   "reply_296785": {
      "reply id": "296785",
      "username": "Anonymous",
      "date posted": "10/26/24 (Sat) 09:16:49 AM",
      "post content": ">>296315Juno like the overwatch 2 alien girl? damn, those dude cannot have a original personality"
   },
   "reply_296799": {
      "reply id": "296799",
      "username": "Anonymous",
      "date posted": "10/27/24 (Sun) 02:23:31 PM",
      "post content": "feeling better after remembering hating trannies is cool now"
   },
   "reply_296800": {
      "reply id": "296800",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 12:08:11 AM",
      "post content": ">>269991lmao john50 no hrt. ofc your dog still thinks ur a man nothings changed. ive never once had this problem in my family's all girl household with my poor formerly abused rescue puppy. sorry for off topic tranny reply just saw picrel and thought it was sad"
   },
   "reply_296824": {
      "reply id": "296824",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 09:09:55 PM",
      "post content": ">>296799is it really tho. like it only seems like it because cc hates troons"
   }
}