{
   "thread number": "118092",
   "original post": {
      "post id": "118092",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 01:28:57 PM",
      "post content": "Yesterday I looked up my name in my bfs chats and found an old chat, about 6 months ago, where he was talking to his ex GF.I know they keep up with one another from time to time, but I couldn't believe what my eyes where witnessing.About half a year ago, we were still in the early stages of dating and apparently my bf had a crush on my best friend.Ever since I read this I'm deeply hurt and can't think straight?What if my bf likes my best friend more than me? But only stays with me because going after her would be a dick move.The worst part is, I can't tell anyone. Obviously I cannot tell him that I looked through his phone nor can I tell my best friend.I have been crying ever since and don't know how to carry on this relationship. How am I supposed to have a straight face when meeting him??I cannot imagine hanging out with them together"
   },
   "reply_118094": {
      "reply id": "118094",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 01:45:58 PM",
      "post content": ">>118092>exStopped reading right there. Don't date a moid unless he's a virgin, and sometimes not even then."
   },
   "reply_118098": {
      "reply id": "118098",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 02:02:20 PM",
      "post content": ">>118094I'm not a big fan of him texting his ex but she lives abroad. They have been friends before they were dating and remained friends afterwards"
   },
   "reply_118099": {
      "reply id": "118099",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 02:09:48 PM",
      "post content": "He probably cheats too. You'll found out sooner or later. This type of people always cheat"
   },
   "reply_118101": {
      "reply id": "118101",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 02:34:36 PM",
      "post content": ">>118098So is he a virgin or not?"
   },
   "reply_118103": {
      "reply id": "118103",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 07:22:08 PM",
      "post content": ">>118092he didn't mention you or your friend again to her for another 6 months? it's probably fine. early stages, as you said.but what did you want to have happen going through his phone and searching your name?"
   },
   "reply_118106": {
      "reply id": "118106",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 09:42:33 PM",
      "post content": "Having an \"ex\" as a \"friend\" is a straight up red flag.Be better, breakup, you will regret it later on if you don't move out"
   }
}