{
   "thread number": "218051",
   "original post": {
      "post id": "218051",
      "username": "Anonymous",
      "date posted": "02/03/23 (Fri) 12:19:58 PM",
      "post content": "Please include the following in your post:>Contact>Timezone>Age>Preferred age range for friends>Hobbies & Interests and other details>Are you a busy person or is it okay to contact you whenever?"
   },
   "reply_218126": {
      "reply id": "218126",
      "username": "Anonymous",
      "date posted": "02/03/23 (Fri) 08:32:29 PM",
      "post content": "askcentral US18olderdiscord and cosplaycontact whenever pls"
   },
   "reply_219381": {
      "reply id": "219381",
      "username": "Anonymous",
      "date posted": "02/09/23 (Thu) 05:07:04 PM",
      "post content": ">ContactCheck attached image for my discord. You can also PM me on Gaiaonline. My username is Rose-Broomstix>TimezoneEST>Age30>Preferred age range for friends25-40>Hobbies & Interests and other detailsBJD, EGL/alternative plus sized fashion, the paranormal, astrology, writing and roleplaying, thrifting and visiting estate sales.  >Are you a busy person or is it okay to contact you whenever?Feel free to contact me with daily updates if you like! I am busy during the day, but it would be comfy to get updates about your life, no matter how trivial. I used to have a friend in Germany who would take pictures of his grocery haul and pictures around his town. He got a girlfriend and we lost touch, but I genuinely enjoy catching glimpses of people's ordinary lives. I'm very casual and chill, I would rather immediately act like we are besties instead of being overly formal. Don't be shy!"
   },
   "reply_219578": {
      "reply id": "219578",
      "username": "Anonymous",
      "date posted": "02/10/23 (Fri) 10:36:18 AM",
      "post content": ">ContactHaylenK#2507>TimezoneUK>Age25>Preferred age range for friends20 to 40>Hobbies & Interests and other detailsArt, weird animated movies, kids books, my cats>Are you a busy person or is it okay to contact you whenever?Hit me up whenever! I'll reply when I can"
   },
   "reply_219613": {
      "reply id": "219613",
      "username": "Anonymous",
      "date posted": "02/10/23 (Fri) 04:44:12 PM",
      "post content": ">>218051>ContactReply with yours>TimezoneEST>Age18>Preferred age range for friendsWithin 2 or 3 years of my age is preferable but I am willing to talk to anyone basically>Are you a busy person or is it okay to contact you whenever?I will contact you"
   },
   "reply_219671": {
      "reply id": "219671",
      "username": "Anonymous",
      "date posted": "02/11/23 (Sat) 03:47:22 AM",
      "post content": ">ContactSee below>TimezoneEastern USA>Age32>Preferred age range for friends25+>Hobbies & Interests and other detailsI'm mostly obsessed with music these days. Punk, postpunk, goth, '80s, etc. Not really into nerdy shit anymore. I absolutely hate 99.9% of anime and I only play vidya occasionally. I'd love to be able to talk music with someone.>Are you a busy person or is it okay to contact you whenever?Contact me whenever. [email protected] until we know each other better"
   },
   "reply_219886": {
      "reply id": "219886",
      "username": "Anonymous",
      "date posted": "02/12/23 (Sun) 02:13:24 PM",
      "post content": ">>218051Chenx#712125Can talk about pretty much anything Just dont be bossy"
   },
   "reply_219887": {
      "reply id": "219887",
      "username": "Anonymous",
      "date posted": "02/12/23 (Sun) 02:24:20 PM",
      "post content": "I just want to warn nonas that the previous times we attempted threads like these they were always hijacked by males. Be careful and don't immediately trust anyone who adds you."
   },
   "reply_219890": {
      "reply id": "219890",
      "username": "Anonymous",
      "date posted": "02/12/23 (Sun) 02:52:28 PM",
      "post content": "[email protected]EST or is it EDT, (east coast)19Around the same ageGoing outside, play some Vidya occasionally, posting on imageboards, eating pubsubsContact me whenever, I might not reply because I'm busy with homework."
   },
   "reply_220681": {
      "reply id": "220681",
      "username": "Anonymous",
      "date posted": "02/18/23 (Sat) 07:47:35 PM",
      "post content": ">Contactkuma#6631>Timezoneuk>Age19>Preferred age range for friendsabt the same age just be over 18 lol>Hobbies & Interests and other detailsgaming (some of my favs r jetsetradio, nier, katamari, wadanohara / other rpgmaker games from that era, ror2), cosplay, drawing, music (breakcore, dnb, shibuya-kei, kpop… i am pretty open to music!), manga (ykk, girls last tour, rov..), im a engineering student and i like electronics and stuff like that >Are you a busy person or is it okay to contact you whenever?whenever :D !!! looking for ppl to game with and hang out online with"
   },
   "reply_220682": {
      "reply id": "220682",
      "username": "Anonymous",
      "date posted": "02/18/23 (Sat) 07:49:17 PM",
      "post content": ">>220681forgot to add but i am someone who loves + wears himekaji so if u are intrested in gyaru / j fashion too!!!"
   },
   "reply_220691": {
      "reply id": "220691",
      "username": "Anonymous",
      "date posted": "02/18/23 (Sat) 08:28:06 PM",
      "post content": ">>218051>contactin email field>timezoneGMT but I'm nocturnal>age29>preferred age range for friends25+>Hobbies and interestsTraditional fine art, herbal medicine (not weed), community work, anti-war movement, house plants, astrology, \"schitzo posting\", I used to like anime but now i would say i hate 99% of it, anti-troon feminism across the political spectrum, hate politics that's just ego wankery love bi-partisan political discussions, linguistics and languages. Would love to meet more unhinged women like me."
   },
   "reply_220736": {
      "reply id": "220736",
      "username": "Anonymous",
      "date posted": "02/19/23 (Sun) 03:51:33 AM",
      "post content": ">>218051Contact: My discord is aldente#0414  (This is a throwaway account since I don't feel comfy posting my real account. But once we get to know each other, I'll give you my real one!)Timezone: PSTAge Range: Any I guess. I'm 23. Hobbies: I like writing, journaling, taking care of plants, and needle felting. I have a lot of cactus! Are you a busy person: Not at the moment. I'm a NEET until August when my job starts C: So I'll answer quickly if I can."
   },
   "reply_220739": {
      "reply id": "220739",
      "username": "Anonymous",
      "date posted": "02/19/23 (Sun) 05:06:13 AM",
      "post content": ">Contactnana#™️0776>Timezone(GMT-8)>Age24>Preferred age range for friends20s-30s im not particularly picky with age>Hobbies & Interests and other detailsi love gaming, sanrio, kpop girl groups, jfashion, cooking, pharmacology, and animals. i play mostly genshin these days. truthfully i just want to befriend more genshin girlies to share my tartaglia autism with kek>Are you a busy person or is it okay to contact you whenever?i'm pretty busy bc of med school but if you are also the type to be slow with replies i think we could get along."
   },
   "reply_220912": {
      "reply id": "220912",
      "username": "Anonymous",
      "date posted": "02/20/23 (Mon) 08:45:51 PM",
      "post content": ">Contactaiko#8198>TimezoneEST>Age20>Preferred age range for friendspreferably 19+>Hobbies & Interests and other detailsmainly interested in art (from the renaissance period), fitness, gaming, cooking, mangas, and horror films/older films. i enjoy partaking in online \"buffoonery\" from time to time, but i'm mainly looking for those with similar interest to  mine that i could befriend/game with. >Are you a busy person or is it okay to contact you whenever?not busy at all, practically spend most of my time online these days, feel free to contact whenever."
   },
   "reply_220982": {
      "reply id": "220982",
      "username": "Anonymous",
      "date posted": "02/21/23 (Tue) 09:59:47 AM",
      "post content": ">timezone CET >age23>preferred age range for friends20-25 but a little older is fine too>hobbies & interests and other detailsj-fashion, k-beauty,  paranormal/occultism (tarot, altered states of consciousness, ghosts etc.), k-pop girl groups only and idol culture (i really like love live), urban exploration, psychology, some manga and very little anime, arthouse movies, internet rabbitholes, travelling, would like to improve cooking and language skills>are you a busy person or is it okay to contact you whenever i work from home so its okay to contact me whenever, i'll answer when i can okashii#5520"
   },
   "reply_220983": {
      "reply id": "220983",
      "username": "Anonymous",
      "date posted": "02/21/23 (Tue) 11:06:57 AM",
      "post content": ">>219887yeah there were lots of lurking men and troons adding nonas, and some even posted their info in the thread larping as women. you should always voice verify if possible"
   },
   "reply_221067": {
      "reply id": "221067",
      "username": "Anonymous",
      "date posted": "02/22/23 (Wed) 08:21:34 AM",
      "post content": ">ContactNinoo#2395>TimezoneGMT+4>Age19>Preferred age range for friendsage does not matter tbh>Hobbies & Interests and other detailsbooks,movies,art,cooking and baking. also I love Blackpink^^>Are you a busy person or is it okay to contact you whenever?contact whenever. don't be shy :D"
   },
   "reply_221083": {
      "reply id": "221083",
      "username": "Anonymous",
      "date posted": "02/22/23 (Wed) 05:07:03 PM",
      "post content": ">Contact[email protected]>TimezoneGMT+2>Age20>Preferred age range for friends30+, maybe 25+ >Hobbies & Interests and other detailsIt's hard to say, I am really fickle and can easily gain or lose interest in things. I like basic stuff like history, languages and volunteering. I am not a very pleasant person and I tend to be shy or grow trusting too early and start oversharing stuff and being too clingy. >Are you a busy person or is it okay to contact you whenever?I am busy lately but you can contact me whenever you want if you're OK with waiting."
   },
   "reply_221084": {
      "reply id": "221084",
      "username": "Anonymous",
      "date posted": "02/22/23 (Wed) 06:38:52 PM",
      "post content": "Damn this sounds cool but I’m scared to send my info because I truly don’t trust that this thread is a safe place to do it..Could some of the noonas that added the other noonas tell us who are the people we should trust? I really don’t want to run into any troon or moid larping"
   },
   "reply_221085": {
      "reply id": "221085",
      "username": "Anonymous",
      "date posted": "02/22/23 (Wed) 06:47:31 PM",
      "post content": ">>221084You can try making a throwaway account but if talking with a moid or troon even on a throwaway account would bother you it's not gonna help much"
   },
   "reply_221177": {
      "reply id": "221177",
      "username": "Anonymous",
      "date posted": "02/23/23 (Thu) 07:16:53 PM",
      "post content": ">contact [email protected]>time zone cst ‘merica >age18>age preference19 at most plz>hobbies and interestsi like film, school, skyrim, and primates (orangutans, gibbons, and snub nosed monkeys are my favorite) also i have been learning high german for 3 years now>im a little busy normally but you can contact me whenever and i will respond as soon as i can"
   },
   "reply_221326": {
      "reply id": "221326",
      "username": "Anonymous",
      "date posted": "02/25/23 (Sat) 01:08:00 AM",
      "post content": ">Contactdoka#2401>TimezoneEST>Age20>Preferred age range for friends18+>Hobbies & Interests and other detailsi like drawing, reading and gaming. I'm also into touhou and i play cringe gacha rpgs sometimes>Are you a busy person or is it okay to contact you whenever?whenever is fine ᗜˬᗜ/"
   },
   "reply_221333": {
      "reply id": "221333",
      "username": "Anonymous",
      "date posted": "02/25/23 (Sat) 02:40:07 AM",
      "post content": ">Contactask>TimezonePST>Age23>Preferred age range for friendssame or older>Hobbies & Interests and other detailsmusic, scrapbooking, drawing, I uninstalled most games to focus on school>Are you a busy person or is it okay to contact you whenever? whenever but I won’t use mobile"
   },
   "reply_221435": {
      "reply id": "221435",
      "username": "Anonymous",
      "date posted": "02/26/23 (Sun) 07:36:39 AM",
      "post content": ">Contact[email protected], email me if you want a different method>Age18>Preferred age range for friends18-99>Hobbies & Interests and other detailsi like drawing, reading (manga and books), cats, and some seminormie female musicians. i'd like a friend i can draw with and maybe read together but just sharing animal pictures or something would be nice too>Are you a busy person or is it okay to contact you whenever?contact whenever"
   },
   "reply_221439": {
      "reply id": "221439",
      "username": "Anonymous",
      "date posted": "02/26/23 (Sun) 08:22:20 AM",
      "post content": ">>221435Pain and sadness for those 100 year old ladies using the site"
   },
   "reply_221452": {
      "reply id": "221452",
      "username": "Anonymous",
      "date posted": "02/26/23 (Sun) 01:47:21 PM",
      "post content": ">GMT+10>nobody is ever on at the same time as mefeels bad, man"
   },
   "reply_221498": {
      "reply id": "221498",
      "username": "Anonymous",
      "date posted": "02/26/23 (Sun) 07:49:09 PM",
      "post content": ">Contact[email protected]. I don't use discord, when I feel comfortable, I'll give out my other accounts.>TimezoneUTC-5>Age20>Preferred age range for friends18-26>Hobbies & Interests and other detailsEhhh. I really like old games, I have been playing mostly fighting games recently. I also am an artist, I really like drawing animals.Also, I'm trying to see if I can practice writing in Spanish more, I'd be interested in that also>Are you a busy person or is it okay to contact you whenever?Whenever is fine."
   },
   "reply_221530": {
      "reply id": "221530",
      "username": "Anonymous",
      "date posted": "02/27/23 (Mon) 02:40:00 AM",
      "post content": ">Contact[email protected]>TimezoneGMT>Age20>Preferred age range for friends18+>Hobbies & Interests and other detailsArt/drawing, reading, knitting, forensics, cs, feminism. recovering ana.>Are you a busy person or is it okay to contact you whenever?I'm in uni and oftentimes busy. I will get back to you ASAP, though."
   },
   "reply_221537": {
      "reply id": "221537",
      "username": "Anonymous",
      "date posted": "02/27/23 (Mon) 04:23:12 AM",
      "post content": ">ContactCheburashka#7692>TimezoneAustralia (East Coast) >Age24>Preferred age range for friendsmy age or older, i don't like interacting with people under 20. >Hobbies & Interests and other detailsvidya (postal 2, hotline miami, classic shooters, etc) languages (i speak russian, ukrainian and german) cooking, films, music (john maus, the space lady, orville peck, etc) online culture, and gardening. i love making friends with people across the globe and listening to them sharing their stories about anything ! >Are you a busy person or is it okay to contact you whenever?i'm not suuuper busy, i study full time but i do so at home, so contact me whenever !"
   },
   "reply_221683": {
      "reply id": "221683",
      "username": "Anonymous",
      "date posted": "02/28/23 (Tue) 01:13:30 PM",
      "post content": ">>221437Post anyway, I could definitely use older friends. Some people here a little too young for me"
   },
   "reply_221928": {
      "reply id": "221928",
      "username": "Anonymous",
      "date posted": "03/02/23 (Thu) 06:26:02 AM",
      "post content": "I wish retarded fucking scrotes would quit lurking on CC and taking advantage of friend finding threads. Some retard got triggered when I told him I was American, and chimped out with some autistic song lyrics. God, I wish more males would commit ropeneck and quit wasting women's time already."
   },
   "reply_221929": {
      "reply id": "221929",
      "username": "Anonymous",
      "date posted": "03/02/23 (Thu) 07:51:42 AM",
      "post content": "askGMT -3 BR2420-30graphic design, ttrpg, tumblr, tiktok, weird things on the internet, girlscontact whenever"
   },
   "reply_221937": {
      "reply id": "221937",
      "username": "Anonymous",
      "date posted": "03/02/23 (Thu) 09:05:07 AM",
      "post content": ">>221537i'm a bit under your age-range :(best of luck anyways!"
   },
   "reply_222106": {
      "reply id": "222106",
      "username": "Anonymous",
      "date posted": "03/03/23 (Fri) 09:21:28 PM",
      "post content": ">>221929nona I like TTRPGs too (mostly a lore nerd) and I don't know any other girls into them. that and weird internet stuff. I'm 25 and I would love to get in contact"
   },
   "reply_224547": {
      "reply id": "224547",
      "username": "Anonymous",
      "date posted": "03/19/23 (Sun) 10:17:40 PM",
      "post content": ">Contactlise#0755, throwaway discord.>TimezoneUTC +3>Age22>Preferred age range for friends20-26>Hobbies & Interests and other detailsFilm, photography, languages, tarot, music, reading, thrifting. Not big into games other than Animal Crossing & Mario Kart, if you have a Switch and would like to play I’d love to!I’d like to have someone to chat with regularly, share each other’s thoughts, just be comfortable around each other. So if you’re looking for that too, hmu. >Are you a busy person or is it okay to contact you whenever?I’ll start uni next month so I’ll probably be busy as hell, however these days you can contact me whenever."
   },
   "reply_224551": {
      "reply id": "224551",
      "username": "Anonymous",
      "date posted": "03/20/23 (Mon) 12:03:01 AM",
      "post content": ">Contact[email protected]>TimezoneGMT +6>Age24>Preferred age range for friends20-35>Hobbies & Interests and other detailsTechnologies, all kinds of art & craft, music, old games, weird/obscure/underground things in general>Are you a busy person or is it okay to contact you whenever?Pretty busy, but constantly online, so text me anytime"
   },
   "reply_224659": {
      "reply id": "224659",
      "username": "Anonymous",
      "date posted": "03/20/23 (Mon) 09:43:24 PM",
      "post content": "ask PST2524-28splatoon 3…sharing cool images online….pokeman…..club penguinnot that busy :3"
   },
   "reply_224674": {
      "reply id": "224674",
      "username": "Anonymous",
      "date posted": "03/20/23 (Mon) 11:31:01 PM",
      "post content": ">Contactmy discord is osaamaton#1984 >Timezoneeet >Age21>Preferred age range for friends19 and up, i dont think i’m that picky :)>Hobbies & Interests and other detailsmy biggest interests are movies (i am studying script writing!!), cats, cosplay, anime, dnd, games and uhh… right now my “main” interests are jerma, supermega, the magnus archives, rpg maker horror games and rhythm games !>Are you a busy person or is it okay to contact you whenever?i’m not really busy, contact whenever :]"
   },
   "reply_224737": {
      "reply id": "224737",
      "username": "Anonymous",
      "date posted": "03/21/23 (Tue) 02:26:21 PM",
      "post content": "This looks fun > ContactEsoteric Clown#3256> TimezoneUTC-3, I'm Argentinian >Age18, just started Uni>Preferred age range for friendsProbably 18-21, it's not like I mind older friends but I doubt we'll have too much on common >Hobbies & Interests and other detailsI like drawing, Typology (if you like typology please for the love of god text me) animation and reading. I hop from interest to interest constantly, I like anything that is interesting. >Are you a busy person or is it okay to contact you whenever?I go to uni every working day but only on the mornings, you can contact me whenever but I might not always respond, I only have discord on my pc."
   },
   "reply_225152": {
      "reply id": "225152",
      "username": "Anonymous",
      "date posted": "03/25/23 (Sat) 11:47:26 PM",
      "post content": ">ContactPerla#4644>TimezoneGMT-3>AgeTurning 20 soon>Preferred age range for friends18-25>Hobbies & Interests and other detailsDrawing, watercolor painting, crochet, webdev, poetry, fashion, local music scene. I go out with friends often, mostly to artistic and political events.>Are you a busy person or is it okay to contact you whenever?Contact me whenever, I'll reply when I'm able to."
   },
   "reply_225159": {
      "reply id": "225159",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 12:57:23 AM",
      "post content": ">ContactDive#1979>TimezoneGMT (but I'm up at odd hours)>Age25>Preferred age range for friends20+-any!Just don't type like a teen or overuse text emotes thats all I ask.>Hobbies & Interests and other detailsPutting myself out there because I lack friends. I Struggle with depression, social anxiety etc so I'd like to fill my time with interactions that are more positive and not just me stuck in a negative feedback loop. It'd be nice to have someone to relate to in that regard (the issues of loneliness, feeling of social alienation, arrested development) but it's not essential, I'm not gonna deep dive with anyone that doesn't want to. Just wanted to put it out there that I'm just as willing to be a thoughtful, mutually supportive friend if you need it as I am a sarcastic shithead who just sends you TERF memes and funny animal videos.Interests and hobbies wise I'm mainly into anime, I love reading trashy, really bad shoujo/romance manga in general and I'm addicted to those tropey isekai villainess manwha as well. It would be really fun to start/read the same series together. I'm also a huge fujo but I can be normal about it. I have a casual interest in video games but don't play much these days, I was really into Persona, Touhou and Fallout for a while though.I like writing and drawing casually for fun, character design is unironically my passion and I have like 10+ OC's I can chuck at and infodump you about if you'll let me. If you're also into writing I don't mind reading your stuff and giving feedback or even helping proof-read it if you want. I'd love to have an active reader to engage with my fiction too - It's mostly dark/toxic romance 'cause thats what I'm into. I also have a huge backlog of films I'm working my way through (everything from chick flicks to horror) that I wouldn't mind setting up a room to watch with someone else.Other big interests include fashion, photography and collecting dolls but this is getting long enough already so if you wanna know more feel free to add me! I'm willing to lead a conversation but carrying it alone is very tiring. I'm hoping to talk with nona's just as keen to form a close friendship as I am.>Are you a busy person or is it okay to contact you whenever?I'm a NEET and struggle with insomnia so I have a lot of free time and availability to be up even with conflicting timezones. Feel free to message when I'm offline or whenever really, I'll get back to you as and when I can."
   },
   "reply_225182": {
      "reply id": "225182",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 03:18:14 AM",
      "post content": ">tfw all the cool anons want 20+ friends but you're only turning 20 later this year "
   },
   "reply_225184": {
      "reply id": "225184",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 03:49:15 AM",
      "post content": ">ContactEsty#1978>TimezoneCentral US>Age18>Preferred age range for friendsany>Hobbies & Interests and other detailsi like music (epunk, breakcore, everything, int that vein), drawing, writing (journals, fiction, essays, anything that strikes my fancy if i have the motivation), reading, webdev (i have a website that is sporadically updated). also interested in marine biology (whales), carousels, vidja sometimes. everything everything i love life and i wish i coudl suck out the bone marrow of it.  i am very obsessed with my bf who doesnt really like me so expect me to sperg about this a lot>Are you a busy person or is it okay to contact you whenever?contact me whenever im online all the time and dont have a job"
   },
   "reply_225282": {
      "reply id": "225282",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 07:16:31 AM",
      "post content": ">Contactburnerknowher on wickr (i mainly use discord but i'm not putting that here)>TimezoneEDT>Age19>Preferred age range for friends18+>Hobbies & Interests and other detailsanimu, vidya, manga, anime figures, art/drawing, d&d, vocaloid, EDM, uhh drinking lol>Are you a busy person or is it okay to contact you whenever?i'm usually pretty busy but you can message me whenever, it just might be a while before i reply"
   },
   "reply_225294": {
      "reply id": "225294",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 10:51:14 AM",
      "post content": ">>225182I can't speak for other nona's but so long as you're mature I don't mind! I only specified 20+ since I've had some bad experiences with befriending younger girls before."
   },
   "reply_225297": {
      "reply id": "225297",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 11:30:43 AM",
      "post content": ">Contact dandellion7#7502 (throwaway account) >Timezone GMT +2 (It was changed today bc summer) >Age 19, I turn 20 this year >Preferred age range for friends 19-23, I don't mind younger if it's like 18, the same for older if it is only two years difference or so I speak Spanish mostly, so It would be nice to find someone who does as well >Hobbies & Interests and other details I like ttrpgs (tabletop gaming in general, I like pathfinder lore and DnD), creative writing (in Spanish), reading literature (mostly classical, though I can read recommendations), drawing (digital and traditional art), computer stuff, typology, Vocaloid (Japanese music in general is fine too, my fav artist is utsu-p), bullet journaling (mostly for tracking my reading habits and reviews), cooking and baking. >Are you a busy person or is it okay to contact you whenever? In the mornings I'm at uni. It's better to send me a message even when I might not answer immediately bc I will read it when I wake up. I don't mind the notifications."
   },
   "reply_225351": {
      "reply id": "225351",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 09:07:16 PM",
      "post content": ">>221437I'm 33, you're not alone"
   },
   "reply_225353": {
      "reply id": "225353",
      "username": "Anonymous",
      "date posted": "03/26/23 (Sun) 09:39:30 PM",
      "post content": ">>225351Same. I'd like some nona friends in my age range (25+)."
   },
   "reply_225453": {
      "reply id": "225453",
      "username": "Anonymous",
      "date posted": "03/27/23 (Mon) 05:51:07 PM",
      "post content": ">>225353I'm not online as much as I used to be, but I'm also looking for new friends.>Contact Hitagi#6304>TimezoneGMT +1>Age33>Preferred age range for friends25+, but I work with people in their early 20's so can make exceptions, you just might not find me all that interesting.>Hobbies & Interests and other detailsCooking/baking, going for walks, cats, League of Legends (casual), used to be big into anime but not as much these days, manga, otome games and currently playing Elden Ring for the 6th time. I work fulltime as a Game Designer.>Are you a busy person or is it okay to contact you whenever?I work Mon-Fri with flexi-time, but working hours are usually around 8am - 4:30pm."
   },
   "reply_225561": {
      "reply id": "225561",
      "username": "Anonymous",
      "date posted": "03/28/23 (Tue) 02:33:27 AM",
      "post content": ">ContactEGG#0528>TimezonePST (Pacific)>Age18>Preferred age range for friends17-20>Hobbies & Interests and other detailsDrawing, photography & playing video games>Are you a busy person or is it okay to contact you whenever?I'm usually free on Mondays and Tuesdays"
   },
   "reply_225629": {
      "reply id": "225629",
      "username": "Anonymous",
      "date posted": "03/28/23 (Tue) 04:25:17 PM",
      "post content": ">>218051>Contactmiri#5555>Timezonemidwest usa >Age19 >Preferred age range for friends18-21 it's ok if you are a bit older, but it may be hard to connect for me >Hobbies & Interests and other detailsi love cats (i have 7, mom had kittens!) rpg games, horror games, old DS games… I don't have a PC, I've been saving for one and nowhere close so don't expect me to play games with you. (I'd love to though!) i use tumblr and discord very often. i love music (making + listening) >Are you a busy person or is it okay to contact you whenever?I can be busy, but you can still contact me! I wouldn't be mad, especially if its more about general updates on your life instead of trying to get me to reply"
   },
   "reply_226003": {
      "reply id": "226003",
      "username": "Anonymous",
      "date posted": "03/29/23 (Wed) 04:41:28 PM",
      "post content": ">>225297Forgot to add a mail, for my non-discord nonas out there:[email protected]"
   },
   "reply_226516": {
      "reply id": "226516",
      "username": "Anonymous",
      "date posted": "04/01/23 (Sat) 08:20:43 PM",
      "post content": ">>225629your dc doesnt work :("
   },
   "reply_226702": {
      "reply id": "226702",
      "username": "Anonymous",
      "date posted": "04/02/23 (Sun) 07:24:10 PM",
      "post content": ">Contactnomeolvides#0888>TimezoneUS Central>Age22>Preferred age range for friendsAny>Hobbies & Interests and other details-Art. Mainly drawing and digital, trying to get more into painting-Reading-Horror movies/occult/paranormal/true crime/etc.-Fitness. I run, swim, and lift-Gardening/plants. I am planning on starting a functional garden, love indoor plants as well-Naturopathic health. Although I also believe in science-based-Any kind of science, language, and culture, I just love to learn about things. Majoring in STEM. >Are you a busy person or is it okay to contact you whenever?I work full-time and study. I also take care of my family a lot, so I am often very busy. I will reply ASAP though and would love to just be sent messages about anything going on in your life, things you've learned or experienced. I'm at a very lonely point in my life right now."
   },
   "reply_226725": {
      "reply id": "226725",
      "username": "Anonymous",
      "date posted": "04/02/23 (Sun) 11:30:24 PM",
      "post content": ">>225159Do you have an E-mail by any chance? I'm not very good at keeping up on Discord."
   },
   "reply_226997": {
      "reply id": "226997",
      "username": "Anonymous",
      "date posted": "04/04/23 (Tue) 11:45:15 PM",
      "post content": ">>226832I just want to say you sound really cool… we’re the same age but you already are so self-sufficient like living off-grid I wanna be like you someday…"
   },
   "reply_227299": {
      "reply id": "227299",
      "username": "Anonymous",
      "date posted": "04/06/23 (Thu) 01:06:48 AM",
      "post content": "I am so sorry if you saw my first post I accidently uploaded an image…>ContactMiserere Mei#0481I have matrix but idk if its worth posting.  Ask if you want it. >TimezoneEST>Age18>Preferred age range for friendsPreferably close in age to me (late teens) but I am open to talking to anyone.>Hobbies & Interests and other detailsI haven't engaged in some of these in a while because I have been kinda depressed but:<knitting and crochet, vintage in particular (biggest hobby)<Reading (barely sometimes I read in bursts of obsession though)<flute player (mediocre and primarily for school band throughout the years) <drawing <Diary writing (I haven't in a while but for about a year I obsessively recorded my every thought and have notebooks and notebooks full) Most of my time is spent online though. No friends (except my bf), I ghost a lot. Tbh I wouldn't mind kind of a \"pen pal\" relationship where we write long form letters to eachother through discord about our lives and multiple discussion topics at once. I have had friendships like this and it is nice because I have time to reflect on my response and its lower pressure. But we can talk real time too. I also enjoy hanging out in com/self harm/eating disorder discord servers, mostly because the lolcowery that goes on is absolutely hilarious and its fun to adopt fake epersonas.>Are you a busy person or is it okay to contact you whenever?I am very busy for the next 4 days but after that I will go back to having an abundance of freetime."
   },
   "reply_227856": {
      "reply id": "227856",
      "username": "Anonymous",
      "date posted": "04/10/23 (Mon) 12:22:23 AM",
      "post content": ">Contactmagiccarrot#0056>Age20>Preferred age range for friends18-25>Hobbies & Interests and other detailsI'm a STEM uni student who makes art in her free time. I enjoy reading (mostly non-fiction) and watching movies with others (hmu if you want to watch a movie in vc.)I struggle with depression and other health issues. I prefer cozy friends who are nice and nonjudgmental about these issues.>Are you a busy person or is it okay to contact you whenever?I'll reply when I'm able to."
   },
   "reply_227912": {
      "reply id": "227912",
      "username": "Anonymous",
      "date posted": "04/10/23 (Mon) 12:16:45 PM",
      "post content": ">Contactsayuri#5606>TimezoneCET>Age18>Preferred age range for friendsany as long as you're fine with my age too>Hobbies & Interests and other detailsgames (strategy + rpg mostly but very open, don't play much mp though), coding, embroidery (and any other arts n crafts its just what i actually do), fashion and clothes, i like music like anyone else, books, im leaning towards radfem ideas, happy to discuss any ideologies>Are you a busy person or is it okay to contact you whenever?it's okay to contact me whenever but don't get mad if i answer a bit late, but i like doubletexting and such, as long as we both care about the convo"
   },
   "reply_228803": {
      "reply id": "228803",
      "username": "Anonymous",
      "date posted": "04/17/23 (Mon) 04:31:31 PM",
      "post content": ">>225453I added you on discord, no pressure to accept of course but we're a similar age and I also work with game design and love otoge so it would be fun to connect!"
   },
   "reply_229828": {
      "reply id": "229828",
      "username": "Anonymous",
      "date posted": "04/25/23 (Tue) 08:13:15 PM",
      "post content": ">>221083>is 20>preferred age range 30+??"
   },
   "reply_230540": {
      "reply id": "230540",
      "username": "Anonymous",
      "date posted": "05/01/23 (Mon) 10:36:36 PM",
      "post content": ">Contact[email protected]If you have Telegram or Element, I might be more interested in talking to you more often>TimezonePacific Standard Time (PST)>Age18>Preferred age range for friends18-21>Hobbies & Interests and other detailsAs a hobby, I like to draw and play video games. Though coding still seems a little tacky to me, I'm becoming more invested in web design. The games I own that support multiplayer are Left4Dead2 and Minecraft. I also like playing Rhythm games!I mostly enjoy listening to Vocaloid. Witch-house and indie pop are the kind of music that I most frequently listen to. My favorite artists are Current Joys and Lil Darkie. Perfect Blue, Chobits, Future Diary, Elfen Lied, SEL, and Magica Madoka are just a few examples of the psychological anime I enjoy.>Are you a busy person or is it okay to contact you whenever?I'm not particularly busy. Since I'll soon be attending a university, I will. I'm ready to answer anytime you need me to! I'm trying to stay away from apps that use instant messaging, like Instagram or Discord. I don't want to associate with the brainless internet of today.Been working on caring about my privacy by deleting my accounts and such. I want to become a normie hehe"
   },
   "reply_230600": {
      "reply id": "230600",
      "username": "Anonymous",
      "date posted": "05/02/23 (Tue) 06:54:10 PM",
      "post content": ">ContactMatchi#8094>TimezoneUK>Age28>Preferred age range for friends25+ preferably closer to my own age or older though>Hobbies & Interests and other details/a/, /jp/, /cm/, /g/ and electronic music is probably the best way to explain it, add me if you want me to spam lewd anime boys at you lol, you'll find out my other specific interests through conversation but I don't have any \"normal\" hobbies that don't involve a computer. I'm very spergy especially to new people so I might be a bit much, I tend to say things that are hard to reply to without meaning to.>Are you a busy person or is it okay to contact you whenever?I'm a NEET so whenever but I can't guarantee instant replies all the time because I get distracted very easily/don't always have discord open."
   },
   "reply_230604": {
      "reply id": "230604",
      "username": "Anonymous",
      "date posted": "05/02/23 (Tue) 07:51:25 PM",
      "post content": ">>230600I don't do the discord thing but you seem great; almost makes me want to try it."
   },
   "reply_230647": {
      "reply id": "230647",
      "username": "Anonymous",
      "date posted": "05/03/23 (Wed) 03:10:32 AM",
      "post content": ">>230610kys"
   },
   "reply_230648": {
      "reply id": "230648",
      "username": "Anonymous",
      "date posted": "05/03/23 (Wed) 03:11:09 AM",
      "post content": ">>230647 samefagging but that scam comment is gone now, thanks to d mods <3"
   },
   "reply_230693": {
      "reply id": "230693",
      "username": "Anonymous",
      "date posted": "05/03/23 (Wed) 03:20:24 PM",
      "post content": ">Contactnyira#2443>TimezoneGMT +2>Age18>Preferred age range for friendsanything above 17 is fine>Hobbies & Interests and other detailsi like anime, reading, drawing, cooking and playing vidya. im also interested in coding and crafting (like sewing) but havent really gotten into it yet. i take interest in tons of things though>Are you a busy person or is it okay to contact you whenever?im not busy at all and will respond immediately unless im sleeping"
   },
   "reply_230798": {
      "reply id": "230798",
      "username": "Anonymous",
      "date posted": "05/04/23 (Thu) 06:46:19 AM",
      "post content": ">Contactsakurabloom#2485>TimezoneGMT+10>Preferred age range for friends18-30>Hobbies & Interests and other detailsanime and mmos, i like baking and reading too! have a bit of interest in coding but honestly happy to chat with whoever, we don't have to have aligning hobbies>Are you a busy person or is it okay to contact you whenever?it's okay to contact me whenever! but if i am focused on something i might not reply instantly, but i'll get back to you as soon as i see it :)"
   },
   "reply_231054": {
      "reply id": "231054",
      "username": "Anonymous",
      "date posted": "05/05/23 (Fri) 03:11:33 PM",
      "post content": ">>230798You should include your own age, just because you have a large age range doesn't mean others do"
   },
   "reply_231977": {
      "reply id": "231977",
      "username": "Anonymous",
      "date posted": "05/11/23 (Thu) 09:09:32 AM",
      "post content": ">>231302are you the australian cat artist?"
   },
   "reply_232099": {
      "reply id": "232099",
      "username": "Anonymous",
      "date posted": "05/11/23 (Thu) 11:56:52 PM",
      "post content": ">>231977nta but clearly not as her timezone is in eastern USA/Canada"
   },
   "reply_232183": {
      "reply id": "232183",
      "username": "Anonymous",
      "date posted": "05/12/23 (Fri) 01:47:14 PM",
      "post content": ">contactu gotta ask, i use discord>timezoneEST>age23>preferred age rangeidc just dont be a minor or scrote>hobbies & interestsanime/manga, cooking, singing, walking my dogs, subpar guitar player>am i busyi do work, but i have time to talk to you, you can message me whenever and ill respond to you within a few hours at maxscrotes and minors will be ignored/blocked instantly"
   },
   "reply_232331": {
      "reply id": "232331",
      "username": "Anonymous",
      "date posted": "05/13/23 (Sat) 03:17:53 AM",
      "post content": ">Contactdiscord is: golabki#1716>TimezoneCDT>Age20, birthday is soon lol>Preferred age range for friends18+>Hobbies & Interests and other detailsLifting, movies, reading, cooking, music. Slight interest in perfume and fashion, can play some instruments. I'm not into typical online things like anime and games. Current student in the trades. A little internet poisoned but aren't we all?>Are you a busy person or is it okay to contact you whenever?Not too busy, whenever is fine"
   },
   "reply_232511": {
      "reply id": "232511",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 02:13:12 PM",
      "post content": ">>232506I really liked it! I went into it with an expectation of it being off beat but it got bizarre for me too. The exploration of womens desire past the usual rom com formula was nice. It touched on ideals vs reality and managed to even be not entirely black and white for the one scene. I could relate to Erika with the general theme of repression and playing the piano, so there's some bias there."
   },
   "reply_232512": {
      "reply id": "232512",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 02:21:45 PM",
      "post content": ">>220982added u nona, im willing to do a vc to prove im not a moid"
   },
   "reply_232514": {
      "reply id": "232514",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 02:38:49 PM",
      "post content": "almost every anon I've added from here has ghosted me and I can't tell if it's a me problem or if it's just an online friendship thing tbh"
   },
   "reply_232521": {
      "reply id": "232521",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 05:09:49 PM",
      "post content": ">>232514probably because everyone is a nerd"
   },
   "reply_232529": {
      "reply id": "232529",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 06:30:45 PM",
      "post content": ">>232514happened to me too, it's just an online thing. I also found a lot of anons (not everyone) had difficulty carrying conversations in general, like just no questions in return."
   },
   "reply_232548": {
      "reply id": "232548",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 10:09:30 PM",
      "post content": ">>221333I'm 19,, but you sound cool… can i have ur contact plz"
   },
   "reply_232551": {
      "reply id": "232551",
      "username": "Anonymous",
      "date posted": "05/14/23 (Sun) 10:31:10 PM",
      "post content": ">ContactBlueberry#0709>TimezoneEST>Age19>Preferred age range for friendsONLINE: 18+OFFLINE: 18-25>Hobbies & Interests and other detailsI like sports, making art, hiking, cooking, gardening, reading old victorian books.. etc. I'd like to make some IRL cc frends too so if you're in New England hmu and we can climb the white mountains or go to the beach. >Are you a busy person or is it okay to contact you whenever?I check my disc every other day, if you want to text at weird times I'll reply as soon as I see themAND SCROTES, BTFO!!!!!!!!!!!!!!!!!!"
   },
   "reply_233122": {
      "reply id": "233122",
      "username": "Anonymous",
      "date posted": "05/18/23 (Thu) 03:00:38 AM",
      "post content": ">ContactStarfeu#9871 fuck it>TimezonePST>Age25>Preferred age range for friendsas long as youre 20+>Hobbies & Interests and other detailsRight now im too busy for stuff but i like reading and astrology. Used to like anime and gaming but its been subdued. Im always willing to listen to your problems. >Are you a busy person or is it okay to contact you whenever?contact with me whenever i am busy but ill try to  make time"
   },
   "reply_233159": {
      "reply id": "233159",
      "username": "Anonymous",
      "date posted": "05/18/23 (Thu) 08:06:40 AM",
      "post content": "I'm side-eyeing anons who want to meet up irl, please be careful everyone."
   },
   "reply_233390": {
      "reply id": "233390",
      "username": "Anonymous",
      "date posted": "05/18/23 (Thu) 04:28:23 PM",
      "post content": ">>233159>I'm side-eyeingPlease fuck off back to tiktok or write like a normal person"
   },
   "reply_233514": {
      "reply id": "233514",
      "username": "Anonymous",
      "date posted": "05/18/23 (Thu) 08:37:20 PM",
      "post content": ">>233390kek so easily pissed over nothing"
   },
   "reply_233515": {
      "reply id": "233515",
      "username": "Anonymous",
      "date posted": "05/18/23 (Thu) 08:38:35 PM",
      "post content": ">>233514this is how you know its a moid"
   },
   "reply_233654": {
      "reply id": "233654",
      "username": "Anonymous",
      "date posted": "05/19/23 (Fri) 04:50:25 PM",
      "post content": ">>233515It wouldn't be in a moid's interest to warn against meeting up irl smartass"
   },
   "reply_235355": {
      "reply id": "235355",
      "username": "Anonymous",
      "date posted": "06/01/23 (Thu) 11:18:17 PM",
      "post content": ">contacti dont wanna put my discord publicly, but you can email me your discord on [email protected] and i will add you>timezonegmt>age20>preferred age for friends18+>hobbiesi like coding, listening to music (all genres), learning guitar, drawing sometimes. Also watching movies, tv shows etc. I don't play much video games anymore though I don't mind picking one up every so oftenI really like venting about random things that annoy me or things I like, so if you are passionate and a good listener,  that'd be great (:If you are autistic and nice that's more than enough really.>Are you a busy person or is it okay to contact you whenever?Contact whenever. I might be busy some weeks, but don't feel like you would disturb me, as long as you are alright with not having instant replies all of the time lol"
   },
   "reply_237444": {
      "reply id": "237444",
      "username": "Anonymous",
      "date posted": "06/19/23 (Mon) 12:31:41 AM",
      "post content": ">ContactTheWitch#3350>Age20>Preferred age range for friends20+>Hobbies & Interests and other detailsVideo games, josei/horror manga, lurking dead imageboards, reading Wikipedia articles, losing my sanity. I rarely leave my house. I haven't been to class in a month.>Are you a busy person or is it okay to contact you whenever?Free whenever."
   },
   "reply_237699": {
      "reply id": "237699",
      "username": "Anonymous",
      "date posted": "06/22/23 (Thu) 10:53:02 PM",
      "post content": "middle east22i prefer ppl over 25my hobbies are : image boardsclair#1787"
   },
   "reply_237888": {
      "reply id": "237888",
      "username": "Anonymous",
      "date posted": "06/24/23 (Sat) 10:39:33 AM",
      "post content": ">>contacttato_5545 or Tato#5545>>time zone Ireland (GMT)>>age 20>> age range don’t care >> hobbies and interests animals, lolita fashion, games (my favourite is skyrim), pinkpilling normies, radiation and nuclear stuff, microbiology, music (kpop, metal, midwest emo, emo, post punk, darkwave, new wave)contact whenever!"
   },
   "reply_237901": {
      "reply id": "237901",
      "username": "Anonymous",
      "date posted": "06/24/23 (Sat) 04:39:33 PM",
      "post content": ">>227912Unfortunate sharing a name with an infamous brazilian troon."
   },
   "reply_237970": {
      "reply id": "237970",
      "username": "Anonymous",
      "date posted": "06/25/23 (Sun) 01:28:31 AM",
      "post content": ">contact sisterprincess on disc>timezoneEST>age20>preferred age range would prefer older than me but as long as you're an adult its fine!>hobbies2000s anime + manga, yuri, games (rpgmaker, horror, touhou, mobile rhythm games, etc), music (usually jpop, shibuya kei/picopop and denpa), lost media, bunnies!>busy or noi take constant naps everyday but i will always reply eventually"
   },
   "reply_238063": {
      "reply id": "238063",
      "username": "Anonymous",
      "date posted": "06/25/23 (Sun) 08:14:20 PM",
      "post content": ">Contactimnotnana.>TimezoneCET yea>Age22>Preferred age range for friendsbe at least 20>Hobbies & Interests and other detailsgaming, fitness, visual novels, maintaining a healthy lifestyle, daydreaming, gardening, y2k obsession, lolita fashion, kpop girl groups and just idols in general. im interested in producing music.>Are you a busy person or is it okay to contact you whenever?i work full-time but im quite available tbh !>more useless infonot to self advertise but im pretty friendly, supportive, loyal and a reliable friend. thank you for ur free time it aint coming back <//3"
   },
   "reply_238142": {
      "reply id": "238142",
      "username": "Anonymous",
      "date posted": "06/26/23 (Mon) 02:58:08 AM",
      "post content": ">Contactleftoutside#1966>Age19>Preferred age range for friends18+>Hobbies & Interests and other detailsgaming, VNs, BL, shoujo/josei manga, drawing, codingi get sad/anxious often;;>Are you a busy person or is it okay to contact you whenever?contact me whenever"
   },
   "reply_238186": {
      "reply id": "238186",
      "username": "Anonymous",
      "date posted": "06/26/23 (Mon) 07:06:24 PM",
      "post content": ">Contactdeathxy(no tag)>TimezonePST>Age18>Preferred age range for friends18+>Hobbies & Interestscats, plants, drawing, im boring ok>Are you a busy person or is it okay to contact you whenever?i dont care"
   },
   "reply_238242": {
      "reply id": "238242",
      "username": "Anonymous",
      "date posted": "06/27/23 (Tue) 12:13:41 PM",
      "post content": ">odd.ly on dis>gmt>30, any age is fine though>like ffxiv and other games, love cycling, physics, furbys, curious about egl and kpop>ok to contact whenever :)"
   },
   "reply_238255": {
      "reply id": "238255",
      "username": "Anonymous",
      "date posted": "06/27/23 (Tue) 05:32:05 PM",
      "post content": ">Contact [email protected] just send me dumb pics of random stuff on google chat since this is a throwaway>TimezonePST>Age32>Preferred age range for friends25+ to talk about being old and terminally online, but i'll accept 18+ if you want to talk about topics>Hobbies & Interests and other detailshobbies: basic weightlifting, riding my bike, bar soap, my small garden, coffee, tea, Japanese, stationary (Japanese pens, pencils, erasers), anime and mangaproductivity: improving my speaking voice, learning how to learn, memorizing things, how to stop being distracted, being less depressedlife skills: weight loss, keto, cookingtech: tech job, technical interview prepmusic: I just listen to Ariana Grande so let's not>Are you a busy person or is it okay to contact you whenever?not really busy, but am not supposed to reply too much 8AM-5PM."
   },
   "reply_238427": {
      "reply id": "238427",
      "username": "Anonymous",
      "date posted": "06/29/23 (Thu) 08:45:51 PM",
      "post content": ">Contactjjellyfish on disc>TimezoneGMT+2>Agetwenty-two>Preferred age range for friends20-40>About mehello! i'm josie, a university student based in europe. i live alone with my cat and when i'm not studying or working i like to play video games, watch movies/tv shows, listen/read books, go to museums, travel, and hang out with friends. some of my interests include psychology, politics, history, art, photography, music, philosophy, and animals!!* i mainly play valorant and overwatch 2 on european servers! but i am always open to try out new games with new friends <3* i'm a communist. if that's a problem for you, please do not contact. i am very open-minded, as long as you're not a nazi lol. >Are you a busy person or is it okay to contact you whenever?it's always ok to message me!! but it might take some time depending on my mood and energy :) currently working full-time and struggling a bit with chronic illness but i will try my best to get back to you on time"
   },
   "reply_238461": {
      "reply id": "238461",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 02:06:03 AM",
      "post content": ">contactimnotleon>timezone(UTC-3)>age20>preferred age rangeAround the same age or older>hobbies & interestsAnime/manga, gaming, sanrio, anime figure collecting, animated movies, lost media, drawing, cooking, reading books. >am i busyNot anymore, I have time to talk to you since I'm back to my NEET life.scrotes and minors will be ignored/blocked instantly"
   },
   "reply_238503": {
      "reply id": "238503",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 03:25:25 PM",
      "post content": ">>238106just so other nonas know, this is a moid"
   },
   "reply_238506": {
      "reply id": "238506",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 03:47:12 PM",
      "post content": ">>238503how do you know?"
   },
   "reply_238508": {
      "reply id": "238508",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 04:36:49 PM",
      "post content": ">>238506I contacted them and they said so."
   },
   "reply_238521": {
      "reply id": "238521",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 07:26:49 PM",
      "post content": ">>238508such a shame, those were nice interests."
   },
   "reply_238536": {
      "reply id": "238536",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 09:49:32 PM",
      "post content": ">>238523>cis womanYou can just say, y'know, 'woman', without the unnecessary filler."
   },
   "reply_238539": {
      "reply id": "238539",
      "username": "Anonymous",
      "date posted": "06/30/23 (Fri) 09:52:47 PM",
      "post content": ">>238521yeah, I really wish I could talk to other women about computer shit"
   },
   "reply_238721": {
      "reply id": "238721",
      "username": "Anonymous",
      "date posted": "07/02/23 (Sun) 03:52:18 PM",
      "post content": ">Contactvampifae on discord>TimezoneEST>Age20>Preferred age range for friends19-26 idrc though>Hobbies & Interests and other detailsI'm into drawing i would want to have an artist friend so we can draw everyday and improve, i play games (ffxiv,league,Minecraft etc etc) I'm big into kpop (girl groups ONLY) i would generally prefer if you was in the same time zone as me ^^ but not required! >Are you a busy person or is it okay to contact you whenever?can contact me whenever"
   },
   "reply_238908": {
      "reply id": "238908",
      "username": "Anonymous",
      "date posted": "07/04/23 (Tue) 05:23:00 PM",
      "post content": ">Contact[email protected]>TimezoneCET>AgeEarly 20s>Preferred age range for friends18-28>Hobbies & Interests and other detailsGacha games, fanfiction/writing, learning jap solely to enhance your game and fandom experience, sharing insights on normie and male behaviour from a speculative (armchair psych) viewpoint. I don't really have a lot of interests and keeping up a conversation isn't my thing, either, but let's give it a shot.>Are you a busy person or is it okay to contact you whenever?Considering that I provided an e-mail address, I'll read whatever you send when I get to it. So just contact me whenever and I'll respond when I figure out what sounds like a suitable response."
   },
   "reply_238933": {
      "reply id": "238933",
      "username": "Anonymous",
      "date posted": "07/05/23 (Wed) 05:21:55 AM",
      "post content": ">Contactoski#9594>Age20s>Preferred age range for friends20+>Hobbies & Interests and other detailsdepressed and paranoid, neetcoding, reading (non-fiction), manga (horror, seinen, and yuri), anything paranormal/thin foiling, armchair sociology/psychology, making houses in TS4, \"actual\" gaming, hating on scrotes, oscillating between self-improvement and absolute despair>Are you a busy person or is it okay to contact you free 24/7"
   },
   "reply_239035": {
      "reply id": "239035",
      "username": "Anonymous",
      "date posted": "07/05/23 (Wed) 11:35:37 PM",
      "post content": ">>230540The mail was useless! Here’s my discord @eggnood (Can’t believe Discord removed tags)UPDATE: I recently started playing Touhou and League. I’m starting to listen more Sigilkore and Vaportwitch music!"
   },
   "reply_239047": {
      "reply id": "239047",
      "username": "Anonymous",
      "date posted": "07/06/23 (Thu) 01:39:27 AM",
      "post content": ">>239035can you drop your matrix? i'd love to talk"
   },
   "reply_239049": {
      "reply id": "239049",
      "username": "Anonymous",
      "date posted": "07/06/23 (Thu) 02:27:08 AM",
      "post content": ">Contactlynny666 on discord>Timezoneest>Age18>Preferred age range for friendswhatever>Hobbies & Interests and other detailsRough breakup, new bf, feel like shit a lot. I like knitting crochet, especially vintage knitting. I like to write in a diary. I comfort myself by watching shitty 90s/00s romcoms. used to like more things but tbh having no energy to pursue them made me lose a lot of myself and my \"resumee\" is now pretty sparse, would be cool to be introduced to something new. I guess someone to shoot the shit with is mainly what i am looking for. I tend to ghost people when I feel overwhelmed or I get too hopeless to bother with friendship anymore and give up. >Are you a busy person or is it okay to contact you whenever?whenever."
   },
   "reply_239184": {
      "reply id": "239184",
      "username": "Anonymous",
      "date posted": "07/07/23 (Fri) 07:12:46 PM",
      "post content": ">Contact.euphoriac - Discord>TimezoneGMT+2>Age25>Preferred age range for friends18+>Hobbies & Interests and other detailsDeath, doom and black metal, Souls games, anime (mostly psychological). I want to get better at makeup and talk about clothes and alternative fashion. I like weight lifting.I have zero close friends so it might take some practice for me to open up. >Are you a busy person or is it okay to contact you whenever?whenever.Contact me whenever but I'm more likely to be online in the evenings."
   },
   "reply_239239": {
      "reply id": "239239",
      "username": "Anonymous",
      "date posted": "07/08/23 (Sat) 03:34:13 AM",
      "post content": "Neurotic shut-in weeb. I don't work or study, and I don't have friends besides my bf.I browse /dep/ a lot on wizchan, although I often feel uncomfortable due to the general misogynistic tone of the site.My hobbies include being the webmaster of a blog no one reads (don't ask me for the link), reading manga and memoirs, browsing random Wikipedia articles, watching 2+ hours long YT videos about niche topics, playing videogames, and researching suicide methods.I just want someone outside my immediate family/romantic partner to wish me a happy birthday. The passing time feels more oppressive than ever.@chakai:matrix.org"
   },
   "reply_245653": {
      "reply id": "245653",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 05:12:02 AM",
      "post content": "Anyone else have a really mediocre time adding anyone off here? they either never accept the FR, ghost, or later delete their account and all their sent messages without warning for no reason. Most you get is maybe one decent conversation out of it but most of the time you don't even get that. It's kind of blackpilling me on the whole 'women can't hold a conversation/women can't be friends' view incels tend to have. Every experience I've had on here has proven that true."
   },
   "reply_245665": {
      "reply id": "245665",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 06:23:28 AM",
      "post content": ">>245653>>245659I actually had similar problems so I'm not sure it's just her, did you make a post yourself nona?"
   },
   "reply_245667": {
      "reply id": "245667",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 06:25:53 AM",
      "post content": ">>245653I have no idea why you would think randoms on the internet not returning your messages means women can't speak to each other or be friends, that's a really weird conclusion."
   },
   "reply_245673": {
      "reply id": "245673",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 06:32:32 AM",
      "post content": ">>245653this is every online connection ever. very few last and it has nothing to do with the gender of the people involved. women ghost males and other women alike, and men ghost scrotes. the latter don't ghost women because they want to get into their pants, but ive seen that happen a few times as well. having said that, it is true that women tend to ghost in general more than men, usually because they tend to have more romantic and friendship prospects so they don't hang on to specific people the same way. friendship between women exists, and it survives even in an environment that wants desperately to destroy it. men don't like when women stick together. for that reason alone, our friendship is stronger than the one of males, because it thrives despite adversity. don't give up in finding a friend nona!"
   },
   "reply_245692": {
      "reply id": "245692",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 07:20:38 AM",
      "post content": ">>245676I don't think I'd feel comfortable posting them in the thread, as they're mostly fairly normal and ghosting or deleting an account can happen for all kinds of reasons, but I guess you could post a throwaway mail address and we could see if it happened with the same people or something?"
   },
   "reply_245695": {
      "reply id": "245695",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 07:25:21 AM",
      "post content": ">>245653I've had luck making friends in this thread. Making friends randomly like this is hard, both sides need to put in effort, and it is emotionally tiring.Just have to put in the effort and hope the other side does the same."
   },
   "reply_245700": {
      "reply id": "245700",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 07:30:48 AM",
      "post content": ">>245653I never added people from friend finder threads but I had more luck befriending nonas from group discords if that's your thing. In my case I know I suck at one on one conversations, especially in the getting to know each other phase."
   },
   "reply_245703": {
      "reply id": "245703",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 07:54:22 AM",
      "post content": ">>245653yes. I met some nice women that I had good conversation with for awhile and then they randomly ghosted, talked to one weird troon that freaked out, and a couple of women that seemed mentally off in a bad way. seconding what >>245700 says, I joined some women only discords from here and lc and was able to make friends there."
   },
   "reply_245708": {
      "reply id": "245708",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 10:39:34 AM",
      "post content": ">>245659Problem with that is, it's a two way street. I can be putting all the effort in the world into a convo and if all I get back from the other party are NPC-tier responses it's gonna feel like pulling teeth to keep it going. Even outside of here, when trying to befriend nona's online it often always falls down to me to initiate or talk for the both of us and it's really shitty."
   },
   "reply_245741": {
      "reply id": "245741",
      "username": "Anonymous",
      "date posted": "07/17/23 (Mon) 05:06:56 PM",
      "post content": ">Contacthydrangeae>TimezoneCET>AgeEarly 20s.>Preferred age range for friends20+>Hobbies & Interests and other detailsToo many to properly list, but main ones would be art (especially digital), weebshit (mostly the occasional anime and aesthetic now, though I want to get back into VNs), going down internet rabbit holes, consooming both pretty bad and objectively good movies and discovering new music (very open to recommendations). I enjoy both writing wall of texts and doing stuff together while VCing a lot, so nonas who also like communicating in either of those ways are very welcome!>Are you a busy person or is it okay to contact you whenever?I might not always be the fastest at replying initially, but if we click I'll be around often."
   },
   "reply_245810": {
      "reply id": "245810",
      "username": "Anonymous",
      "date posted": "07/18/23 (Tue) 07:50:02 AM",
      "post content": ">ContactDiscord becca9794>TimezoneUTC -4, up at odd hours a lot of the time though>Age30>Preferred age range for friends25+ but it doesn't matter that much>Hobbies & Interests and other detailsimageboards, birds, streetwear, biohacking, WoW. I know it's a long shot but if anyone here is on EU servers and wants to play together feel free to add me. I've been playing solo 99% of the time for years and wouldn't mind having someone to play with at least occasionally>Are you a busy person or is it okay to contact you whenever?Just contact whenever"
   },
   "reply_245811": {
      "reply id": "245811",
      "username": "Anonymous",
      "date posted": "07/18/23 (Tue) 08:04:59 AM",
      "post content": "I'm too shy to ever post in these threads."
   },
   "reply_245821": {
      "reply id": "245821",
      "username": "Anonymous",
      "date posted": "07/18/23 (Tue) 09:48:38 AM",
      "post content": ">Contactgungus9919>TimezoneEST>Age20>Preferred age range for friends18+>Hobbies & Interests and other detailslit, all things beauty, fitness, and occasionally vidya. would appreciate a fellow nona that enjoys reading >Are you a busy person or is it okay to contact you whenever?contact whenever, it would be nice to make a friend off of here"
   },
   "reply_245856": {
      "reply id": "245856",
      "username": "Anonymous",
      "date posted": "07/18/23 (Tue) 04:21:23 PM",
      "post content": ">>245811But you just did, nona."
   },
   "reply_245876": {
      "reply id": "245876",
      "username": "Anonymous",
      "date posted": "07/18/23 (Tue) 11:58:12 PM",
      "post content": ">>245653admitting that I myself have ghosted a girl on here after she was the most boring and weird/creepy person I've chatted with in a while. asking probing questions, lied about her age in the thread, and being judgemental/rude to me.just you know, if you're wondering why you were ghosted, anyone here, maybe look over the way you conducted yourself.also adding that all the other girls I tried to add/talk to  never replied so not trying to invalidate your experience, nona. I just think a lot of the girls here are severely out of practice with socializing."
   },
   "reply_245878": {
      "reply id": "245878",
      "username": "Anonymous",
      "date posted": "07/19/23 (Wed) 12:13:49 AM",
      "post content": ">Contact [email protected]>TimezoneMST>AgeLate 20s>Preferred age range for friends25-40>Hobbies & Interests and other detailsOld school CRPGs, TTRPGs, Goth/Industrial/Visual Kei/Dungeon Synth music, Otome games, vampires, edgy stuff, mythology, history, animals, nature, occult, cryptids, horror stuff, old web stuff, 90s and early 2000s TV and culture>Are you a busy person or is it okay to contact you whenever?I'm busy so I would prefer someone who isn't needy and would like to share substantial messages and won't get hurt if I take a while to respond. If you email me, tell me about yourself and if you have any interests the same with me. Please lead with an interesting hook- I'm the kind of person who likes to skip small talk and start talking about interesting things. If we email for a while we can discuss other ways to chat."
   },
   "reply_245945": {
      "reply id": "245945",
      "username": "Anonymous",
      "date posted": "07/19/23 (Wed) 05:54:26 PM",
      "post content": ">>245653I'm someone who posted on here a while ago and had a few people add me. The majority of them were really bad at communicating e.g. gave one-word replies but wouldn't initiate any kind of conversation in return. It got dull and I gave up. There were 1-2 people who did actually engage in conversations that I feel bad about not getting back in touch with, so I'm sorry if you're still here. I made a throw-away discord account and never went back on it. To the couple of people who I had a meaningful conversation with, I hope that you're doing well."
   },
   "reply_245947": {
      "reply id": "245947",
      "username": "Anonymous",
      "date posted": "07/19/23 (Wed) 07:26:38 PM",
      "post content": ">>245876I tend to only click with people who are weird/have unconventional conversational styles like this. It's not that I prefer it or anything but I think I'm too autistic for normal casual conversation and these types \"disarm\" me quicker if it makes sense. If anyone relates hmu"
   },
   "reply_245984": {
      "reply id": "245984",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 07:10:27 AM",
      "post content": ">>245945Conversations are a two way street you can't blame yourself if an anon doesn't reciprocate"
   },
   "reply_245999": {
      "reply id": "245999",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 01:42:47 PM",
      "post content": ">>245876>just you know, if you're wondering why you were ghosted, anyone here, maybe look over the way you conducted yourself.god I fucking hate this nu-age mantra of 'if people are consistently shitty to you, maybe it's your own fault!'As if the majority of people aren't naturally self-absorbed and inconsiderable towards the needs of others. What is this obsession with people thinking those with consistently negative experiences/who get dogpiled probably did something to deserve or warrant it? Self-reflection is important but sometimes people really are shitty for no reason and yes it can happen to the same person a lot whilst being wholly unwarranted. Karma doesn't exist. People like to pretend it does."
   },
   "reply_246004": {
      "reply id": "246004",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 02:59:32 PM",
      "post content": ">Contact[email protected]>TimezoneEEST (Eastern Europe)>Age20>Preferred age range for friends20 or older, but I don't think older nonas will have much to talk about with me>Hobbies & Interests and other detailsI am neck deep in feminist circles online, play vidya sometimes (rare), I write a lot and I like other artsy stuff, such as drawing or editing or making silly little memes for frens (consider; could be you!). I sneakily publish only about 1% of it, though.  Kind of floating in life without solid ground to stand on because of a shitty upbringing. IRL very depressive but trying my best not to bend, so if any nonas can relate, please do send me a message and we could uplift each other <3PLEASE DON'T ADD IF YOU'RE AMERICAN, STAY AWAY YOU CREATURE>Are you a busy person or is it okay to contact you whenever?Not busy, but might take a bit of time to respond depending on the topic and my mental health. Also, I will gladly move to another platform (Discord probably) once I am sure I am talking to an actual woman and not a wandering male who got lost. I understand that emails are not very convenient, just want to stay safe!"
   },
   "reply_246005": {
      "reply id": "246005",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 03:02:27 PM",
      "post content": ">>246004Why do you hate american s?"
   },
   "reply_246006": {
      "reply id": "246006",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 03:08:37 PM",
      "post content": ">>246005No offense nona, but they're borderline retarded, sometimes outright retarded. There's something wrong with the entire continent (Canada included)."
   },
   "reply_246007": {
      "reply id": "246007",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 03:14:08 PM",
      "post content": ">>246006It's not my fault I was born in this shithole"
   },
   "reply_246008": {
      "reply id": "246008",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 03:15:59 PM",
      "post content": ">>246006>Canada includedBased. Canada simping is annoying. The Canadians I talked to were even worse than Americans. I wouldn’t even say the problem is being retarded, but most Americans have a shit upbringing, are surrounded by people with the most crazy views and don’t care to better themselves, so many of them don’t have manners and have the weirdest, out of touch with reality views"
   },
   "reply_246019": {
      "reply id": "246019",
      "username": "Anonymous",
      "date posted": "07/20/23 (Thu) 04:36:55 PM",
      "post content": ">>239239i added you, i think"
   },
   "reply_246152": {
      "reply id": "246152",
      "username": "Anonymous",
      "date posted": "07/21/23 (Fri) 11:18:22 PM",
      "post content": ">>246149pavlov i told you not to post on crystal cafe"
   },
   "reply_246160": {
      "reply id": "246160",
      "username": "Anonymous",
      "date posted": "07/22/23 (Sat) 12:37:37 AM",
      "post content": ">>246008Can we talk about Canadian Nazis that start political careers in America?"
   },
   "reply_246536": {
      "reply id": "246536",
      "username": "Anonymous",
      "date posted": "07/26/23 (Wed) 03:45:07 PM",
      "post content": ">>231302If you're still here, are you OK with someone who'll turn 27 in under a month?"
   },
   "reply_246910": {
      "reply id": "246910",
      "username": "Anonymous",
      "date posted": "07/27/23 (Thu) 07:26:34 PM",
      "post content": "Haven't really had much luck in this thread. Met some really cool nonas, but nothing ever sticks."
   },
   "reply_246972": {
      "reply id": "246972",
      "username": "Anonymous",
      "date posted": "07/27/23 (Thu) 11:13:06 PM",
      "post content": ">ContactFawnatree>TimezonePST >Age24>Preferred age range for friendsPreferably above 18>Hobbies & Interests and other detailsDrawing,sewing, and nature>Are you a busy person or is it okay to contact you whenever?I’m am available to msg anytime but I am sometimes busy (btw I’m not looking for any guys)"
   },
   "reply_247615": {
      "reply id": "247615",
      "username": "Anonymous",
      "date posted": "07/30/23 (Sun) 11:07:28 PM",
      "post content": ">>245878I sent you an email the day you posted this; I know you said it may take a while to respond but I can't help but wonder if my email got caught in your spam filter. Also, if you just aren't interested in corresponding with me, which is fine, please let me know so that I am not needlessly checking that email for the next three months lol. Anyway, just informing you that I reached out, I hope you are doing well."
   },
   "reply_247666": {
      "reply id": "247666",
      "username": "Anonymous",
      "date posted": "07/31/23 (Mon) 03:55:54 AM",
      "post content": ">>247615Hi nona, I did see your email, I'm sorry for not replying yet I hit a really busy time working and I didn't want to send a half baked response. I'll email you back tomorrow, I have the day off, I am setting an alarm on my phone so I won't forget."
   },
   "reply_247667": {
      "reply id": "247667",
      "username": "Anonymous",
      "date posted": "07/31/23 (Mon) 04:33:46 AM",
      "post content": ">>247666That's understandable, take your time, I'm just happy to know that you actually received the email."
   },
   "reply_247964": {
      "reply id": "247964",
      "username": "Anonymous",
      "date posted": "08/02/23 (Wed) 06:28:32 PM",
      "post content": ">Contact0718392 on discord>Timezonemountain time>Age22>Preferred age range for friends20+>Hobbies & Interests and other detailsbig music fan (electronic, breakcore, industrial, 40s-60s country, old-timey crooners, folk, singer/songwriter, 80s-90s pop, post-punk/goth, techno, noise, power electronics, ska, 80s punk, gabber, doom metal.. virtually everything ok), weightlifter - not competitive or following a sport but I keep hitting bigger numbers for shits and giggles and work hard on diet to keep up with that, hiker/runner also because I love my husky and he's a great buddy for it. Essentially very physically active and people who can muse about gym/activity wins with me are a plus. I've also got two kitties who are great company in the office and when I settle down to read or work on school. I love reading but nowadays mainly I read non-fiction and research articles, I still make time for classic novellas and novels though. I love everything Jim Henson and Gremlins, I really enjoy cooking. Currently learning and prepping for outdoor survivalism, foraging, and backpacking but it's been way too hot to get myself out doing that as of late. I love traditional tattoos, piercings, and body mods as well. I have diagnosed autism and ADHD.>Are you a busy person or is it okay to contact you whenever?I am pretty busy between college, work, being an outdoorsy gym rat, and being engaged with three animals to care for! It's absolutely okay to contact me whenever though.. the internet is my safe space so I always make time for browsing and chatting online, I suck at making friends irl so I really just have my fiance"
   },
   "reply_248135": {
      "reply id": "248135",
      "username": "Anonymous",
      "date posted": "08/05/23 (Sat) 11:44:26 AM",
      "post content": ">Contact[email protected]>Timezoneeest>Age18>Preferred age range for friends18-25, deviations possible>Hobbies & Interests and other details- music (aphex twin, nujabes, crystal castles, yves tumor, death grips, dean blunt, assorted dnb/electronic/idm/ambient/indie rock), mostly listening but i really want to find motivation to learn piano;- fashion;- linux and programming (occasionally); - mathematics; - neuroscience; - astrology; - watching random 40 minute documentaries on youtube; - taking walks, traveling into new places, escaping my city;- trying to fix myself with antidepressants and benzos right now, trying to abstain from substance use (except for a few \"safe\" things, I guess);- psychonautics but that is put on pause;- learning German;- trying to survive a month in my shit hole city before moving to Germany. just looking for something interesting mostly, something that would light me up. there are few things like that.>Are you a busy person or is it okay to contact you whenever?whenever. i'll reply whenever as well, it could be a day, a week, a month. i should say i'm unstable, i have mental problems, but i'm also lonely. you can text me whatever and i'll probably reply, i also don't expect you to be quick with responses."
   },
   "reply_248178": {
      "reply id": "248178",
      "username": "Anonymous",
      "date posted": "08/05/23 (Sat) 05:43:43 PM",
      "post content": ">>248135>i should say i'm unstable, i have mental problemsKEK this whole post"
   },
   "reply_249163": {
      "reply id": "249163",
      "username": "Anonymous",
      "date posted": "08/14/23 (Mon) 08:48:54 PM",
      "post content": ">>245741You seem cool anon, I sent a request."
   },
   "reply_250474": {
      "reply id": "250474",
      "username": "Anonymous",
      "date posted": "08/25/23 (Fri) 07:34:17 PM",
      "post content": ">ContactDiscord: passedthebeans>TimezoneEST>Age26>Preferred age range for friends20 or older>Hobbies & InterestsI love reading (books about mysticism/ancient religions), tarot, anime, tiny trinkets, SUCCULENTS, and music (jazz, drum & bass, pretty much anything)."
   },
   "reply_250475": {
      "reply id": "250475",
      "username": "Anonymous",
      "date posted": "08/25/23 (Fri) 07:35:24 PM",
      "post content": ">>250474also, I am not very busy right now and will keep an eye out for your message (:"
   },
   "reply_250478": {
      "reply id": "250478",
      "username": "Anonymous",
      "date posted": "08/25/23 (Fri) 07:48:20 PM",
      "post content": ">>250475I just added yooou"
   },
   "reply_250562": {
      "reply id": "250562",
      "username": "Anonymous",
      "date posted": "08/26/23 (Sat) 11:32:16 PM",
      "post content": ">Contact_lunyx_>TimezoneEuropean>Age30>Preferred age range for friends24+>Hobbies & Interests and other detailsWriting, lurking, brainstorming. Linguistics scratch that brain itch for me, when words hit just right. Kind of into politics, but as an observer. Mellow personality with surprising views. INTP.>Are you a busy person or is it okay to contact you whenever?I'm a NEET."
   },
   "reply_250652": {
      "reply id": "250652",
      "username": "Anonymous",
      "date posted": "08/28/23 (Mon) 02:21:50 AM",
      "post content": ">>218051>Contactdiscord: @novadeathless (Throwaway account)>Timezone(GMT -6)>Age22>Preferred age range for friends+20>Hobbies & Interests and other detailsI like to draw and do 3d modeling, but I also enjoy playing vidya (MMO'S, shooters, or comfy games) and watching movies with friends. Simply I enjoy goofing around and doodle>Are you a busy person or is it okay to contact you whenever?A little bit busy because I'm in the last semester of college, but I can dedicate time to chat"
   },
   "reply_250742": {
      "reply id": "250742",
      "username": "Anonymous",
      "date posted": "08/28/23 (Mon) 09:06:50 AM",
      "post content": ">Contact[email protected]>TimezonePST>Age18>Preferred age range for friendsany age>Hobbies & Interests and other detailsI don't think I have any hobbies or interests. I read wikipedia articles when I'm bored sometimes.>Are you a busy person or is it okay to contact you whenever?I'm never busy and always online. You can contact me whenever."
   },
   "reply_250906": {
      "reply id": "250906",
      "username": "Anonymous",
      "date posted": "08/29/23 (Tue) 01:44:04 PM",
      "post content": ">>250562I added you, assuming that's your discord tag!"
   },
   "reply_251110": {
      "reply id": "251110",
      "username": "Anonymous",
      "date posted": "09/01/23 (Fri) 03:30:05 PM",
      "post content": ">Either too young (20<) or too older (30+)>Outside of NA>Normie hobbies or doesn't list any hobbies I have in common>discord tag is dead (because of discords tag change) or never adds back, never get replies to the 2 people I emailedIt's so tiresome. Even when I do successfully add someone then end up being really dull and unable to hold a conversation or reveal themselves to be normies or the type of person who thinks posting memes constantly instead of engaging in conversations is a better way to communicate. I'm at my wits end. I'm not trying to have high standards but so many people just suck and are either normies or incapable of communicating properly. I have so little hope."
   },
   "reply_251111": {
      "reply id": "251111",
      "username": "Anonymous",
      "date posted": "09/01/23 (Fri) 03:33:47 PM",
      "post content": ">>251110I'm actually curious what is a normie hobby? Is a normie just someone who isn't hikkineet? I've always assume a normie is just someone who participates in society/is not neet"
   },
   "reply_251114": {
      "reply id": "251114",
      "username": "Anonymous",
      "date posted": "09/01/23 (Fri) 04:42:02 PM",
      "post content": ">>251111Anything outgoing, really vague things that aren't really a hobby (i.e. gardening, nature, etc) which I don't have a problem with but when someone lists that as their hobby/interests it just screams \"uninteresting normie to me\"im being overly bitter here but I just don't want to bother with people that likely have an active social life and don't understand the genuine struggles of a complete and utter loser who has never had any positive irl relations"
   },
   "reply_251146": {
      "reply id": "251146",
      "username": "Anonymous",
      "date posted": "09/02/23 (Sat) 02:34:42 AM",
      "post content": ">>251114>the genuine struggles of a complete and utter loser who has never had any positive irl relationsPeople like this are unlikely to make a post in this thread. I certainly wouldn't, because as a fellow loser there is nothing I hate more than talking about myself. You just can't win."
   },
   "reply_251148": {
      "reply id": "251148",
      "username": "Anonymous",
      "date posted": "09/02/23 (Sat) 02:46:32 AM",
      "post content": ">>251146You can just have conversations about shared interests not personal things. I talk to some imageboard femanons and we usually just share and discuss things that are more impersonal."
   },
   "reply_251367": {
      "reply id": "251367",
      "username": "Anonymous",
      "date posted": "09/05/23 (Tue) 02:40:32 PM",
      "post content": ">>251110This. I thought being on an women's imageboard would mean I'd find more women who are internet losers with interesting niche interests and aren't normies like me but it's the fucking opposite, everyone is the kind of normie I want to get away from and if I do share interests with them they're extremely vapid and predictable. If I even get to the stage of having a conversation with them I can't hold it because I can only pretend to be someone I'm not and small talk for so long, and that's if they don't fucking randomly ghost me in the middle of that conversation as well. All it does is remind me why I should continue to defy my human need to be social and not bother with friendships."
   },
   "reply_251370": {
      "reply id": "251370",
      "username": "Anonymous",
      "date posted": "09/05/23 (Tue) 04:15:35 PM",
      "post content": ">>251110>>251367this makes me feel better about ignoring this thread entirely"
   },
   "reply_251433": {
      "reply id": "251433",
      "username": "Anonymous",
      "date posted": "09/05/23 (Tue) 11:17:15 PM",
      "post content": ">>251146This, the only people who post in this thread are either attention whores or normie-tier."
   },
   "reply_251435": {
      "reply id": "251435",
      "username": "Anonymous",
      "date posted": "09/05/23 (Tue) 11:24:02 PM",
      "post content": "do you think if I messaged some of the anons from older posts, they would reply? I made a discord so I could befriend people from the thread but it seems I have only received messages from moids."
   },
   "reply_251438": {
      "reply id": "251438",
      "username": "Anonymous",
      "date posted": "09/05/23 (Tue) 11:31:13 PM",
      "post content": ">>251435The older posters probably changed their tags already."
   },
   "reply_252102": {
      "reply id": "252102",
      "username": "Anonymous",
      "date posted": "09/08/23 (Fri) 08:38:22 PM",
      "post content": "This thread is really disappointing I was hoping to make more female friends, but it feels like a lot the women don’t like initiating conversations themselves or just end up ghosting randomly"
   },
   "reply_252185": {
      "reply id": "252185",
      "username": "Anonymous",
      "date posted": "09/09/23 (Sat) 03:00:06 AM",
      "post content": ">>252102Same I added someone I thought I would click with and I really thought we got along but then she just stopped replying after only like 2 days kek…"
   },
   "reply_252213": {
      "reply id": "252213",
      "username": "Anonymous",
      "date posted": "09/09/23 (Sat) 08:28:05 AM",
      "post content": ">>252185sorry nona, I'm pretty sure that was me. I just never ended up going back on that discord account again."
   },
   "reply_252279": {
      "reply id": "252279",
      "username": "Anonymous",
      "date posted": "09/09/23 (Sat) 02:55:36 PM",
      "post content": ">>252102I tried adding 2 nonas I really looked forward to chatting with based on their description but neither ended up accepting. If anything this thread made me feel more lonely."
   },
   "reply_252418": {
      "reply id": "252418",
      "username": "Anonymous",
      "date posted": "09/10/23 (Sun) 04:58:18 PM",
      "post content": ">>232551I'm locked out of this discord so don't bother sending a req"
   },
   "reply_252442": {
      "reply id": "252442",
      "username": "Anonymous",
      "date posted": "09/10/23 (Sun) 09:15:25 PM",
      "post content": ">>219621https://incels.is/threads/ill-never-know-a-girls-love.414066/"
   },
   "reply_252453": {
      "reply id": "252453",
      "username": "Anonymous",
      "date posted": "09/11/23 (Mon) 12:25:25 AM",
      "post content": ">>252442wait it that a moid? kek, how'd you find that"
   },
   "reply_252456": {
      "reply id": "252456",
      "username": "Anonymous",
      "date posted": "09/11/23 (Mon) 12:55:03 AM",
      "post content": ">>252453not her but it shows up if you search that nick on google"
   },
   "reply_252484": {
      "reply id": "252484",
      "username": "Anonymous",
      "date posted": "09/11/23 (Mon) 06:46:10 AM",
      "post content": ">>252456Maybe she used a website that checks what that email is connected to"
   },
   "reply_252593": {
      "reply id": "252593",
      "username": "Anonymous",
      "date posted": "09/11/23 (Mon) 11:29:41 PM",
      "post content": ">>252453>>252456>>252484the username is the exact same as the email…"
   },
   "reply_253059": {
      "reply id": "253059",
      "username": "Anonymous",
      "date posted": "09/18/23 (Mon) 09:46:57 PM",
      "post content": ">Contactdiscord: Yurats>TimezoneGMT (BST right now)>Age23>Preferred age range for friendsany age, though ideally be 18-28. I won't judge if you're older.>Hobbies & Interests and other detailsHuge history autist, but I also like to cook, read (non-history), I enjoy art but am terrible at it, I like films and tv to the point that I can be a little pretentious about it, and I guess a bunch of other normie \"interests\" to a decent degree.>Are you a busy person or is it okay to contact you whenever?I'm pretty much always online in one way or another, so if you message me I will get back to you almost certainly on the same day."
   },
   "reply_253517": {
      "reply id": "253517",
      "username": "Anonymous",
      "date posted": "09/23/23 (Sat) 01:41:04 PM",
      "post content": ">>252102I don't get these posts we always get in friend finders threads. Out of all the people you get to meet during your life, how many of them will end up being your friends? Well, not many. It works the online. However, online people have no incentive to reply to your messages, unlike in a real life setting (school, work) where it's deemed unnapropriate to do so. Out of all the women I've added from here, I still talk to one on a daily basis, and I'm happy to have made a good online female friend, in spite of everything.>Contact[email protected]>Timezonewestern europe>Preferred age range for friendsdon't care as long as you're not a twitter/itktokbrain spastic>Hobbies & Interests and other detailsI like j-fashion and historical, art and tactical video games! I'm very much into paranormal ayylien and esoteric schizo shit too."
   },
   "reply_254269": {
      "reply id": "254269",
      "username": "Anonymous",
      "date posted": "10/03/23 (Tue) 08:03:40 AM",
      "post content": ">Contactfinalgirliepop on discord!>TimezoneEST>Age22>Preferred age range for friends20-25>Hobbies & Interests and other detailsi like movies a lot, especially horror movies!! i like star trek and my cat. i'm a lesbian and i still use tumblr. i'm also a radical feminist and a misandrist lol>Are you a busy person or is it okay to contact you whenever?im a total loser so contact me whenever!!"
   },
   "reply_254347": {
      "reply id": "254347",
      "username": "Anonymous",
      "date posted": "10/04/23 (Wed) 10:02:49 PM",
      "post content": "I love alternative music (goth, metal, midwestern emo) and non-fiction. I write fanfics and draw. I consume manga and vidya, mostly FPS and management. I code for fun.I'm a diagnosed sperg and currently deep into NEETdom, have been trying (and failing) to quit for 3+ years.I would love to chat with anons.>tagsourred"
   },
   "reply_254368": {
      "reply id": "254368",
      "username": "Anonymous",
      "date posted": "10/05/23 (Thu) 06:01:26 AM",
      "post content": ">Contactdisc is dobie1638102>TimezonePST>Age19>Preferred age range for friends18-29, upper bound negotiable>Hobbies & Interestsi like to draw! love music of any kind, terrible at finding it tho. love interior decorating on ts4 and browsing fb marketplace, love love talking abt loz, trying to become a pretentious lit girl rn so currently knees deep in books (dostoevsky lover, just finished my year of rest and relaxation and my next read is going to be kafka on the shore). also rly into radfem and feminist-adjacent lit! i want movie recs too>Are you a busy person or is it okay to contact you whenever?constantly online :))"
   },
   "reply_254385": {
      "reply id": "254385",
      "username": "Anonymous",
      "date posted": "10/05/23 (Thu) 01:44:36 PM",
      "post content": ">>218051>Contact[email protected]>TimezoneCET but I'm nocturnal most of the time >Age23>Preferred age range for friends22-30>Hobbies & Interests and other detailsKind of a loser lmao, I've been real deep into neetdom most of my life, now in my extroverted arc (not really lmao I'm just trying to be a functioning social human being). Still trying to figure out what to do with my life, wasted tons of time doing absolutely jack shit and being scared of the world. I love discovering new music, I dabble in vidya but I never finish them, I used to watch a lot of movies, tv shows, anime and read mangas when I was younger but now not as much. I would love to learn to code so having a friend who already knows how to would be cool. I'm kind of looking for someone who has been a friendless neet for a long time like me and understands so we can relate>Are you a busy person or is it okay to contact you whenever?Not really busy you can contact me whenever"
   },
   "reply_255028": {
      "reply id": "255028",
      "username": "Anonymous",
      "date posted": "10/15/23 (Sun) 07:39:50 PM",
      "post content": ">>255024aren't you trans?"
   },
   "reply_255029": {
      "reply id": "255029",
      "username": "Anonymous",
      "date posted": "10/15/23 (Sun) 07:57:26 PM",
      "post content": ">>255024kys tranny"
   },
   "reply_255036": {
      "reply id": "255036",
      "username": "Anonymous",
      "date posted": "10/15/23 (Sun) 10:39:31 PM",
      "post content": "Last time I did this I did find a gf/friend so I will give it a try again:>Contactkek#5453>TimezoneUTC-06>Age25>Preferred age range for friendsWhatever is fine>Hobbies & Interests and other details- CS master's student- Autistic about yuri- Pro-loonix- Kinda /pol/tarded (I'm sorry)- Mildly libertarian- Anime/manga/LNs/VNs (at this point mostly yuri though)- Vidya mostly on PC (\"realistic\" shooters like RoR2/Rising Storm, classic RTS, strategy, grand strategy, rythm, open world RPG, doto)- Airsoft- Riichi mahjong- Can discuss history/politics if you don't mind inane opinionsTrannies feel free to ignore, I will block you as soon as I suspect or know that you have a Y chromosome. Also as a warning I'm a lesbian and if you're heterosexual or bisexual I may be disgusted depending on the level of cocklust you show. Likewise if you're a febfem, polbian, radfem obsessed with moids I will fucking block you, I may be crazy but I still hold some standards for other crazies.>Are you a busy person or is it okay to contact you whenever?Send a message whenever."
   },
   "reply_255040": {
      "reply id": "255040",
      "username": "Anonymous",
      "date posted": "10/16/23 (Mon) 03:43:18 AM",
      "post content": ">Contact[email protected]>TimezoneGMT -4>Agealmost 19>Preferred age range for friendsi don’t mind if you’re older as long as we have things in common>Hobbies & Interests and other detailsi like to draw, i’m currently focused on tattoo designs cause i’ve been wanting to get an apprenticeship at a tattoo shop maybe. i like cute things, sanrio, calico critters etc. i love baking and cooking. i like lana del rey but also a lot of metal/goth music. currently watching twin peaks. i also like to read but haven’t been reading much lately so maybe someone could motivate me! >Are you a busy person or is it okay to contact you whenever?contact whenever, i’ll probably only take a couple hours to reply"
   },
   "reply_255053": {
      "reply id": "255053",
      "username": "Anonymous",
      "date posted": "10/16/23 (Mon) 02:10:35 PM",
      "post content": ">>255036>>255040the two archetypes of CC users"
   },
   "reply_255151": {
      "reply id": "255151",
      "username": "Anonymous",
      "date posted": "10/18/23 (Wed) 08:59:58 PM",
      "post content": ">>250742i deleted this email so don't contact it. rating friend finder thread experience:around a 3/10. i got contacted by two moids, i thought the second one was a girl and im embarrased how much i talked to it. the anons itt seem pretty cool but most use discord so i haven't contacted any yet. wish the moids would leave."
   },
   "reply_255353": {
      "reply id": "255353",
      "username": "Anonymous",
      "date posted": "10/22/23 (Sun) 12:26:16 PM",
      "post content": ">Contactchoooats on discord>Timezonegmt +8>Age26>Preferred age range for friendsdoesn't matter>Hobbies & Interests and other detailslost interest in vidya, anime, and manga (except for my yuri manga updates) ever since i started working. proud to say that most of my interests these days involve activities that require me to go outside.also work is stressing me out and i get too lonely sometimes hence this post>Are you a busy person or is it okay to contact you whenever?whenever is fine i'll reply when i can"
   },
   "reply_255419": {
      "reply id": "255419",
      "username": "Anonymous",
      "date posted": "10/23/23 (Mon) 12:43:30 PM",
      "post content": ">>255036What's the point of posting this if you're not even going to reply lek"
   },
   "reply_255682": {
      "reply id": "255682",
      "username": "Anonymous",
      "date posted": "10/26/23 (Thu) 02:12:45 AM",
      "post content": ">Contactcateatsowner on discord/gmail>TimezoneCET>Age25>Preferred age range for friendsdon't smoke >Hobbies & Interests and other detailskpop gg music and manga drawn by women, but still enjoy some old comfort shippingI draw and believe xx are superior and the others should be offed>Are you a busy person or is it okay to contact you whenever?big disclaimer that I'm awkward, I get anxious and ghost like crazy"
   },
   "reply_255707": {
      "reply id": "255707",
      "username": "Anonymous",
      "date posted": "10/26/23 (Thu) 03:53:45 PM",
      "post content": ">>255419You too? Sighn… I suppose some only desire to know that others are interested in them enough to message, everything else is but a foregone conclusion."
   },
   "reply_255717": {
      "reply id": "255717",
      "username": "Anonymous",
      "date posted": "10/26/23 (Thu) 07:23:00 PM",
      "post content": ">>255707Yeah, I wonder if she has already found someone to talk to, so she doesn't have any need to reply to other people, in that case then it's fine. I wish I would just get a fucking hello at least."
   },
   "reply_255731": {
      "reply id": "255731",
      "username": "Anonymous",
      "date posted": "10/27/23 (Fri) 01:23:40 AM",
      "post content": ">>255717>>255707you should add each other, nonas, maybe a wonderful friendship could bloom"
   },
   "reply_255868": {
      "reply id": "255868",
      "username": "Anonymous",
      "date posted": "10/29/23 (Sun) 05:11:24 PM",
      "post content": ">Contactrigamarollin on discord>TimezoneET>Age29>Preferred age range for friends25-35>Hobbies & Interests and other detailsArts n crafts (sewing, drawing, stuff like that), cartoons, listening to tunes, chatting, general nonsense and silliness>Are you a busy person or is it okay to contact you whenever?Contact me whenever, I'm always available! I'll answer you I promise kek"
   },
   "reply_256265": {
      "reply id": "256265",
      "username": "Anonymous",
      "date posted": "11/03/23 (Fri) 03:15:35 PM",
      "post content": ">>255868to the moid that added me, promptly kill yourself."
   },
   "reply_256402": {
      "reply id": "256402",
      "username": "Anonymous",
      "date posted": "11/05/23 (Sun) 07:24:10 PM",
      "post content": ">>255731Great idea! I'm >>255707 greb#4812"
   },
   "reply_256408": {
      "reply id": "256408",
      "username": "Anonymous",
      "date posted": "11/05/23 (Sun) 08:10:59 PM",
      "post content": ">>256402>picrelthats metal"
   },
   "reply_256433": {
      "reply id": "256433",
      "username": "Anonymous",
      "date posted": "11/06/23 (Mon) 06:03:19 AM",
      "post content": "i just want a someone to play video games with"
   },
   "reply_256451": {
      "reply id": "256451",
      "username": "Anonymous",
      "date posted": "11/06/23 (Mon) 09:52:42 AM",
      "post content": ">>256433what video games do you play nona and whats your contact?"
   },
   "reply_256476": {
      "reply id": "256476",
      "username": "Anonymous",
      "date posted": "11/06/23 (Mon) 12:43:28 PM",
      "post content": ">>256451I play csgo and rainbow six siege, and I've been wanting to play payday 3. I have  a bunch of other games like stardew valley and minecraft and moreMy tag is rar#5691"
   },
   "reply_256486": {
      "reply id": "256486",
      "username": "Anonymous",
      "date posted": "11/06/23 (Mon) 06:02:53 PM",
      "post content": ">Contact[email protected]>TimezoneEST>Age30>Preferred Age Range for friends27 to 40>Hobbies etcinternet research, basic HTML bullshit, video games like persona, yakuza, jrpgs… art and drawing, anime and manga, millennial bullshit>Are you a busy person or is it ok to contact you whenever?I work from home and I do everything else from home, I am always home, message me anytime"
   },
   "reply_256630": {
      "reply id": "256630",
      "username": "Anonymous",
      "date posted": "11/09/23 (Thu) 11:20:15 AM",
      "post content": ">Contact[email protected]It's an email I use to sign up for random shit online, so it's not a throwaway but I'm not checking it every day either. I prefer to use discord but there's no way I'm posting it directly here.>TimezoneGMT-8 (PST)>Age28>Preferred age range for friendsCloser to my age would be nice. >Hobbies & Interests and other detailsI like video games, building plastic robots, spending way too much time in the kitchen, reading (mainly non-fiction), and generally sitting in front of my computer. If anyone wants to play vidya together or board games on TTS hmu. Mainly playing singleplayer stuff these days but down to clown if I own it (no trash like MOBAs and FOTM zoomer shit/meme games - please get better taste).STEM major but I work in social services - I can provide some truly fucked stories from my line of work that will both shock you and make you lose faith in society.>Are you a busy person or is it okay to contact you whenever?Feel free to bug me anytime. Do note that I am a lesbian (but I have a gf), in case that's an issue."
   },
   "reply_256637": {
      "reply id": "256637",
      "username": "Anonymous",
      "date posted": "11/09/23 (Thu) 12:42:43 PM",
      "post content": ">>256486replied to your message !"
   },
   "reply_256922": {
      "reply id": "256922",
      "username": "Anonymous",
      "date posted": "11/12/23 (Sun) 01:11:34 PM",
      "post content": "If you made a discord account just to talk to the girlies it might be a good idea to actually check your messages kek"
   },
   "reply_256940": {
      "reply id": "256940",
      "username": "Anonymous",
      "date posted": "11/12/23 (Sun) 10:42:18 PM",
      "post content": ">ASL20, F, Boston>Preferred age range for friendsWilling to talk to women of any age (18+)>Hobbies & Interests and other detailsWorking out, sports (iceskating, tennis, running, etc). Victorian culture and art. Sewing, painting, drawing. I also bake and cook! Currently learning Portuguese. In college.>Are you a busy person or is it okay to contact you whenever?Contact me whenever, I may not get back right away> Discordtoastman334"
   },
   "reply_256955": {
      "reply id": "256955",
      "username": "Anonymous",
      "date posted": "11/13/23 (Mon) 03:49:03 AM",
      "post content": ">Contactdiscord: boney9349>TimezoneEST>Age19>Preferred age range for friendsAround the same age. Not picky though>Hobbies & Interests and other detailsI'm into a lot of things. Just ask! I'm looking to chat about your interests (and mine as well)>Are you a busy person or is it okay to contact you whenever?I'm a busy person but message me whenever!"
   },
   "reply_257037": {
      "reply id": "257037",
      "username": "Anonymous",
      "date posted": "11/14/23 (Tue) 03:11:37 PM",
      "post content": ">>256922pass. they both look like moids. I guess the passive aggressive kek comments is the local moid lurking around"
   },
   "reply_257057": {
      "reply id": "257057",
      "username": "Anonymous",
      "date posted": "11/14/23 (Tue) 09:29:45 PM",
      "post content": ">>256940Please tell me you're learning actual Portuguese and not hue instead"
   },
   "reply_257058": {
      "reply id": "257058",
      "username": "Anonymous",
      "date posted": "11/14/23 (Tue) 10:06:07 PM",
      "post content": ">>257057what does mean lol what is hue"
   },
   "reply_257060": {
      "reply id": "257060",
      "username": "Anonymous",
      "date posted": "11/14/23 (Tue) 10:58:39 PM",
      "post content": ">>257057\"Hue\" is a meme for \"Brazilian\", which is spoken differently from Portuguese and (in many cases) includes words that do not exist in this language"
   },
   "reply_257061": {
      "reply id": "257061",
      "username": "Anonymous",
      "date posted": "11/14/23 (Tue) 10:59:55 PM",
      "post content": ">>257058>>257060"
   },
   "reply_257062": {
      "reply id": "257062",
      "username": "Anonymous",
      "date posted": "11/14/23 (Tue) 11:28:22 PM",
      "post content": ">>257060…im learning hue :("
   },
   "reply_257079": {
      "reply id": "257079",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 07:19:52 AM",
      "post content": ">>257057"
   },
   "reply_257099": {
      "reply id": "257099",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 06:42:45 PM",
      "post content": " >>232293This guy is a 30 year old male"
   },
   "reply_257103": {
      "reply id": "257103",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 07:26:06 PM",
      "post content": "I'm in dire need of fellow language nerds.Green owlery: unyone Furcord: pillycater Dm me if you're learning Chinese or German and you'd like to learn together"
   },
   "reply_257106": {
      "reply id": "257106",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 08:13:36 PM",
      "post content": ">>239035Hi it’s me again, I’m going to update some stuff about me. I don’t think it’s going to be a major change because I still like the anime that I listed and listen to the music genre I mentioned. Also the games I play too.My username on Discord is still the same from my previous post, I have telegram but I don’t use it as much unless I have a friend that mainly uses it (I don’t) My birthday passed so I’m 19 now. The university I’m attending was average so I wasn’t really busy. I think I’ll be able to respond any time. Plus I’m not employed.I’m not interested in coding anymore although I still browse Websites on Neocities (Excuse me for saying “still” a lot) I like to digitally draw & take photography. When I said that I “want to become a normie” on my initial post, I didn’t mean going outside more often, I mean like to minimize my screen time? (I ditched that goal) There’s some stuff that I want to dump here because I don’t know how to make a smooth sentence transitioning to a new subject from the last paragraph you just read: I like watching Horror Movie, YouTube Interrogation, Police Activity, Mythology shit & general video essay related to a game or film. That’s pretty much the update about me I have so far. The age range is the same, I prefer to talk to women that is near my age but anyone else who is 22 is fine. Please try not to start with a small talk, tell me about yourself and who you are. I’m biased so I may not add back due to the profile picture you have lol. The dealbreaker to me would be that you have a lot of friends or have huge followers on your other social platform(petty and bitter I know but I can elaborate why) & if you’re above 23 years old. My definition of having a friend is that you don’t have a lot of people on your “friends list” that you don’t talk to as much. I personally don’t like just being there on someone’s friends list. Anyways, that’s all I have now!"
   },
   "reply_257108": {
      "reply id": "257108",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 08:32:59 PM",
      "post content": ">>257099I wanted to flag him but he had a different username before he changed it back to that. I really hope he gets into a car accident"
   },
   "reply_257109": {
      "reply id": "257109",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 08:49:47 PM",
      "post content": ">>257099>>257108Is he really? We didn't talk much so I assumed he was a very dry nona"
   },
   "reply_257113": {
      "reply id": "257113",
      "username": "Anonymous",
      "date posted": "11/15/23 (Wed) 09:41:32 PM",
      "post content": ">>257109"
   },
   "reply_257204": {
      "reply id": "257204",
      "username": "Anonymous",
      "date posted": "11/17/23 (Fri) 03:37:02 AM",
      "post content": ">contactmalevolent wizard#6615 >tz american>age18>age rangedont care>interestsfilms games and podcasts; always open to learn about new hobbies and stuffscontact me whenever idc"
   },
   "reply_257218": {
      "reply id": "257218",
      "username": "Anonymous",
      "date posted": "11/17/23 (Fri) 07:42:03 AM",
      "post content": ">discpopi.pipojust dont send (too) weird shit. no larpers>tzest>age20>pref age19-24although, doesn't matter much, just be genuine>hobbies-vidya(gacha, vn, rpg), crafts (crochet, gunpla), music (shibuya-kei, breakcore, anything shoegaze), cos-anything early or pre 2000 doomer nostalgiabait, think ps2/dreamcast games, 90s anime (ghost in the shell), frutigier aero-consooming 6hr yt video essays on vidya design or spooky scaries like an autist while lifting or wasting my life on ffxiv99%m stem lectures are getting lonely, im happy to just chat about my day, or yours>busy?exams, studying, and job leaves me with fuck all time, but leave something and ill try to get to you when or if time lets me"
   },
   "reply_257226": {
      "reply id": "257226",
      "username": "Anonymous",
      "date posted": "11/17/23 (Fri) 12:37:32 PM",
      "post content": ">>221929Here's a weird thing on the internet:https://www.youtube.com/watch?v=xf46FELFk2g"
   },
   "reply_257245": {
      "reply id": "257245",
      "username": "Anonymous",
      "date posted": "11/17/23 (Fri) 03:15:25 PM",
      "post content": ">>257108>>257113He also contacted me with that one then changed, I can't remember if it's the same but this is how it's still displayed for me."
   },
   "reply_257260": {
      "reply id": "257260",
      "username": "Anonymous",
      "date posted": "11/17/23 (Fri) 06:45:23 PM",
      "post content": "That was funny when you gave that german journalist lady my discord. Should of known you all were planning something."
   },
   "reply_257447": {
      "reply id": "257447",
      "username": "Anonymous",
      "date posted": "11/21/23 (Tue) 12:33:12 AM",
      "post content": ">>218051ireland, 18interests are reading/learning various things, playing music, grandmotherly craftspretty miserable but capable of vigor under the right circumstancesim looking for someone whos also pretty isolated to hang out with in person(!!!). im not a moid looking to wear someone’s skin and can prove my identity or whatever.id rather not hear from someone whos a neet and okay with ita long shot but ive made a session because im extremely paranoidill give you discord0531a6795de871a1e80ecc2f68693565f73fb493bc7dff79110e1681bc1c0a8104"
   },
   "reply_257459": {
      "reply id": "257459",
      "username": "Anonymous",
      "date posted": "11/21/23 (Tue) 05:22:31 AM",
      "post content": ">>224737This post is 8 months old, so I doubt you're still looking for people, but what kind of typology do you mean?"
   },
   "reply_257484": {
      "reply id": "257484",
      "username": "Anonymous",
      "date posted": "11/21/23 (Tue) 02:40:08 PM",
      "post content": ">>257459I think its when you try to guess which personality someone is."
   },
   "reply_257518": {
      "reply id": "257518",
      "username": "Anonymous",
      "date posted": "11/21/23 (Tue) 10:38:47 PM",
      "post content": ">>257103Added you on Discord!! I have been dying for language friends."
   },
   "reply_257529": {
      "reply id": "257529",
      "username": "Anonymous",
      "date posted": "11/22/23 (Wed) 02:42:23 AM",
      "post content": "so i've advertised here before under a different alias, but that account has since been deleted. since then i've missed having the opportunity to friend other great people on cc and surprisingly, /soc/, where i happened to find really interesting people that i wish i had kept in touch with. >contact: pumpkinhead24>timezone: MST>age: 20>preferred age range: 18+my hobbies include fitness, fashion & beauty, literature (philosophical works), and vidya (WoW, unreal world, horse games – ask if you're intrigued.) also i forgot to mention i'd like to get into more media, like yaoi and other anime/manga that i've put on a to-do watch list. i've read the first two books of berserk and would like to expand. i know now more than ever that you need to have common ground with someone to be able to maintain a lasting friendship. so as such i'd ask whoever's reading this to at least entertain the hobbies i've mentioned above, and i'll do the same with you. i'm open to anyone who also desires a close philia relationship. i know it'll be hard to find but it's worth putting this out there encase there IS someone because lately i've been doubting my ability to find another person i can truly feel some oneness with. no moids, unfortunately i have to preface this because i know some lurk here to find their qt autistic imageboard browser gf.. i have a bf  and we're intertwined so adding me is useless. i am his bitch, in scrote dialect. i won't bother posting on /soc/, so i hope the right person finds this here. ideally i'd find a friend i could meet up with someday, who knows"
   },
   "reply_257554": {
      "reply id": "257554",
      "username": "Anonymous",
      "date posted": "11/22/23 (Wed) 12:44:45 PM",
      "post content": ">Contactpotpurri11 (alt made for this thread)>TimezoneCST>Age22>Preferred age range for friends20+>Hobbies & Interests and other detailsHistory of food (and history in general but mostly food), philosophy (not very good at verbalizing my thoughts though), film, fashion, pokémon, astrology (I'm new to it so I am still learning the basics), kpop girl groups, dolls (mainly MH and EAH), documentaries, sociology, tinfoils, urban legends and the paranormal. Radfem-leaning. >Are you a busy person or is it okay to contact you whenever?I'm a little busy but I'll try to reply whenever I can."
   },
   "reply_257767": {
      "reply id": "257767",
      "username": "Anonymous",
      "date posted": "11/25/23 (Sat) 07:24:39 AM",
      "post content": "sent a couple of friend requests via discord to s who posted months ago, y'all seem cool>Contact[email protected] or i can add you on discord if that's easier, just lmk!>TimezoneCST>Age26>Preferred age range for friends24+>Hobbies & Interests and other detailsi'm into shoujo/josei/BL manga, danmei, webnovels, non-fiction, classic lit., etc. i really love to read and can talk about whatever i'm reading for a while. i wear j-fashion and enjoy going to concerts/shows (all types of music). i'm engaged and not looking for romantic relationships. i work full-time and go to uni part-time. i travel for fun and recently went on a trip to seoul (picrel is a cute statue i saw there) and tokyo>Are you a busy person or is it okay to contact you whenever?contact me whenever! work and school are winding down right now, and if you're slow to reply back that's okay."
   },
   "reply_257941": {
      "reply id": "257941",
      "username": "Anonymous",
      "date posted": "11/27/23 (Mon) 12:07:52 PM",
      "post content": ">>257245huh I had them added as well but they were so dull that I ghosted them after a couple of days. I should have clicked that he sounded moidy when he mentioned not liking anime specifically, but hentai image boards."
   },
   "reply_257949": {
      "reply id": "257949",
      "username": "Anonymous",
      "date posted": "11/27/23 (Mon) 12:59:03 PM",
      "post content": ">>257941Did you post your own contact in the thread nona? I would have (actually engaging) discussions about weeb stuff with you"
   },
   "reply_257950": {
      "reply id": "257950",
      "username": "Anonymous",
      "date posted": "11/27/23 (Mon) 01:02:45 PM",
      "post content": ">>257941Wow, look at all those long sentences being replied with 4 to 5 words!"
   },
   "reply_257968": {
      "reply id": "257968",
      "username": "Anonymous",
      "date posted": "11/27/23 (Mon) 05:58:32 PM",
      "post content": ">>257949I did, but it's gone now because I grew disheartened by the very lacking conversation I had with most people that added me. I had one confirm they were a moid, and this recent post makes at least two that added me now.If you want to point me in the direction of your post then I'd gladly reach out."
   },
   "reply_258014": {
      "reply id": "258014",
      "username": "Anonymous",
      "date posted": "11/28/23 (Tue) 02:02:28 AM",
      "post content": ">>257968I didn’t post yet, but my handle is eritt_If any other nona is interested in discussing animanga and reminiscing about old imageboard culture they can feel free to add too!"
   },
   "reply_258056": {
      "reply id": "258056",
      "username": "Anonymous",
      "date posted": "11/28/23 (Tue) 09:01:43 AM",
      "post content": ">>258014I've added you nona!"
   },
   "reply_258097": {
      "reply id": "258097",
      "username": "Anonymous",
      "date posted": "11/28/23 (Tue) 10:23:38 PM",
      "post content": ">Contactmy discord's fork4k4k>TimezoneEST>Age28>Preferred age range for friends25+>Hobbies & Interests and other detailsI've got a PhD in philosophy. I like gardening, cats, shrooms, meditation, a24 movies, progressive rock (especially pink floyd) and folk music (especially bert jansch), and true crime. I also don't mind anime/manga. I chronically post in the radfem/terf/pinkpilled threads. I'm suspicious of therapists and I'm vegan.>Are you a busy person or is it okay to contact you whenever?I have a job but I'm posting this at it right now and am not particularly busy. >>257767mind adding me on discord? I'd be interested in some of your webnovels, nonfiction, and classic lit suggestions"
   },
   "reply_258103": {
      "reply id": "258103",
      "username": "Anonymous",
      "date posted": "11/29/23 (Wed) 01:30:46 AM",
      "post content": ">Contactaknatsa or [email protected](if you want to reach out somewhere else, it's a throwaway though!)>TimezoneUTC -5>Age18>Preferred age range for friends18-28>Hobbies & Interests and other detailsI have autism, please forgive how bad they sound. Linguistics (I'm a polyglot too), literature, music (theory), puzzles (irl/vidya), manga (slice of life/yaoi) + writing (poetry and for nanowrimo!). I really like Russian literature and right now I am rereading a collection of Mayakovsky's poems (if you add me we can be friends on goodreads maybe). Currently obsessed with Jeon Somi but I usually listen to jpop like Kanano and Haze.>Are you a busy person or is it okay to contact you whenever? I am currently in school and frequently completing large essays/projects, so I often might not be able to reply. Regardless, I have no problem with people messaging whenever, in fact, I prefer it, as I am fairly lonely and rarely get to talk to anyone."
   },
   "reply_258115": {
      "reply id": "258115",
      "username": "Anonymous",
      "date posted": "11/29/23 (Wed) 05:43:25 AM",
      "post content": ">>257968I noticed the bad conversation/lack of conversation happens with the younger crowd. All the anons in their mid 20s and up are super cool, seem more like they have a personality, and generally are more established people."
   },
   "reply_258213": {
      "reply id": "258213",
      "username": "Anonymous",
      "date posted": "11/29/23 (Wed) 11:59:54 PM",
      "post content": "Anybody from Italy?"
   },
   "reply_258215": {
      "reply id": "258215",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 12:36:09 AM",
      "post content": ">>258213Io! Sei una delle nonne del thread italiano?"
   },
   "reply_258268": {
      "reply id": "258268",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 03:16:31 PM",
      "post content": "Sorry for posting this as an image. I keep getting autobanned whenever I try to post this, probably hitting some spam filter."
   },
   "reply_258288": {
      "reply id": "258288",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 07:03:09 PM",
      "post content": ">>257554Deer Nona, Is that your discord name? Wasn't able to find it… Add me if you'd like >>256402"
   },
   "reply_258289": {
      "reply id": "258289",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 07:26:53 PM",
      "post content": ">>258268You are very off-putting"
   },
   "reply_258292": {
      "reply id": "258292",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 08:59:00 PM",
      "post content": ">>258215Ciao cara! Cosa ti porta qui?Leggo solo ora la tua risposta. È offensivo per le altre nonas se si chiacchiera in altre lingue?"
   },
   "reply_258300": {
      "reply id": "258300",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 10:49:46 PM",
      "post content": ">>258292Frequento imageboards da molto tempo, non tantissimo cc, ma in questo ultimo periodo ogni tanto controllo cosa postano le none qui e su /feels/. E tu invece?Non lo so in realtà ahah, se ti va possiamo scambiarci un contatto mail o discord comunque!"
   },
   "reply_258305": {
      "reply id": "258305",
      "username": "Anonymous",
      "date posted": "11/30/23 (Thu) 11:49:53 PM",
      "post content": ">>258300Sono una notturna ahaha e tu? Forte! Io non sono molto pratica di imageboard o altro (banalmente, i social), e non ho discord, me lo consigli? Cosa ci si può fare? Scusa l'ignoranza, ho 23 anni ma l'anima di una anziana…Ultimamente trovo molto interessante venire a leggere quello che postano le altre ragazze qui, su svariati argomenti"
   },
   "reply_258368": {
      "reply id": "258368",
      "username": "Anonymous",
      "date posted": "12/01/23 (Fri) 08:29:46 PM",
      "post content": ">>258305Interessante! Sei neet? Io non posso stare su fino a tardi per motivi di wageslaving, senò lo farei ahah. Stima per il fattore social comunque, io tengo giusto discord etc per parlare con amici online ma per il resto non ne vale la pena secondo me.Comunque ho creato una mail throwaway in caso, almeno non riempiamo il thread: ccffno [email protected] (senza spazio, molto originale lo so)"
   },
   "reply_258409": {
      "reply id": "258409",
      "username": "Anonymous",
      "date posted": "12/02/23 (Sat) 04:51:28 AM",
      "post content": ">>258368As an Spanish speaker, is always so interesting seeing how close Italian is to Spanish!"
   },
   "reply_258543": {
      "reply id": "258543",
      "username": "Anonymous",
      "date posted": "12/04/23 (Mon) 10:16:21 AM",
      "post content": ">>258268How old are you?>>258289You sound like a dick."
   },
   "reply_258544": {
      "reply id": "258544",
      "username": "Anonymous",
      "date posted": "12/04/23 (Mon) 10:31:55 AM",
      "post content": ">>258213Io vengo dall'Italia"
   },
   "reply_259035": {
      "reply id": "259035",
      "username": "Anonymous",
      "date posted": "12/10/23 (Sun) 02:24:46 AM",
      "post content": ">Contactkaliy00ga>Timezone>Age21>Preferred age range for friends18+>Hobbies & Interests and other detailsI love fashion, fragrance and beauty! I watch a lot of films and read quite a bit, right now I'm reading Chekhov. I also spend a lot of spare time collecting pretty images and listening to music. I work in software so i also spend time programming. i don't have much knowledge on vidya or anime but i'm happy to hear you talk about it/get into it. i just want to find someone who's genuinely interested in conversation because i think that matters more than common interests anyway>Are you a busy person or is it okay to contact you whenever?Whenever"
   },
   "reply_259205": {
      "reply id": "259205",
      "username": "Anonymous",
      "date posted": "12/13/23 (Wed) 03:46:03 AM",
      "post content": ">>258429I replied to your mail in case you didn't see it nona, sorry for having taken a bit!"
   },
   "reply_259341": {
      "reply id": "259341",
      "username": "Anonymous",
      "date posted": "12/15/23 (Fri) 07:15:59 PM",
      "post content": ">>258097>phd in philosophy>terfbased. fork4k4k doesnt work on discord, or am i stupid"
   },
   "reply_259393": {
      "reply id": "259393",
      "username": "Anonymous",
      "date posted": "12/17/23 (Sun) 12:09:48 AM",
      "post content": "[email protected]mid 20s female and im bored as fuck so message me whatever if you want to just keep the fucked up stuff to a minimum"
   },
   "reply_259831": {
      "reply id": "259831",
      "username": "Anonymous",
      "date posted": "12/20/23 (Wed) 03:01:55 PM",
      "post content": "I miss my friends. I'm sorry for disappearing. I'm sorry I'm a bad friend. I'm sorry. I won't leave this time. I miss you."
   },
   "reply_259977": {
      "reply id": "259977",
      "username": "Anonymous",
      "date posted": "12/21/23 (Thu) 08:03:17 AM",
      "post content": ">>259837sorry if I'm jumping to conclusions but you sound suspiciously like the moid posted here >>257941 >>257113 who has now deleted their account."
   },
   "reply_259981": {
      "reply id": "259981",
      "username": "Anonymous",
      "date posted": "12/21/23 (Thu) 09:02:51 AM",
      "post content": ">Contact[email protected] - i will be happy to send you my discord if you email me through there!>TimezoneGMT>Age20>Preferred age range for friends20-30 i guess? but really i don't mind as long as you're respectful and sweet!>Hobbies & Interests and other detailsim autistic so sorry if these all sound weird.i like vidya (mostly league of legends, project zomboid, the binding of isaac, baldurs gate 3, but looking to get into other games).other than that, i am obsessed with cats, garfield, mahjong, puzzles (i do online puzzles with friends sometimes!), art, metal music, documentaries, psychology, and typology (enneagram, mbti, etc).im super into listening to people talk about what they love, and i like getting into other people's interests. so if many of these don't sound like you, that's fine!>Are you a busy person or is it okay to contact you whenever?i am a neet with a chronic illness, so i am basically always free. i look forward to maybe chatting with some of you!"
   },
   "reply_260030": {
      "reply id": "260030",
      "username": "Anonymous",
      "date posted": "12/22/23 (Fri) 06:00:00 PM",
      "post content": ">>259837>Please befriend me, I want friends>YOU ask me for MY contact info thoughwhere's the logic"
   },
   "reply_260101": {
      "reply id": "260101",
      "username": "Anonymous",
      "date posted": "12/23/23 (Sat) 06:25:20 PM",
      "post content": ">Contact[email protected]>TimezoneEST>Age21>Preferred age range for friends20+>Hobbies & Interests and other detailsI'm looking for a new online friend to play games with or just talk about random things, I play league, final fantasy xiv, monster hunter, i will play literally anything not picky! I also love animals and have a pet bunny and I love drawing. I would love to share art/ cute pictures/ memes/ music etc with someone. I am not looking for male friends i already have a bf so plz do not contact me for some weird shit but other than that if you want to talk feel free to message me :)>Are you a busy person or is it okay to contact you whenever?I am busy sometimes so it may take a bit to reply but message me whenever!"
   },
   "reply_260113": {
      "reply id": "260113",
      "username": "Anonymous",
      "date posted": "12/23/23 (Sat) 11:52:56 PM",
      "post content": ">Contact discord: hermit_phantom>TimezoneEST>Age20>Preferred Age Range for friends18-25>Hobbies & InterestsI'm an artist, currently in college for art, into music, anime, video games and cartoons.>Are you a busy person or is it okay to contact you whenever?Mostly whenever is fine. I'm currently on winter break, so I'm okay now. Afternoons and nights are best when school is in session."
   },
   "reply_260189": {
      "reply id": "260189",
      "username": "Anonymous",
      "date posted": "12/25/23 (Mon) 04:57:36 PM",
      "post content": ">still no cute girl friend to wish a Merry Christmas to"
   },
   "reply_260209": {
      "reply id": "260209",
      "username": "Anonymous",
      "date posted": "12/25/23 (Mon) 11:45:14 PM",
      "post content": ">>260189merry christmas ! i hope you had a great day! if you've posted here, direct me to your post and i'll get in contact with you"
   },
   "reply_260374": {
      "reply id": "260374",
      "username": "Anonymous",
      "date posted": "12/29/23 (Fri) 11:02:59 AM",
      "post content": "A long time ago, maybe 2-3 years at this point, I chatted with an anon from Belarus over Discord. We talked about both feeling behind in life, and you mentioned wanting to go back to school. We didn't talk for a long time (I think I may have accidently taken too long to respond and you deleted your account, but I could remember it wrong) but I never forgot our conversations because you were encouraging and uplifting and dealt with some of the same stuff in life. If that's you and you're still here, I'd love to get back in touch and get to know how you're doing now!"
   },
   "reply_260385": {
      "reply id": "260385",
      "username": "Anonymous",
      "date posted": "12/29/23 (Fri) 02:01:19 PM",
      "post content": ">>260189belated Merry Christmas, nona"
   },
   "reply_260460": {
      "reply id": "260460",
      "username": "Anonymous",
      "date posted": "12/30/23 (Sat) 11:42:56 PM",
      "post content": ">Contact[email protected]>Age20>Preferred age range for friendsDon't care>Hobbies & Interests and other detailsI like reading, writing, video games, watching long youtube video essays, listening to podcasts about celebrities I've never heard of, music discovery, and journaling. I'm introverted, a bit withdrawn sometimes.>Are you a busy person or is it okay to contact you whenever?Contact me whenever, I'm glued to my laptop 24/7"
   },
   "reply_260466": {
      "reply id": "260466",
      "username": "Anonymous",
      "date posted": "12/31/23 (Sun) 03:30:43 AM",
      "post content": "> Contactwombdweller on discord.> Age20> TimezoneContact me any time, will reply as soon as I can.> Age preference I don't care about age.>Hobbies & Interests and other detailsArt in it's many forms (music, cinema, visual arts, etc), collectionist, video games, etc. I love reading as well, especially literature. Lover of cute things, creatures and characters. Btw, merry christmas and happy new years to all nonettes!"
   },
   "reply_260773": {
      "reply id": "260773",
      "username": "Anonymous",
      "date posted": "01/04/24 (Thu) 09:13:54 AM",
      "post content": ">>218051>\"sierra95.\" On discord>baka999:matrix.org On matrix>Would preffer not say>18>Firearms and military, drawing anime, wriring, computers, nature and camping and stuff like this, and much more.>I am a very busy person but do contact me whenever you wish. I am bored as hell.Looking to make more feminine female friends… All I have are boys around me.."
   },
   "reply_260867": {
      "reply id": "260867",
      "username": "Anonymous",
      "date posted": "01/05/24 (Fri) 03:22:21 AM",
      "post content": ">ContactAsk>TimezoneAEST/GMT+11>Age21>Preferred age range for friendsI'm not picky but 20+ preferably>Hobbies & Interests and other detailsI'm very much into writing, reading (I'm halfway through War and Peace right now), and collecting books. I also love anything to do with linguistics - conlanging especially! - and seeing how language affects culture and history of languages. Also I've gotten really into pickling and fermenting stuff lately.>Are you a busy person or is it okay to contact you whenever?Contact me whenever! I'm free pretty much everyday."
   },
   "reply_261028": {
      "reply id": "261028",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 05:39:10 AM",
      "post content": ">Contact@VanHiltonLive on twitter>TimezoneEST>AgeLol.>Preferred age range for friendsI prefer the older crowd but if you're not a sperg it's perfectly fine whatever.>Hobbies & Interests and other detailsManga, literature, cinema, art, music.>Are you a busy person or is it okay to contact you whenever?Don't care."
   },
   "reply_261043": {
      "reply id": "261043",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:58:19 AM",
      "post content": ">>261037Read the rules zoom zoom"
   },
   "reply_261065": {
      "reply id": "261065",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 09:35:55 PM",
      "post content": ">>21805119My email is [email protected].I’m learning russian and I want to talk (text) to a native speaker!! In exchange I can help you with English; it’s my native language. Or I can just shower you with flattery…I can give out discord, but I think writing emails would be fun and good practice. We could switch up the languages.My interests are mainly reading, making things with my hands, and music. But anything creative that you do, I’ll be interested in hearing about it. I’m also interested in politics/philosophy and all that but my level of Russian is shit so any talks about that would have to be in English :|"
   },
   "reply_261066": {
      "reply id": "261066",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 09:47:49 PM",
      "post content": ">>261065>liminalspaceWhat's your take on liminal space, nona"
   },
   "reply_261067": {
      "reply id": "261067",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:02:26 PM",
      "post content": ">>261066>>261065my email is actually [email protected], liminal space was taken!! !!! take on liminal space: as an internet trace it’s annoying but i like liminal spaces :d"
   },
   "reply_261068": {
      "reply id": "261068",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:03:08 PM",
      "post content": ">>261067id like to be in between worlds. but i dont like internet people trying to be edgy and creepy which is what it makes me think of."
   },
   "reply_261069": {
      "reply id": "261069",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:03:51 PM",
      "post content": ">>261067as an internet TREND it’s annoying, not trace. what the hell. maybe i shouldnt be trying to help anyone with english. im clearly senile."
   },
   "reply_261070": {
      "reply id": "261070",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:07:00 PM",
      "post content": ">>261068What do you mean with in between worlds like physical spaces or do you think about internet also as liminal space or do you have a more esoteric understanding. For me it's about physical space"
   },
   "reply_261071": {
      "reply id": "261071",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:29:26 PM",
      "post content": ">>261070i guess i mean a place that seems to erase your identity, like an airport or a really large city etc. that doesnt seem to exactly be the way most people use the word but it’s still in the same spirit. wbu"
   },
   "reply_261072": {
      "reply id": "261072",
      "username": "Anonymous",
      "date posted": "01/07/24 (Sun) 10:47:26 PM",
      "post content": ">>261071For me it's a place that is just a regular place but feels oddworldy like you're not supposed to be there and make your move while everybody around you is going on with their day"
   },
   "reply_261149": {
      "reply id": "261149",
      "username": "Anonymous",
      "date posted": "01/09/24 (Tue) 11:41:24 PM",
      "post content": "F20 currently living in Philadelphia looking to start travelling when it gets warm out. I'm trying to find a travel buddy to accompany me on the road. I am very flexible and am willing to hear out ideas, I'm thinking about travelling by car along the west coast. Ive done something similar before, but with an abusive boyfriend, and I've been trying to truly get 'out there' since I turned 18. It's the reason I do most of the things I do. I'm looking for a travelling companion whose down to smoke, party, and make memories. I don't drink a lot at all, I much prefer weed, but it hasn't been much of an issue because I don't turn 21 until early June. I would also like to go to the Rainbow Gathering this summer, the pre camp starts in mid june and the week is always july 1-7. I'm into metaphysics and stimulating conversation that doesn't run over into too crazy schitzo talk ie mother god shitkik jollyrancher198 email [email protected]"
   },
   "reply_261350": {
      "reply id": "261350",
      "username": "Anonymous",
      "date posted": "01/12/24 (Fri) 08:50:29 AM",
      "post content": ">>261240>an attention whore that blogposts on /r9k/How embarrassing, hope you grow out of it some day"
   },
   "reply_261357": {
      "reply id": "261357",
      "username": "Anonymous",
      "date posted": "01/12/24 (Fri) 09:33:44 AM",
      "post content": ">>261240yikes, maybe spend some time away from social media.your brain seems rotted."
   },
   "reply_261386": {
      "reply id": "261386",
      "username": "Anonymous",
      "date posted": "01/12/24 (Fri) 03:45:13 PM",
      "post content": ">>261240>over 16Under 18s aren't even allowed to post here, go back to where you came from."
   },
   "reply_261393": {
      "reply id": "261393",
      "username": "Anonymous",
      "date posted": "01/12/24 (Fri) 06:47:14 PM",
      "post content": ">Contactlacrymans_77385>TimezoneI am looking for my friend.>AgeI am looking for my friend.>Preferred age range for friendsI am looking for my friend.>Hobbies & Interests and other detailsI am looking for my friend.>Are you a busy person or is it okay to contact you whenever?I am looking for my friend."
   },
   "reply_261408": {
      "reply id": "261408",
      "username": "Anonymous",
      "date posted": "01/12/24 (Fri) 10:06:34 PM",
      "post content": ">>2613514chan archives exist you know? Not only do you advertise your discord to incel trannies but you also mention cc by name on 4chan, as if more moid attention is necessary."
   },
   "reply_261410": {
      "reply id": "261410",
      "username": "Anonymous",
      "date posted": "01/12/24 (Fri) 10:33:08 PM",
      "post content": ">>261408> discord RectumResizer>posts on r9kIts a moid."
   },
   "reply_261414": {
      "reply id": "261414",
      "username": "Anonymous",
      "date posted": "01/13/24 (Sat) 01:11:43 AM",
      "post content": ">>261393You're dead to me asshole."
   },
   "reply_261444": {
      "reply id": "261444",
      "username": "Anonymous",
      "date posted": "01/13/24 (Sat) 08:46:43 AM",
      "post content": ">>261414You are not my friend. She would never say that."
   },
   "reply_261452": {
      "reply id": "261452",
      "username": "Anonymous",
      "date posted": "01/13/24 (Sat) 11:18:04 AM",
      "post content": ">>261414Is it really you? Why did you tell me to come back if you weren't going to answer?"
   },
   "reply_261453": {
      "reply id": "261453",
      "username": "Anonymous",
      "date posted": "01/13/24 (Sat) 11:41:00 AM",
      "post content": ">>261414Fine then. You're dead to me too."
   },
   "reply_261670": {
      "reply id": "261670",
      "username": "Anonymous",
      "date posted": "01/16/24 (Tue) 02:37:07 PM",
      "post content": "nona, if you still come here, I'm pretty disappointed. You disappeared for ages, came back and apologised for disappearing and yet have now been gone again for over a month.It's fine if you don't want to be friends anymore, but it's pretty shitty of you to get someone's hopes up like that."
   },
   "reply_261695": {
      "reply id": "261695",
      "username": "Anonymous",
      "date posted": "01/16/24 (Tue) 07:11:05 PM",
      "post content": ">>261670If this was directed at me, it seems they neglected to tell you the circumstances. There are two sides, that’s all I’ll say."
   },
   "reply_261741": {
      "reply id": "261741",
      "username": "Anonymous",
      "date posted": "01/17/24 (Wed) 11:11:01 AM",
      "post content": ">>261695it was in regards to me and another nona, I'm not sure that you are her."
   },
   "reply_261844": {
      "reply id": "261844",
      "username": "Anonymous",
      "date posted": "01/20/24 (Sat) 12:45:00 AM",
      "post content": ">Contact[email protected]>TimezoneGMT-3>Age30>Preferred age range for friends25+>Hobbies & Interests and other detailsHorror, manga, drawing, embroidery, hiking, reading. My favorites are Serial Experiments Lain, Dungeon Meshi and Dorohedoro. I like feminist literature too. I'm from Argentina. >Are you a busy person or is it okay to contact you whenever?You can contact me whenever."
   },
   "reply_261896": {
      "reply id": "261896",
      "username": "Anonymous",
      "date posted": "01/20/24 (Sat) 10:37:52 PM",
      "post content": ">Contactvelvetred34 on discord  and fleurdemal88 on Telegram >TimezonePST>Age22>Preferred age range for friends21 and over>Hobbies & Interests and other detailspsychology, true crime, health, skincare, philosophy>Are you a busy person or is it okay to contact you whenever?I'm available most of the time"
   },
   "reply_262246": {
      "reply id": "262246",
      "username": "Anonymous",
      "date posted": "01/26/24 (Fri) 06:55:35 AM",
      "post content": ">>260867i'm aest too! 22yo.do you use e-mail/irc?"
   },
   "reply_262696": {
      "reply id": "262696",
      "username": "Anonymous",
      "date posted": "01/31/24 (Wed) 06:46:40 AM",
      "post content": ">>245653It's not a woman thing lol, miss me with that blackpill shit. I get the same experience when posting on scrotechan and leddit (yea yea I know). These friend finder threads are always a mixed bag because well… you can't really force a friendship. Doesn't help that people who browse imageboards tend to be pretty autistic and socially inept/awkward."
   },
   "reply_263099": {
      "reply id": "263099",
      "username": "Anonymous",
      "date posted": "02/04/24 (Sun) 05:28:21 PM",
      "post content": "I want a polilez bestie"
   },
   "reply_263107": {
      "reply id": "263107",
      "username": "Anonymous",
      "date posted": "02/04/24 (Sun) 08:08:41 PM",
      "post content": ">>245653This is an imageboard full of scrotes and women who're socially maladjusted and/or have mental health issues. Add being online and anonymous to that and the risk/anxiety of unknowingly talking to a moid instead of a woman, perfect recipe for ghosting and disappearing. Social interactions with actual women you might have had on here are in no way representative of women and female friendships irl.It's kind of worrying you couldn't come to this realization on your own."
   },
   "reply_263173": {
      "reply id": "263173",
      "username": "Anonymous",
      "date posted": "02/07/24 (Wed) 05:17:52 AM",
      "post content": ">ContactDiscord: slimey2978>TimezoneUS CST>AgeMid 20s>Preferred age range for friends20s-40s>Hobbies & Interests and other detailsInternet gossip, music (metal, indie/alt rock, EDM, experimental ), horror media, videogames>Are you a busy person or is it okay to contact you whenever?Contact me whenever, I'll respond fairly quick"
   },
   "reply_263174": {
      "reply id": "263174",
      "username": "Anonymous",
      "date posted": "02/07/24 (Wed) 06:39:01 AM",
      "post content": ">>263173Is that a fucking cat sleeping on its tongue hahahaha cute"
   },
   "reply_263240": {
      "reply id": "263240",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 01:54:46 AM",
      "post content": ">Contact[email protected]>TimezoneEST>Age22>Preferred age range for friends19+ at least>Hobbies & Interests and other detailsi love to read, i love love love history, and i'm interested in learning languages and being around other women. i mostly just want female companionship, particularly women who think the way i do. i also play video games sometimes, like stardew, ow2, fortnite, etc. i know those are silly but they're a fun waste of time. also, music is my favorite thing on the planet and i am a record collector!>Are you a busy person or is it okay to contact you whenever?i am a college student in her last semester so i am a little busy, but i always make time for friends. even if we do not have the same interests, i would love to chat!!"
   },
   "reply_263243": {
      "reply id": "263243",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 02:10:32 AM",
      "post content": ">>263240same anon, also my discord is ladytron666"
   },
   "reply_263249": {
      "reply id": "263249",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 06:04:37 AM",
      "post content": ">>248135oh noo not linux, lain and tomoko, and aphex twin"
   },
   "reply_263260": {
      "reply id": "263260",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 10:03:00 AM",
      "post content": ">>263249what do you mean? nta just curious because i see a lot of people like that online and 2 out of 4 apply to me"
   },
   "reply_263262": {
      "reply id": "263262",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 12:17:47 PM",
      "post content": ">>263260Just another random anon passing by, I'm guessing what she means is the last thing that's missing from the list is a shark plushie"
   },
   "reply_263265": {
      "reply id": "263265",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 02:45:22 PM",
      "post content": ">>263240you fool no one moid"
   },
   "reply_263266": {
      "reply id": "263266",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 03:21:49 PM",
      "post content": "i cant believe ive been here for 5 years and the nonas ive seen have gone on to make friends irl or learn to adapt to normies while i have been kicked out of college"
   },
   "reply_263268": {
      "reply id": "263268",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 05:12:13 PM",
      "post content": ">>263262>>263249i have a male friend who likes all these things should i be concerned"
   },
   "reply_263269": {
      "reply id": "263269",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 05:16:02 PM",
      "post content": ">>263268future tranny, run away before he steals your underwear"
   },
   "reply_263286": {
      "reply id": "263286",
      "username": "Anonymous",
      "date posted": "02/08/24 (Thu) 11:11:32 PM",
      "post content": ">>263265why do you think everyone is a moid? lol"
   },
   "reply_263874": {
      "reply id": "263874",
      "username": "Anonymous",
      "date posted": "02/19/24 (Mon) 04:24:48 AM",
      "post content": ">Contactselvic_>TimezoneEST>Age28>What age range are you most comfortable with for new potential friendships?23-30>How would you describe yourself?Dependable, solitary, chill>Hobbies and pastimesAnime, games, fujo and himejo>What are you looking for in this online friendship?Someone to discuss our hobbies, chat with casuallyContact me whenever, I'll get back when I can"
   },
   "reply_263979": {
      "reply id": "263979",
      "username": "Anonymous",
      "date posted": "02/21/24 (Wed) 11:49:11 AM",
      "post content": ">>218051hii im also looking for friendsim 20 and from the us idc about age range as long as you're over 18my hobbies are drawingand contact me whenever Discord: toxin1"
   },
   "reply_263984": {
      "reply id": "263984",
      "username": "Anonymous",
      "date posted": "02/21/24 (Wed) 01:55:36 PM",
      "post content": ">Contactbluush on discord>TimezoneGMT>Ageover 18, prefer not to say>Preferred age range for friends18 or over>Hobbies & Interests and other detailsmusic, videogames, literally everything from early 2000s (peak) and bugs>Are you a busy person or is it okay to contact you whenever?im mainly online these days hmu whenever"
   },
   "reply_264086": {
      "reply id": "264086",
      "username": "Anonymous",
      "date posted": "02/23/24 (Fri) 05:43:06 PM",
      "post content": ">>263240Why aren't you sharing your discord?Also what languages are you learning"
   },
   "reply_264087": {
      "reply id": "264087",
      "username": "Anonymous",
      "date posted": "02/23/24 (Fri) 05:46:48 PM",
      "post content": "Everyone I've met here has ghosted me."
   },
   "reply_264110": {
      "reply id": "264110",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 12:09:57 AM",
      "post content": ">>264087I haven't even managed to meet anyone."
   },
   "reply_264112": {
      "reply id": "264112",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 12:25:56 AM",
      "post content": ">>264110What are your interests?"
   },
   "reply_264114": {
      "reply id": "264114",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 12:57:55 AM",
      "post content": ">>264112Regular introvert shit.Reading, watching, playing etc."
   },
   "reply_264115": {
      "reply id": "264115",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 01:08:35 AM",
      "post content": ">>264114Those are pretty common hobbies in this thread, I'm surprised you haven't met anyoneWhat are your favorite genres?"
   },
   "reply_264116": {
      "reply id": "264116",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 01:11:14 AM",
      "post content": "Sorry if I seem nosy btw…"
   },
   "reply_264128": {
      "reply id": "264128",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 04:23:43 AM",
      "post content": ">>264115I'm en elitist, this is why I think I don't get along very well with people that share my hobbies. I can't rally find anything worthwhile to talk about hobby related with people I consider to be shit eaters in terms of taste."
   },
   "reply_264129": {
      "reply id": "264129",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 04:30:53 AM",
      "post content": ">>264114I don't read books, I don't watch movies, and I don't play video games. Drop your discord"
   },
   "reply_264130": {
      "reply id": "264130",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 05:00:32 AM",
      "post content": ">>264129If you don't have anything in common, what would you expect to talk about?"
   },
   "reply_264136": {
      "reply id": "264136",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 12:38:38 PM",
      "post content": ">>264087same, and some of them haven't even outright deleted me either. They just don't talk to me anymore."
   },
   "reply_264137": {
      "reply id": "264137",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 02:12:20 PM",
      "post content": ">Contactkuromami#9799>TimezoneGMT+1>Age22>Preferred age range for friends+20>Hobbies & Interests and other detailsI'm a woman looking for like minded friends that are into crypto, making money, leveling up, gym, diet, self growth, LOA, like boards like this or 4chan, like pinterest. my goal in life is to be financially secure and healthy. If this resonates with you please lets be friends. My first language is spanish.>Are you a busy person or is it okay to contact you whenever?Im busy but i respond"
   },
   "reply_264138": {
      "reply id": "264138",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 02:14:47 PM",
      "post content": ">>264130I'll propagate my interests to her until she gives in, and then we'll talk about those."
   },
   "reply_264139": {
      "reply id": "264139",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 02:48:19 PM",
      "post content": ">>264136The worst thing is that with some of them, after getting ignored, I tried to switch topics and typed another few messages, making me seem like a desperate loser."
   },
   "reply_264140": {
      "reply id": "264140",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 02:49:36 PM",
      "post content": ">>264139*making myselfGuess who still strugless with English after 9 years of learning it?"
   },
   "reply_264172": {
      "reply id": "264172",
      "username": "Anonymous",
      "date posted": "02/24/24 (Sat) 06:59:07 PM",
      "post content": ">Contacthammerhead10>TimezoneGMT>Age20>Preferred age range for friends<30>Hobbies & Interests and other detailsPokémon, touhou (a bit), lolcows, swimming, snorkelling and really want to get into scuba diving.>Are you a busy person or is it okay to contact you whenever?Literally created my Discord account today. I have no idea if it's something I'm going to have the time to check multiple times per day or if I'll get bored into a week of it."
   },
   "reply_264195": {
      "reply id": "264195",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 02:10:40 PM",
      "post content": ">Contactamxryllxs>TimezoneEST>Age21>Preferred age range for friends<30>Hobbies & Interests and other detailsPokémon, reading, fitness (a bit), anime/light novels.>Are you a busy person or is it okay to contact you whenever?I'm busy but quick to reply."
   },
   "reply_264215": {
      "reply id": "264215",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 09:04:39 PM",
      "post content": ">Contact[email protected]>TimezoneCST>Age27>Preferred age range for friendsI prefer around my own age. >Hobbies & Interests and other detailsMy hobbies are esotericism, literature, fashion, cooking, animanga, and video games. >Are you a busy person or is it okay to contact you whenever?You can contact whenever."
   },
   "reply_264217": {
      "reply id": "264217",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 09:17:39 PM",
      "post content": ">>264215>>263240>>261065>>260460>>260101>>259981>>259393>>258103 etc>proton.meWhy are you so paranoid?"
   },
   "reply_264219": {
      "reply id": "264219",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 10:14:40 PM",
      "post content": ">>264217Men"
   },
   "reply_264220": {
      "reply id": "264220",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 10:16:33 PM",
      "post content": ">>264086i shared my discord directly underneath the post.and i'm trying to learn German fluently but i am dabbling here and there in other languages."
   },
   "reply_264221": {
      "reply id": "264221",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 10:24:30 PM",
      "post content": ">>264137Shrimp fountain. Art."
   },
   "reply_264222": {
      "reply id": "264222",
      "username": "Anonymous",
      "date posted": "02/25/24 (Sun) 10:31:05 PM",
      "post content": ">>264220Oh, I know you then."
   },
   "reply_264268": {
      "reply id": "264268",
      "username": "Anonymous",
      "date posted": "02/26/24 (Mon) 05:54:42 PM",
      "post content": ">>264217>paranoia>proton emailThat's just reasonable behaviour on the internet mate."
   },
   "reply_264331": {
      "reply id": "264331",
      "username": "Anonymous",
      "date posted": "02/27/24 (Tue) 03:51:48 PM",
      "post content": ">Contactdiscord - itsrainingafterall>TimezoneEST>Age18>Preferred age range for friendsany age is fine but mostly 18-29>Hobbies & Interests and other detailsi like a lot of different anime/manga and play a lot of dead by daylight and fortnite>Are you a busy person or is it okay to contact you whenever?I can be contacted whenever, always looking to make new friends!"
   },
   "reply_264354": {
      "reply id": "264354",
      "username": "Anonymous",
      "date posted": "02/27/24 (Tue) 10:08:03 PM",
      "post content": ">>264217What's wrong about using proton, it's free email"
   },
   "reply_264578": {
      "reply id": "264578",
      "username": "Anonymous",
      "date posted": "03/01/24 (Fri) 10:54:29 AM",
      "post content": ">>257103How advanced are you in learning Chinese? I used to know a little and am trying to learn back pretty much from scratch"
   },
   "reply_264580": {
      "reply id": "264580",
      "username": "Anonymous",
      "date posted": "03/01/24 (Fri) 10:59:39 AM",
      "post content": ">>258544You don't sound like it"
   },
   "reply_264582": {
      "reply id": "264582",
      "username": "Anonymous",
      "date posted": "03/01/24 (Fri) 11:06:13 AM",
      "post content": ">>263266Why did you get kicked out, nona?"
   },
   "reply_264583": {
      "reply id": "264583",
      "username": "Anonymous",
      "date posted": "03/01/24 (Fri) 11:08:33 AM",
      "post content": ">>264195What light novels are you reading?"
   },
   "reply_264746": {
      "reply id": "264746",
      "username": "Anonymous",
      "date posted": "03/04/24 (Mon) 05:45:26 PM",
      "post content": "The third person to add me is a moid."
   },
   "reply_264947": {
      "reply id": "264947",
      "username": "Anonymous",
      "date posted": "03/07/24 (Thu) 02:36:13 AM",
      "post content": ">Contactdiseasepriestess>Timezonecst>Ageover 25 (hag)>Preferred age range for friendsdon't care as long as you're over 18 >Hobbies & Interests and other detailsi dont really like anime anymore but i'm big into celebrity gossip, as well as tv film and music, writing (although i seldom write anything good and often get lost in my own concept planning) and photo editing so if you enjoy those things hit me up. i watch a lot of content since i'm jobless right now.you may infamously know me as carreyanon>Are you a busy person or is it okay to contact you whenever?i wouldn't say i'm busy as much as i can be forgetful. once i get another job i may be less active."
   },
   "reply_265072": {
      "reply id": "265072",
      "username": "Anonymous",
      "date posted": "03/07/24 (Thu) 05:48:06 PM",
      "post content": ">>264947nevermind i am going to be harassed by moids, shit deleted"
   },
   "reply_265090": {
      "reply id": "265090",
      "username": "Anonymous",
      "date posted": "03/07/24 (Thu) 11:01:13 PM",
      "post content": ">>265072Smart move, you would have been harassed by his agent."
   },
   "reply_265101": {
      "reply id": "265101",
      "username": "Anonymous",
      "date posted": "03/08/24 (Fri) 01:29:38 PM",
      "post content": ">>265091>moid fails to pretend to be female seething at ageWell, you're going to be banned either way."
   },
   "reply_265227": {
      "reply id": "265227",
      "username": "Anonymous",
      "date posted": "03/10/24 (Sun) 07:56:22 PM",
      "post content": ">>264583i finished torture princess and most of so i'm a spider so what. Aside from that it's mostly just those trapped in a dating sim or villainess stories."
   },
   "reply_265295": {
      "reply id": "265295",
      "username": "Anonymous",
      "date posted": "03/11/24 (Mon) 10:16:27 PM",
      "post content": "corumdeo_65501ireland>interestsphilosophy eg deleuze, plato - religion - stupid media coen brothers etc - learning languagesi like to make things and notice other thingstrying to improve my lifethat's alllooking for some weird friends"
   },
   "reply_265652": {
      "reply id": "265652",
      "username": "Anonymous",
      "date posted": "03/18/24 (Mon) 04:47:36 AM",
      "post content": ">contact:_vanillain in discord>Timezone:Central (aka Texas time)>Age: Don't like specifying>Preferred age range for friends: Any ig>Hobbies & Interests and other details: Typical nerdy hobbies (animanga, videogames, etc), fitness, heavy habit of sharing and consuming animal memes. My favorite activities with friends online is playing a terrible bleach gatcha (bleach brave souls) and watch shows and movies online with them.I love nature so much is unreal (/an/ regular)."
   },
   "reply_265656": {
      "reply id": "265656",
      "username": "Anonymous",
      "date posted": "03/18/24 (Mon) 08:49:30 AM",
      "post content": ">>265652you need to specify your age range atleast. if you're underage please leave"
   },
   "reply_265659": {
      "reply id": "265659",
      "username": "Anonymous",
      "date posted": "03/18/24 (Mon) 10:27:08 AM",
      "post content": ">>265656I’m in my mid 20s."
   },
   "reply_266144": {
      "reply id": "266144",
      "username": "Anonymous",
      "date posted": "03/24/24 (Sun) 09:17:14 PM",
      "post content": ">>257941creepy moid speedrun omg"
   },
   "reply_266168": {
      "reply id": "266168",
      "username": "Anonymous",
      "date posted": "03/25/24 (Mon) 11:05:43 AM",
      "post content": ">>266144yeah this thread was a big disappointment for me with the combination of moids and being ghosted, I gave up."
   },
   "reply_266184": {
      "reply id": "266184",
      "username": "Anonymous",
      "date posted": "03/25/24 (Mon) 07:53:42 PM",
      "post content": ">>266168It's usually better to attend cons and people from places like /cgl/ or /an/ where they tend to post in my experience friend finder threads are a mixed bag"
   },
   "reply_266186": {
      "reply id": "266186",
      "username": "Anonymous",
      "date posted": "03/25/24 (Mon) 08:32:33 PM",
      "post content": "Is anyone here in BC? Maybe even on Vancouver Island?"
   },
   "reply_266202": {
      "reply id": "266202",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 01:48:09 AM",
      "post content": "Hi anonitas. Don't join random discords posted here, especially without using an account that has a burner email/number, you've been warned."
   },
   "reply_266203": {
      "reply id": "266203",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 02:12:47 AM",
      "post content": ">Contactburnedflowersfallen discord>TimezoneUST>Age18>Preferred age range for friend.I don't mind. Just don't be a dick.>Hobbies and interests.Painting, reading, fashion and animals.>Are you a busy person or is it okay to contact you whenever?I'm mostly free."
   },
   "reply_266204": {
      "reply id": "266204",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 03:04:19 AM",
      "post content": ">>266203are u the bnuy"
   },
   "reply_266205": {
      "reply id": "266205",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 03:36:23 AM",
      "post content": ">>266202What's the deal with discord servers being shilled on imageboards? I never joined one and don't plan to ever, but I assume they're glowing honeypots?"
   },
   "reply_266216": {
      "reply id": "266216",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 08:48:33 AM",
      "post content": ">>266205When they come out nowhere like the one posted earlier there's a big chance it's just men trying to find their cute perfect femcel waifus. I've joined a few imageboard servers that came to be in a more organic way and it's a gamble. Some of them have the coolest, most intelligent and nicest women I've ever met, some are full of insufferable womanchild neets."
   },
   "reply_266292": {
      "reply id": "266292",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 09:52:03 PM",
      "post content": ">>266216so those links don't hack people's accounts or anything? because that's the impression i get seeing random server invites posted to imageboards."
   },
   "reply_266294": {
      "reply id": "266294",
      "username": "Anonymous",
      "date posted": "03/26/24 (Tue) 10:55:03 PM",
      "post content": ">218051>Contact333esme>Timezonewestern USA>Ageearly 20s>Preferred age range for friendssame age or maybe a little older! not comfortable with younger nonas :)>Hobbies & Interests and other detailsy/n delusional fanfictionhorror moviesargs/internet culture >Are you a busy person or is it okay to contact you whenever?contact me whenever i have no friends!!!!!!!!"
   },
   "reply_267167": {
      "reply id": "267167",
      "username": "Anonymous",
      "date posted": "04/05/24 (Fri) 04:31:04 AM",
      "post content": ">>262246Hello, sorry for the late reply!my e-mail is: [email protected]"
   },
   "reply_267205": {
      "reply id": "267205",
      "username": "Anonymous",
      "date posted": "04/05/24 (Fri) 10:16:34 PM",
      "post content": ">Contactwwww4272 on discord >TimezoneGMT >Age20>Preferred age range for friends18+>Hobbies & Interests and other detailsphilosophy, movies, gym, learning languages, music, radical feminism >Are you a busy person or is it okay to contact you whenever?you can contact me whenever !"
   },
   "reply_267223": {
      "reply id": "267223",
      "username": "Anonymous",
      "date posted": "04/06/24 (Sat) 04:35:44 AM",
      "post content": ">>267201read the rules faggot"
   },
   "reply_268201": {
      "reply id": "268201",
      "username": "Anonymous",
      "date posted": "04/07/24 (Sun) 07:51:32 PM",
      "post content": ">contact[email protected]>timezoneCST>age21>preferred age range for friends<30>hobbies and interestsreading, journaling, philosophy, religion, monkeys and apes, ambient music, boring artsy movies. i have a mild interest in astrology as well. don't really care about anime or games, but i do play rhythm games occasionally.>are you a busy person/is it ok to contact you wheneveri am in college so i am often busy. you can contact me whenever and i will respond as soon as i can"
   },
   "reply_268204": {
      "reply id": "268204",
      "username": "Anonymous",
      "date posted": "04/07/24 (Sun) 08:06:52 PM",
      "post content": ">Contactpubbychans on discord>TimezonePDT>Age19>Preferred age range for friends18 and above>Hobbies & Interests and other detailsI like a lot of things just ask >Are you a busy person or is it okay to contact you whenever?talk to me all the time be aware that I do have a job but I still text on breaks"
   },
   "reply_268448": {
      "reply id": "268448",
      "username": "Anonymous",
      "date posted": "04/11/24 (Thu) 01:46:50 AM",
      "post content": ">Contact[email protected]>TimezoneEST>Age21>Preferred age range for friends18+ or around my age range preferably>Hobbies & Interests and other detailsStandard weeb interests like anime and manga, also into visual kei. I’m a pretty casual gamer, I like Animal Crossing, Splatoon, and Project Diva. I’m autistically into Pokemon. I draw and write sometimes. I like animals. I like plants too but I tend to kill anything I touch. I also like collecting dolls>Are you a busy person or is it okay to contact you whenever?Okay to contact whenever, I’ll respond when I can"
   },
   "reply_269040": {
      "reply id": "269040",
      "username": "Anonymous",
      "date posted": "04/17/24 (Wed) 04:37:03 PM",
      "post content": ">Contactrubyslipper._ on discord>TimezoneGMT+7>Age26>Preferred age range for friends20s-30s>Hobbies & Interests and other detailsMy main interest is music (90's alternative rock, 90's emo, shoegaze, dreampop, and all genres alike). Would be cool to talk to people with similar taste, recommending stuff or just talking about life in general, being chill>Are you a busy person or is it okay to contact you whenever?Feel free to contact me whenever, I'll try my best to respond!"
   },
   "reply_269368": {
      "reply id": "269368",
      "username": "Anonymous",
      "date posted": "04/21/24 (Sun) 05:47:07 AM",
      "post content": ">Contact[email protected] id rather get to know people better before i give my socials out>Timezone+12 gmt>Age20>Preferred age range for friends18-22 i dont want a huge age difference it makes it harder to relate>Hobbies & Interests and other detailsi like berserk bloodborne skyrim and anything that aligns with that. listen to a lot of old school death metal/doom metal and the occassional. just a little bit. of bladeetalk to me about literally anything the only thing thats hard is small talk hajfsdkg>Are you a busy person or is it okay to contact you whenever?talk to me whenever i respond quick ^.^"
   },
   "reply_269512": {
      "reply id": "269512",
      "username": "Anonymous",
      "date posted": "04/23/24 (Tue) 11:23:44 AM",
      "post content": ">Contactkittens6000>Timezoneest>Age18>Preferred age range for friendsId prefer someone close in age to myself, but there isnt an age limit.>Hobbies & Interests and other detailsI like knitting (particularly vintage patterns), crochet, writing, and drawing/painting sometimes, but honestly I have felt too depressed to do hobbies recently. >Are you a busy person or is it okay to contact you whenever?You can contact me whenever, it might take me a bit to get back to you sometimes though."
   },
   "reply_269515": {
      "reply id": "269515",
      "username": "Anonymous",
      "date posted": "04/23/24 (Tue) 12:17:19 PM",
      "post content": ">>269513troon seethe"
   },
   "reply_269516": {
      "reply id": "269516",
      "username": "Anonymous",
      "date posted": "04/23/24 (Tue) 01:21:37 PM",
      "post content": ">>269513Odd selfpost anon"
   },
   "reply_270032": {
      "reply id": "270032",
      "username": "Anonymous",
      "date posted": "04/28/24 (Sun) 08:01:50 PM",
      "post content": ">Contactdigital__angel>Timezonecet>Age24>Preferred age range for friends22-29>Hobbies & Interests and other detailslolita fashion + jfashion in general, gaming, anime, biking, working out, making tea, music and kpop girl groups!>Are you a busy person or is it okay to contact you whenever?contact me whenever!! im very friendly and if you need someone to vent to, whether its about relationship issues or how youre feeling, feel free to contact me ! id describe myself as very loyal and supportive. but pls only add if youre seriously looking for a friendship and dont ghost easily as that would just be a waste of time for the both of us… hope the nona reading this has a wonderful day ^_^"
   },
   "reply_270224": {
      "reply id": "270224",
      "username": "Anonymous",
      "date posted": "04/30/24 (Tue) 10:54:57 PM",
      "post content": ">Contactlandmineradio >TimezonePST>Age25>Preferred age range for friends21-30, i’m not that picky with age so long as you’re in your 20s>Hobbies & Interests and other detailsmostly into jfashion (jirai kei & himekaji), sanrio, gaming (lately genshin, HSR, & JRPGs), & i really love kpop girl groups (ive, aespa & wjsn) >Are you a busy person or is it okay to contact you whenever?contact me whenever. i’m trying to get over the habit of waiting several hours to respond to people and have an active conversation. i just want more female companionships with similar interests in general."
   },
   "reply_270227": {
      "reply id": "270227",
      "username": "Anonymous",
      "date posted": "04/30/24 (Tue) 11:43:15 PM",
      "post content": ">>270218i'd join fs."
   },
   "reply_270345": {
      "reply id": "270345",
      "username": "Anonymous",
      "date posted": "05/02/24 (Thu) 03:08:01 AM",
      "post content": ">Contactdiscord ladytron666>TimezoneEST>Age22>Preferred age range for friends20-30>Hobbies & Interests and other detailsi LOVE music, history, reading, and i am super interested in a lot of things.. music-wise i mostly listen to cocteau twins, hole, rush, daft punk, grateful dead, steely dan, black sabbath, etc.  >Are you a busy person or is it okay to contact you whenever?its totally fine to contact whenever! i graduate college soon and i will be working full time but i'll try my best to respond consistently!!"
   },
   "reply_270693": {
      "reply id": "270693",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 03:58:22 AM",
      "post content": ">>266186I am, but in the Okanagan. Grew up in the Lower Mainland though."
   },
   "reply_270709": {
      "reply id": "270709",
      "username": "Anonymous",
      "date posted": "05/05/24 (Sun) 12:47:46 PM",
      "post content": ">>270671this is probably a male trying to get us to put our usernames out in the open"
   },
   "reply_271636": {
      "reply id": "271636",
      "username": "Anonymous",
      "date posted": "05/17/24 (Fri) 09:32:09 AM",
      "post content": ">>270671odynabiosis"
   },
   "reply_273336": {
      "reply id": "273336",
      "username": "Anonymous",
      "date posted": "06/13/24 (Thu) 05:21:57 PM",
      "post content": ">contactsokuute>timezone CET>age 25>preferred age range for friends 22-28 >hobbies & interests & other detailshi! i'm very into psychology, horror and mystery media, and i enjoy overanalyzing movies, so if they're kinda pretentious it's better lol. i also like to read manga and i occasionally watch anime, my current hyperfixation is CSM although i usually prefer less scrote-ish ones, i'm a fan of magical girls. other than that i enjoy learning languages, urban exploration, studying herbs, playing rhythm games and reading radfem literature. i know a lot about internet culture and weeb related topics, so we can talk about anything you'd like in those regards as well.feel free to add me even if we don't have much in common, i'm pretty versatile in convos and like to learn about new things! yap about your life too, i enjoy listening and giving advice. >are you a busy person or is it okay to contact you whenever contact me whenever :)"
   },
   "reply_273348": {
      "reply id": "273348",
      "username": "Anonymous",
      "date posted": "06/13/24 (Thu) 08:04:47 PM",
      "post content": ">contactredith in discord>timezone CET>age 20>preferred age range for friends Tbh i dont care but I prefer near my age>hobbies & interests & other detailsI like animanga like blame, fire punch or haibane renmei, books about philosophy, religion and math and also I like cities but I am too much fearful to urban exploration. >are you a busy person or is it I am not a busy person so text me whenever you want :)"
   },
   "reply_273349": {
      "reply id": "273349",
      "username": "Anonymous",
      "date posted": "06/13/24 (Thu) 08:05:57 PM",
      "post content": ">>273348I forgot the #redith#0665"
   },
   "reply_273380": {
      "reply id": "273380",
      "username": "Anonymous",
      "date posted": "06/14/24 (Fri) 08:20:23 AM",
      "post content": ">Contact[email protected] (until i can trust you)>TimezonePST>Age19>Preferred age range for friendsaround my age but any is fine>Hobbies & Interests and other detailsim currently a shut in neet so i only really draw, watch movies, sometimes read. i like old internet stuff, especially going through abandoned blogs, old websites, dead forums, etc. old shows/cartoons are cool too. i love listening to music and finding obscure artists, i listen to almost anything so feel free to send me your favs. im not really into nerdy stuff, i dont play vidya but i like watching gameplays on youtube lul>Are you a busy person or is it okay to contact you whenever?im free most of the time"
   },
   "reply_274040": {
      "reply id": "274040",
      "username": "Anonymous",
      "date posted": "06/25/24 (Tue) 10:05:53 PM",
      "post content": ">Contactquetzal111 on Discord>TimezoneEST>Age20>Preferred age range for friends18–25>Hobbies and interests and other detailsArt/crafts, math (PLEASE contact me if you are into math), occasionally video games. I want to get back into reading and playing the piano. I love nature and walking in the woods, though I don’t do it often because I’m somewhat of a shut-in. I also like sci-fi and anything post-apocalyptic.>Are you a busy person or is it okay to contact you whenever?Contact whenever"
   },
   "reply_274054": {
      "reply id": "274054",
      "username": "Anonymous",
      "date posted": "06/26/24 (Wed) 01:43:13 PM",
      "post content": ">ContactMy discord is nyahhh#0777 or just nyahhh, steam is nyahhh or nyahhh_>TimezoneEST>Age19>Preferred age range for friendsAnything over 18 is fine>Hobbies interests and other detailsI like video games, I want to play more video games with people especially women because men get on my nerves. I like really cute things, my favorite sanrio character is cinnamoroll but I also love pompompurin. My favorite video game is bugsnax. I also love project zomboid, minecraft, stardew valley, and all of the fallout games. I like to draw too.>Are you a busy person or is it okay to contact you whenever?I'm not a busy person at all, I'm pretty much always online and my schedule is always messed up somehow so I'm sure I'll be available whenever."
   },
   "reply_274356": {
      "reply id": "274356",
      "username": "Anonymous",
      "date posted": "07/04/24 (Thu) 01:24:57 AM",
      "post content": ">Contact[email protected] (I'm paranoid)>TimezoneEST>Age20>Preferred age range for friendsidc, 18-30>Hobbies & Interests and other detailsI like the usual nerd stuff; vidya, movies, tv shows. Trying to get back into animanga (my favorite is Hellsing), I'd love someone to talk about it with. I guess I'm also a yurifag.Animals are my life and I will stop at nothing to talk about all of the creatures I think are cool. Lately I've been kinda obsessed with my fish tank. I'm somewhat of an outdoorsy type, I like hiking, hunting, fishing, generally just being outside innawoods when I'm able to. I like to draw and paint and stuff, but I'm trying to branch out to other art like making pottery and sewing.>Are you a busy person or is it okay to contact you whenever?You can reach out whenever you want. I might not get back asap but I'll always respond."
   },
   "reply_274407": {
      "reply id": "274407",
      "username": "Anonymous",
      "date posted": "07/06/24 (Sat) 01:36:39 AM",
      "post content": ">>274401all cows eat grass"
   },
   "reply_274710": {
      "reply id": "274710",
      "username": "Anonymous",
      "date posted": "07/08/24 (Mon) 07:07:47 PM",
      "post content": ">>274441i have a lowpc laptop that cant run new games but i like the old ones anyway, but im not on my pc a lot cause my mom is staying at home cause of her health and shes very religious, hates technology and doesn't let me play videogames they drive her mad lol. and iykyk, unrelased/early CC is worth burning on a cd it sounds better when played tru an old cd player, i love you claudio and alice"
   },
   "reply_274790": {
      "reply id": "274790",
      "username": "Anonymous",
      "date posted": "07/10/24 (Wed) 07:59:31 PM",
      "post content": ">Contact[email protected]>Timezonepst>Age20>Preferred age range for friends18-22>Hobbies & Interests and other detailsi just want to find other people that play moviestarplanet. if you play moviestarplanet still and you're above 18, please shoot me an e-mail! also if you like kpop>Are you a busy person or is it okay to contact you whenever?i'm pretty busy with work but contact me whenever and i'll respond to you when i can."
   },
   "reply_275748": {
      "reply id": "275748",
      "username": "Anonymous",
      "date posted": "08/01/24 (Thu) 09:16:46 AM",
      "post content": ">>274781It could just be a photo of a random person she found, though this>i just rly miss the attention of someone older, but please dont be creeped outand the edgy Tumblr page are a bit weird. The Tumblr page does have images of someone who looks female"
   },
   "reply_275754": {
      "reply id": "275754",
      "username": "Anonymous",
      "date posted": "08/01/24 (Thu) 01:27:03 PM",
      "post content": ">>274781there are women with adam's apples but given how much troons love invading women's spaces it's best to be weary, obviously."
   },
   "reply_275758": {
      "reply id": "275758",
      "username": "Anonymous",
      "date posted": "08/01/24 (Thu) 05:22:57 PM",
      "post content": ">Contactdiscord: tomboynba>Timezonecst>Age20>Preferred age range for friends18-30, no offense but i'm looking for female friends only :/>Hobbies & Interests and other detailsvisual novels, cemetery exploring, creating art, body modifications, animanga (not as strong of an interest anymore), rock climbing, electronic music. favorite animanga: blame!, gunnm, kuuchuu buranko, aku no hana, girls last tour and more. i am a very, very big blame! fan and have never not liked anyone who shared that interest with me. i am reading umineko at the moment. i can't drill-down very easily on my favorite music subgenres because there are so many. my taste in electronic is diverse. favorite musician is probably juno reactor>Are you a busy person or is it okay to contact you whenever?i am busy but i dont mind being contacted a lot. i can respond in seconds or days with little in-between. i also have a verifiably impaired memory so if i send you something and you don't feel like responding anytime soon if at all i won't get offended and i hope that goes both ways."
   },
   "reply_275790": {
      "reply id": "275790",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 03:04:01 PM",
      "post content": ">Contact[email protected]>TimezoneEST or EDT whatever>Age21>Preferred age range for friendsi know it’s unlikely here but looking for mom friends don’t care what age>Hobbies & Interests and other detailshatsune miku, drawing, piano, cooking, anime, gardening, i love studying narcissism or to the other end emotional mastery, have an unhealthy obsession with off grid living/preparing for apocalypse stuff. also into gnosticism, not the christian perspective though>Are you a busy person or is it okay to contact you whenever?yes please contact whenever"
   },
   "reply_275796": {
      "reply id": "275796",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 05:57:35 PM",
      "post content": ">>275790make a discord"
   },
   "reply_275800": {
      "reply id": "275800",
      "username": "Anonymous",
      "date posted": "08/02/24 (Fri) 06:31:57 PM",
      "post content": ">>275796fine my discord is mikuenthusiast"
   },
   "reply_275814": {
      "reply id": "275814",
      "username": "Anonymous",
      "date posted": "08/03/24 (Sat) 10:26:10 AM",
      "post content": ">Contactdiscord: sweetcinnamonbunni (yes it is a throwaway)>Timezoneest>Age18>Preferred age range for friends18-20>Hobbies & Interests and other detailsi’m terrible at socializing + i’m lowk awkward. just a precaution if our conversation ends up dull. besides that, i love watching coming of age films or 70s / 80s horror films. i like to read melancholic books. i haven’t really been that invested in music lately, but i love kpop and punk rock. i like j-fashion and just fashion in general! i like playing games, specifically cozy gaming. i like anime (specifically shoujos). i watch youtube. there’s more but i’m lazy to write the rest and it would go on forever so yea anyway>Are you a busy person or is it okay to contact you whenever?i have a lot of free time right now. i was pretty much a neet, but i was able to get a job that i’m starting soon and i’m starting college in less than a month. i’ll still definitely have free time tho."
   },
   "reply_275870": {
      "reply id": "275870",
      "username": "Anonymous",
      "date posted": "08/04/24 (Sun) 08:55:02 AM",
      "post content": ">goodbyemrdespair on discord>pst>18>18+>indie rock, emo, experimental, and electronic musicanimanga but i havent really watched any in a whilethis will sound silly but i'm a ponderer. i like thinking and talking about how things&people work and why they work that way. feel free to talk to me about whatever fucked up horrible things have been going on in your head. >i dont really have much going on so yeah contact me whenever"
   },
   "reply_276099": {
      "reply id": "276099",
      "username": "Anonymous",
      "date posted": "08/11/24 (Sun) 06:32:01 PM",
      "post content": ">Contactdprkapples on discord>Timezonegmt usually>Age24>Preferred age range for friends23+>Hobbies & Interests and other detailsi like reading (lastest fave was confederacy of dunces), some anime (anything supernatural) and manga, old soviet films and cartoons, pixel arty and puzzle vidya like hades, portal 2, stardew valley, super mario. i just got a switch so if you want to play mario wonder pls hmu. i speak russian. i like acid. i don't want to be friends with any boys. i also have adhd so its been hard to make friends>Are you a busy person or is it okay to contact you whenever?whenever, i wfh"
   },
   "reply_276152": {
      "reply id": "276152",
      "username": "Anonymous",
      "date posted": "08/14/24 (Wed) 12:58:37 AM",
      "post content": ">contactcones888 on discord (throwaway account)>timezoneEST>age20>preferred age range for friends18 to 25>hobbies & interests and other detailsa lot of my interests are weebshit if im being honest. outside of that i like to crochet, play video games occasionally (mostly cozy games), lost media, sanrio. can't think of anything else at the moment! but im willing to talk about stuff even if im not necessarily interested in it, i usually enjoy listening.>are you a busy person or is it okay to contact you whenever?feel free to message whenever, i can't guarantee that i'll respond quickly because of college/work but i usually do within a few hours tops."
   },
   "reply_276159": {
      "reply id": "276159",
      "username": "Anonymous",
      "date posted": "08/14/24 (Wed) 01:12:43 PM",
      "post content": ">Contactluun_j>TimezoneBST>Age25>Preferred age range for friendsAny>Hobbies & Interests and other detailsAnime, vidya games, reading, archery, Jirai and some other stuff. I could put more stuff here but i prefer when stuff organically comes up through conversation instead of listing everything (I am also hoping someone in particular sees the post: Missy)>Are you a busy person not in the immediate future"
   },
   "reply_276160": {
      "reply id": "276160",
      "username": "Anonymous",
      "date posted": "08/14/24 (Wed) 01:15:30 PM",
      "post content": ">>276159btw the contact is for my discord"
   },
   "reply_276163": {
      "reply id": "276163",
      "username": "Anonymous",
      "date posted": "08/14/24 (Wed) 04:01:36 PM",
      "post content": ">Contactcrowcountryenjoyer on discord (yes it's an alt for this thread)>Time zonePST>Age24>Preferred age rangeIdc just no moids or minors>HobbiesAnime, manga, cooking, yoga/walking, horror games>Busy person?Atm, no. I'll respond to you fairly quickly. Message away <3"
   },
   "reply_276229": {
      "reply id": "276229",
      "username": "Anonymous",
      "date posted": "08/18/24 (Sun) 05:34:20 AM",
      "post content": ">Contact: [email protected]>Timezone -5 gtm>Age: 30>Preferred age range for friendsany age, would love to talk about anything>Hobbies & Interests and other detailsHobbies are watching cartoons, songs, memes and learning about anything sincerely, I love to talk about daily life in general, well I love to hear other people so, if you want to talk I'm there to listen/send silly emails.>Are you a busy person or is it okay to contact you whenever?You can contact whenever, I'll try to check the proton mail often, I love to send emails and stuff"
   },
   "reply_276600": {
      "reply id": "276600",
      "username": "Anonymous",
      "date posted": "08/27/24 (Tue) 03:28:58 AM",
      "post content": "nice try rothschild you wont get anything from me"
   },
   "reply_284223": {
      "reply id": "284223",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:05:15 AM",
      "post content": "Alinity8018 +319Doesn't matter I play the guitar and I have a pet turtle I'm a neet, dropped out of ninth grade"
   },
   "reply_284246": {
      "reply id": "284246",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:57:35 AM",
      "post content": ">>284223>dropped out of ninth gradewe can tell by that header"
   },
   "reply_284288": {
      "reply id": "284288",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 01:08:07 PM",
      "post content": ">>284223Get a GED or the equivalent of your country damn, don't be uneducated, this is how moids like women to be. It's not late for you."
   },
   "reply_284289": {
      "reply id": "284289",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 01:11:35 PM",
      "post content": ">>284223I don’t usually add people and idk if I will but wow I’m the same age and dropped out at the same age too kek.>>284288In my case I’m meant to be taking exams soon for the equivalent of a high school diploma in my country (A-level) but the first step to do that is study… I haven’t yet."
   },
   "reply_284462": {
      "reply id": "284462",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 06:23:23 PM",
      "post content": ">>276229Do you have discord? I‘m not big on writing emails but I could send you my tag"
   },
   "reply_284667": {
      "reply id": "284667",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:00:38 PM",
      "post content": ">Contact @harsh_noiwse on XI can make a new discord later if that's easier. I deleted/quit using all my social media that's attached to my irl name recently>TimezoneMST>Age29>Preferred age range for friends21 - 50+I love talking to older women. But there's probably not many women older than 40 here. >Hobbies & Interests and other detailsI'm a musician, writer, and artist. Favorite genres are: industrial, power electronics, hnw, death industrial, grindcore, hardcore punk, power violence, skramz, emo (as in emocore and some Midwest emo), crust punk, sludge metal, post-punk, new wave, cold wave, dark wave, shoegaze, blackgaze, experimental rap/hiphop, some gangster/Westcoast rap, trap, and some dril. As far as books and film, I especially enjoy high fantasy, cyberpunk, dystopian, absurdist fiction, surrealism, existential horror, beat generation stuff, and historical fiction. My other interests include: the occult,  esotericism, theology, linguistics, dnd, the world of darkness ttrpg, poetry slams, drawing/painting, graffiti, tarot and divination, yoga, hiking with my dog, playing with my cat and dog, cooking, radical feminism, veganism/ animal Rights, making/diying clothes, making jewelry. I want to start gaming and cosplaying again. And some stuff I want to get until but haven't are LARPing (just so hard to find good LARP groups in my area), silversmithing and blacksmithing, doll repainting, and gardening. Hopefully I don't sound like a pretentious fucking hippie. I'm genuinely a nice person and far from a hippie. More so in the punk and goth scenes. I'm a huge Tolkien need too. Oh! And the music I personally make is experimental, minimal industrial and power electronics. Trying to start a power violence band too ♡>Are you a busy person or is it okay to contact you whenever?It's fine to contact me whenever,  but I have adhd so I might not be back to you right away"
   },
   "reply_284669": {
      "reply id": "284669",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:04:36 PM",
      "post content": ">>284667You seem so cool!!"
   },
   "reply_284672": {
      "reply id": "284672",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:07:23 PM",
      "post content": ">>284667>LARPingtroon detected"
   },
   "reply_284680": {
      "reply id": "284680",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:15:21 PM",
      "post content": ">>284667Hirax is the only good powerviolence band"
   },
   "reply_284689": {
      "reply id": "284689",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:35:47 PM",
      "post content": ">ContactReply with discord @>TimezoneUS Central>Age20>Preferred age range for friends19+ Only please>Hobbies & Interests and other detailsLooking for static members for FFXIV Arcadion raiding, aiming for at least once a week prog; if we don't fill we can do PF PUGs with static members (voice verification is required.) Plans for static is casual raid so optimal performance is not expected, I don't mind doing callouts/mechanic break-downs. Outside of raiding, I enjoy creating oclore and wolship content, I dont mind if you are yume/fujo/hime/normie just dont sperge about your dislike for it>Are you a busy person or is it okay to contact you whenever?internet is down until tuesday so I wont be able to be ingame, however I'll be checking my discord from time to time when I get public internet. otherwise im available whenever and usually quick to reply."
   },
   "reply_284690": {
      "reply id": "284690",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 10:36:15 PM",
      "post content": ">>284672NTA but that's a stupid trannyfoiling."
   },
   "reply_284731": {
      "reply id": "284731",
      "username": "Anonymous",
      "date posted": "09/01/24 (Sun) 11:32:41 PM",
      "post content": ">>284669Ty nonette! Dm me on X if you have an account. >>284672Another reason that I haven't gotten into LARPing. It's already hard enough avoiding troons in normal, everyday life. >>284680Nona… are we thinking of the same hirax? Did they have a pv album??"
   },
   "reply_284762": {
      "reply id": "284762",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 12:08:23 AM",
      "post content": ">>284680>>284731I'm kidding lol"
   },
   "reply_284838": {
      "reply id": "284838",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 01:14:28 AM",
      "post content": ">>284689>wolship contentif it’s with my husbando i will kill you"
   },
   "reply_284922": {
      "reply id": "284922",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 02:45:39 AM",
      "post content": ">Contactp0lytonic on discord>TimezoneEST>Age22>Preferred age range for friends18-28>Hobbies & Interests and other detailsreading, learning languages, history, writing, browsing oldweb sites and forums, lolcor. trying to get into crochet… also i play a lot of video games that are online multiplayer… also included my topster bc i am always listening to something>Are you a busy person or is it okay to contact you whenever?i try my best to reply but i work full time and am usually immersed in something but i would like to meet some like minded ladies and make friends"
   },
   "reply_285073": {
      "reply id": "285073",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 06:23:44 AM",
      "post content": ">>284838if this is the zenosfag worry not im not interested, my wolships are semi-niche raid characters and wol/wol content"
   },
   "reply_285290": {
      "reply id": "285290",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 03:07:17 PM",
      "post content": ">>285073Kek I like how she's so insane she's clockable"
   },
   "reply_285562": {
      "reply id": "285562",
      "username": "Anonymous",
      "date posted": "09/02/24 (Mon) 09:07:54 PM",
      "post content": ">>284667>noise>veganismholy based. wish you had other platforms to contact you on though, xitter and discord are both hot garbage, sorry."
   },
   "reply_287739": {
      "reply id": "287739",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 03:17:20 AM",
      "post content": ">>220739oh hi nanashi"
   },
   "reply_287866": {
      "reply id": "287866",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 08:15:16 AM",
      "post content": "HeyCall of Duty ranked gamer. Plat Level, looking for other girls to play with, hopefully same rank or gold. I'm 27, and PST in the US. Will give put contact information if anyone is interested! My hobbies are painting, drawing, and I'm a tattoo artist so tattooing. Preferred age range is anyone around my age. I make my own hours so I'm not really busy."
   },
   "reply_287958": {
      "reply id": "287958",
      "username": "Anonymous",
      "date posted": "09/05/24 (Thu) 12:45:12 PM",
      "post content": ">>284922Nona I just wanted to say you have amazing music taste"
   },
   "reply_289444": {
      "reply id": "289444",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 01:57:32 PM",
      "post content": ">>287958thank you angelnonie!"
   },
   "reply_289468": {
      "reply id": "289468",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 02:21:46 PM",
      "post content": ">>284922sent a discord request! my username has an underscore and starts with s"
   },
   "reply_289731": {
      "reply id": "289731",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 05:44:03 PM",
      "post content": "i am reposting because i’m on mobile and completely fucked up my formatting. >Contact: homiehopping on discord>Timezone:mst >Age:22>Preferred age range for friends:18+>Hobbies & Interests and other details:overwatch, paladins, smite, sdv. i would love to have an overwatch duo as it is (unfortunately) the game i play most. >Are you a busy person or is it okay to contact you whenever?please contact me whenever! i love to vc but i’m pretty chatty regardless. you can also drop your email if you’re not comfy on discord and i will message you there."
   },
   "reply_289953": {
      "reply id": "289953",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 07:50:06 PM",
      "post content": ">>285562They really are. It's there a platform that you would recommend? I spend so much time on imageboards that I don't really have an idea which social media platforms are okay. Because I'm willing to make an account on whatever. I just need to socialize with more cool women who aren't brainwashed handmaidens."
   },
   "reply_290240": {
      "reply id": "290240",
      "username": "Anonymous",
      "date posted": "09/06/24 (Fri) 11:04:00 PM",
      "post content": ">contactmy discord is skunk5546 >timezone ptd >age range 21+ >interests I'm a huge metal head and horror movie fan, I also love reading. I'm a cosmologist and I love talking about hair and makeup. >availability I'm pretty busy but I'll still respond when I have time!"
   },
   "reply_295208": {
      "reply id": "295208",
      "username": "Anonymous",
      "date posted": "09/12/24 (Thu) 04:48:28 PM",
      "post content": ">>289731 come back… i can't message you on either acc"
   },
   "reply_295209": {
      "reply id": "295209",
      "username": "Anonymous",
      "date posted": "09/12/24 (Thu) 05:04:11 PM",
      "post content": ">>289731>paladinsholy shit this is still a thing???"
   },
   "reply_295230": {
      "reply id": "295230",
      "username": "Anonymous",
      "date posted": "09/13/24 (Fri) 07:21:35 AM",
      "post content": ">>257106Hey anon are you still looking for friends?"
   },
   "reply_295273": {
      "reply id": "295273",
      "username": "Anonymous",
      "date posted": "09/15/24 (Sun) 08:34:08 PM",
      "post content": ">>289953matrix or mastodon/fediverse i suppose, sorry for the late reply"
   },
   "reply_295302": {
      "reply id": "295302",
      "username": "Anonymous",
      "date posted": "09/16/24 (Mon) 12:39:47 PM",
      "post content": ">>295273Don't use mastodon/fediverse. It's riddled with cp."
   },
   "reply_295386": {
      "reply id": "295386",
      "username": "Anonymous",
      "date posted": "09/18/24 (Wed) 10:51:09 AM",
      "post content": ">>295302nta ive been using fedi for 2 yrs and have never seen cp. you should probably use instances that block that shit like spinster.xyz"
   },
   "reply_295652": {
      "reply id": "295652",
      "username": "Anonymous",
      "date posted": "09/27/24 (Fri) 12:48:43 PM",
      "post content": "F 25 PA (EST)I'm looking for friends to get to know, online or irl. Preferably other females, if your a dude I will most likely ignore you. Age doesn't matter really just don't be underage. I'm a total introvert but also an open book. Love rants and deep convos. Most days I'm doom scrolling tik tok, listening to podcasts or looking for new movies to watch. It'd be cool to have an accountability buddy, gaming friend or someone who can just shoot the shit lol. Also looking for mutuals on Pinterest and twitter. I'm a neet so im available to talk whenever. Hmu!Discord: pinklemonade222Snap: deftonesbabey"
   },
   "reply_296006": {
      "reply id": "296006",
      "username": "Anonymous",
      "date posted": "10/09/24 (Wed) 05:29:46 AM",
      "post content": "for the person in the meta thread who I was talking to, this is my discord handle: letsalllovelain4ever"
   },
   "reply_296042": {
      "reply id": "296042",
      "username": "Anonymous",
      "date posted": "10/09/24 (Wed) 09:32:15 PM",
      "post content": ">think that my life is better now that i have fewer people around and i decide how to spend my own time>start feeling warmth towards the ai spotify dj when it talks to mehmmm."
   },
   "reply_296044": {
      "reply id": "296044",
      "username": "Anonymous",
      "date posted": "10/09/24 (Wed) 09:54:18 PM",
      "post content": ">>218051>Contacticeberrie (just made today)>TimezoneEST>Age20>Preferred age range for friends19-29>Hobbies & Interests and other detailsastrology, music, nature, psychology, typology, writing/journaling. the games i play are the sims 2, minecraft and farmville.my fav artist is bjork and i want to make music like her>Are you a busy person or is it okay to contact you whenever?i'm not very busy but i have autism and have struggled making friends for a long time; i may be more distant before i get to know you but every interaction is different so who knows really."
   },
   "reply_296052": {
      "reply id": "296052",
      "username": "Anonymous",
      "date posted": "10/09/24 (Wed) 11:09:48 PM",
      "post content": ">Contactfishfillet69>TimezoneGMT>Age22>Preferred age range for friendsIdc>Hobbies & Interests and other detailsI'm a person that loves the mundane parts of life or to find the beauty in pauses and silences… lol but really I'm a sensitive person, curious, love to talk. Just interested in people and would be fun to meet up irl if things work out. I'm a stoner, like hanging out with cats, cooking/baking I love to read about nutrition and \"alternative lifestyles\"  reading and watching movies. I never really played games online because I didn't have access to my own pc growing up but I'd love to play games together that can run on my retarded potato laptop. I guess I'm a boring person on paper. I wanna learn more about astrology and different religions, I think it's really interesting learning about different culture's beliefs etc.>Are you a busy person or is it okay to contact you whenever?I'm currently studying full time so I am busy sometimes but message me whenever"
   },
   "reply_296475": {
      "reply id": "296475",
      "username": "Anonymous",
      "date posted": "10/16/24 (Wed) 02:48:53 AM",
      "post content": ">ASL21, F, Massachusetts USA>HobbiesI'm a huge fan of painting and making digital art! I like to be active as well, bike riding, weightlifting, hiking, iceskating, swimming! I'm a comp sci student so I also program and go to hackathons. Picrel is a painting I made >Are you a busy person or is it okay to contact you whenever?Contact me whenever and I'll try to respond. I've been busy with work + college and maintaining my hobbies, but if you're interested in talking to me I'll get back to you when I can :0)>Discordtoastman448"
   },
   "reply_296485": {
      "reply id": "296485",
      "username": "Anonymous",
      "date posted": "10/16/24 (Wed) 07:32:21 AM",
      "post content": ">>296044what instruments do you play"
   },
   "reply_296587": {
      "reply id": "296587",
      "username": "Anonymous",
      "date posted": "10/18/24 (Fri) 10:22:22 PM",
      "post content": ">>247615not sure if you are active still but I reached out to you as well, hopefully this isn't too late to receive a response"
   },
   "reply_296637": {
      "reply id": "296637",
      "username": "Anonymous",
      "date posted": "10/22/24 (Tue) 01:48:52 AM",
      "post content": ">>296475I drove through Massachusetts yesterday and the colors were amazing!"
   },
   "reply_296714": {
      "reply id": "296714",
      "username": "Anonymous",
      "date posted": "10/24/24 (Thu) 07:57:54 PM",
      "post content": ">contactpls email @ [email protected], if we can hold a convo on emails I am willing to move to other platforms.>timezonePST>ageearly 20s>preferred range20s-40s>Hobbies & Interests and other detailsAnime & VNs, older games (MS-DOS, Sega Genesis, anything that is 20 years old or more at this point) but I also have played a lot so feel free to elaborate on this point, cats, movies, I try to stay updated with reading books but its sporadic, vehemently anti-tranny, computer/tech stuff, scrapbooking. avid LC user, schizoid i have a very unique music taste and will talk about anything, but recently have been getting into jpop and re-remembering my vocaloid past>Are you a busy person or is it okay to contact you whenever?contact whenever but I do work a full-time job, it would be appreciated if you gave the time and space for me to reply."
   },
   "reply_296825": {
      "reply id": "296825",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 11:00:31 PM",
      "post content": "I live in belgium, would like someone to talk about toxic moidsdisc boubeto"
   },
   "reply_296830": {
      "reply id": "296830",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 08:24:12 AM",
      "post content": ">>296825I wanted to add you but it says you aren’t accepting friend requests.aster.01"
   }
}