{
   "thread number": "116622",
   "original post": "Anonymous 09/08/24 (Sun) 06:58:07 PM116622i hate being fat but at the same time i dont? my body is huge and it makes it hard to fit in and sometimes i feel like being fat makes me stand out a lot (which it probably does) and i really want to lose the weight. but, when trying to lose weight all of the resources are either like, annoying \"hot girl walk\" bs, or just borderline racist ed-having lana del rey girls. like i said, i don't hate myself, so the shaming doesn't really work to motivate me. it's also not really stopping me from getting into a relationship or anything cause i have a guy online that i'm into and he likes me back. i've had sexual experiences but they've all been online (cause im too scared to ever approach a guy irl) and some of which were literally just getting groomed. during marching band, there's girls who are in my section who make fun of each other for \"being fat\" (they aren't) but i never liked them in the first place so i dont really care.  i'm trying to lose weight now, but i'm not really sure that the end goal is totally worth it. i'd kill to be skinnier though, i'd love to be able to say that i'm a size 4 or whatever, but i feel like it'll never happen. idk,,, i guess im just wondering if anyone else feels the same.",
   "reply_116670": {
      "reply id": "reply_116670",
      "content": "Anonymous 09/09/24 (Mon) 09:47:51 AM116670How fat are you exactly? You would certainly feel better if you were slimmer but it is a difficult journey that requires your active participation. It won't just happen for you, you will fail if you're not committed."
   },
   "reply_116942": {
      "reply id": "reply_116942",
      "content": "Anonymous 09/19/24 (Thu) 02:59:23 AM116942Being overweight is unhealthy, so you should want it for the betterment of your health to begin with. Also have all your sexual relationships or experiences have been online? If so then you may want to lose weight because it will help you become more physically attractive so those irl experiences come along as well (whether from an online relationship progressing to offline or otherwise)."
   },
   "reply_118111": {
      "reply id": "reply_118111",
      "content": "Anonymous 10/28/24 (Mon) 11:02:10 PM118111>>116622my god it's like looking in a mirrori was a fat kid for years and the thing that finally worked was when i moved for college and was suddenly too poor to keep snacks in the house and forced to walk to class everydayits miserable in the beginning but you get used to it fast, whenever you wanna go somewhere park far away and walki went from a size 18 to a size 14/size 12 and tbh its been more of a pain than anything, none of my clothes fit and i'm still too poor to buy new onesits worth mentioning the happiest and healthiest i've ever been was when i went to the campus gym every other day and lifted weights. my god lifting weights free your soul. had to stop because i became too busy and i wish i could go back to that. try carving out 30 minutes a day to do some weight curls"
   },
   "reply_118120": {
      "reply id": "reply_118120",
      "content": "Anonymous 10/29/24 (Tue) 08:37:48 PM118120>>118111This is the way to go.If you have the will power you will make it, cut all snacks out of your diet, don't buy them.The biggest enemy is convenience, having food near you is the biggest temptation.I tried to burn the calories off through exercising, but unless you're swimming 5 miles a day it's not gonna work,the easier way is to cut your caloric intake."
   }
}