{
   "thread number": "118105",
   "original post": {
      "post id": "118105",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 07:56:47 PM",
      "post content": "So yes, I have been to therapy because my parents made me go after their divorce. I'm super passive aggressive and kinda insecure and most things feel existentially meaningless to me. I try not to think and I know it will get better. I look mature on the outsidde but on the inside I'm extremely sensitive and fantasize about doing BPDoid shit for pity. My self pity is bad and I need to grow up on the inside. When things go wrong or I get asshurt I think of hurting myself or saying something mean/sad to get sympathy. I'm ASD and have bad communication which even when I try and do all right it's like I'm talking underwater. I think often about yelling and being mean to my BF even though he's never done anything to me. I don't want to tell him either because he's already dealing with a lot. Often I think my friends will betray me and hate me and I frequently think about cutting everyone off. I get jealous of when he talks to people in our friend group even though I know it's right. I've been trying to work on myself, seriously. I know what I get mad about isn't rational but I just want to find someone who can relate here and to give me advice cause IRL or online nobody would really understand. TY!"
   },
   "reply_118107": {
      "reply id": "118107",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 10:03:18 PM",
      "post content": "Is this caused by your obsession towards him?Or you’re just like this in nature?I remember being very mean especially after the 6th grade at school, when everyone was bullying me, and at home my parents-in-law would mentally/economically abuse me (I have an autism pension).Plus everyone around me started to influence me very badly.I’m not going to do a big TL;DR but after meeting this girl online (I’m lesbian) and discovering that she’s very nice towards me.I ultimately decided that I should make drastic changes with mtvlife, and I just accepted it, I hated my “old” past self and I embrace my “newly” forged characteristics.Just for her…Well, after all I’m not entirely sure if you’re mean rn because of old quarrels/traumas that you had back in the days.I think you shall specify more details that they could be useful to give me more info, thus making a full response for this :>Cheers Nona have a good day/night!"
   },
   "reply_118108": {
      "reply id": "118108",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 10:05:29 PM",
      "post content": ">>118107Oh frick, sorry Nona if I did some spelling mistakes!I’m mentally dead and sleepy rn, that’s why."
   },
   "reply_118113": {
      "reply id": "118113",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 11:38:10 PM",
      "post content": ">>118107 I would say im generally kind and have been told  I am but since late childhood ive fantasized about beiny mean. Ive been obsessed with boys before from limerence but he’s the first non limerent love ive had. I dont have any trauma or mental illness or anything. I am working on changing myself for the better even though im doing pretty well. I guess you could say Im a bit obsessed because he’s my first moid and Im kinda anxiously attached. We talk online because he moved, we knew eachother as friends for like half a year. I at first saw him as an older brother but soon realized I loved him. I don’t act mean ever because nothing good would come out of it. but in my head it would feel nice to. I know him talking to friends is good but it makes me angry because in the past ive been left out a lot. I generally just try and distract myself bu doing something productive but it tears at my heart. Sometimes I wish  the entire friend group would hate eachothet. im so sorry that happened to you nona, that’s terrible"
   },
   "reply_118115": {
      "reply id": "118115",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 06:17:37 AM",
      "post content": ">>118113>limerence>obsession towards him because he’s my first darling >I would love to be meany but only in my head>Jealous towards his palsNona… don’t you think that your brain it’s thinking about so many delusional thoughts?I really doubt it’s very healthy for you to do so in the long run imo.You just stress yourself for the pettiest thing and it’s tiring.Speaking for my experience last year I kept having those delusional involuntary thoughts about my girlfriend, because I was really scared that she would leave me or bullcrap like that, in a few words I was obsessed about her because it comforted me from past childhood traumas and I saw her like a big old sister for me that I’ve never had.Being obsessed towards your bf could seem cute and could show a good degree of loyalty, but it’s going only to make him flee faster!Obsession it’s not true love trust me, just try to accept that you can’t control your boyfriend and that these thoughts that you’re having rn are not true and not useful for you.Although I really appreciate that atleast you try to change for the better, at the end of the day, power comes from the will that someone has within himself, isn’t it?Good luck onto that Nona, and I truly hope you feel better rn! :DAnd sorry if you idk found this unhelpful or whatnot D:"
   },
   "reply_118117": {
      "reply id": "118117",
      "username": "Anonymous",
      "date posted": "10/29/24 (Tue) 03:24:33 PM",
      "post content": ">>118115yeah that makes sense. I've been trying to be more aware of my delusional/obsessive thoughts. I think about him and imagine fictional scenarios like nearly every hour. I agree, it's not cute to be obsessive but he said he'd like to be stalked for context he said he wouldn't care if I drVgg3d or r@p3d him(saying it like this cause im on a public library computer lol). I've been trying to distract myself with my newfound autistic interest in 2hu and have been trying to be aware of when I fantasize about being mean in imaginary scenarios."
   }
}