{
   "thread number": "116666",
   "original post": {
      "post id": "116666",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 09:05:30 AM",
      "post content": "What was the most fun/creative date you’ve ever been on?If you've never dated, what are fun/creative dates that you would like to have?"
   },
   "reply_116668": {
      "reply id": "116668",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 09:08:47 AM",
      "post content": "Wanna go to an amusement park for a date. They look cool in movies and TV shows."
   },
   "reply_116675": {
      "reply id": "116675",
      "username": "Anonymous",
      "date posted": "09/09/24 (Mon) 12:57:17 PM",
      "post content": "This was circa 2020, in the throes of corona virus when there was lots of places closed and restrictions on crowds etc. Bf and I got take away food, I baked some slices and we drove to the mountains bordering my city and spent a couple of hours stargazing/teaching ourselves how to take long exposure pics of the Milky Way whilst we had a picnic. He has a Ute so we lay down in the back and watch a few comets go by. Honestly one of the best nights of my life."
   },
   "reply_116712": {
      "reply id": "116712",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 05:23:50 AM",
      "post content": "Does staying home, doing drugs and fucking like rabbits count as a date?"
   },
   "reply_116714": {
      "reply id": "116714",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 08:14:30 AM",
      "post content": "not really creative, but probably the most interesting first date>plan to meet in the city and get a coffee in the morning>have hot chocolate and churos >walk along the foreshore and talk>it starts to rain, he breaks into a construction site so we can wait it out>go hang out in the city, just walking around, taking pictures for my art blog and seeing things>my ribs ache from how much he made me laugh>take a train together>there's a problem with the track so we have to get off and walk to our final stop>run from overzealous security when we take a shortcut>talk about some pretty serious things and I'm kind of exhausted so I'm just honest about my trauma>hold hands and he gives me his backpack to shield myself from another downpour>run into a movie theatre >get some drinks and immediately fall sleep on his shoulder in the dark>he thinks I want to go home and mentions his place is nearby, so walking me back won't be a problem>ask to see his house>shows me his foundry and how he casts objects>teaches me how to do it and he makes me a copy of a famous comando knife for self-defence>gives me the sheath he made for himself and changes the engraved initials for me>talk about movvies and music we like>wants to show me his favourite horror movies, so we share earbuds and walk to the store to buy snacks while listening to music>coming back with some skittles and chips>see a car stall at an intersection and a truck slams into it>5 people flee the truck>he calls an ambulance and helps the injured driver>the hit and runners are caught and the driver is taken to hospital with minor injuries>go back to his house and get a little too drunk>suddenly REALLY want to have sex, but he's worried about me>watch some movies and tell him I should get home>he starts to drive me back, but my dad texts to tell me he's going to a dinner party and won't be home >instead just night drive together and go to some cool places>sees a neighbourhood having roadside collection and shows me how to salvage expensive parts from old devices>get hungry and stop at a rare 24/7 store, but the roof caved in and all the aisles are closed>end up just drinking from a carton of room-temp custard>go to the beach and find an expensive watch with an engraving from a wife>take it to the police station at 1am>go to a park on a hill overlooking the city and talk while we watch the dawn>drive back the my house>invite him inside and eat some cereal on my bed as we listen to music>fall asleep together>wake up to my dad ranting about some inconsiderate neighbour parking in our driveway>hears my bed creak and sees us leave my room together and immediately thinks we had sex>he hastily leaves and we kiss for the first time"
   },
   "reply_116729": {
      "reply id": "116729",
      "username": "Anonymous",
      "date posted": "09/10/24 (Tue) 05:14:25 PM",
      "post content": ">>116666I usually just go on hikes, long walks, and eat out at restaurants or cafes for my dates. Don't know what movie fantasies ya;'ll be living, but count me jelly."
   },
   "reply_118112": {
      "reply id": "118112",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 11:03:15 PM",
      "post content": ">>116666i want to lure and kill a man after having sex"
   }
}