{
   "thread number": "296658",
   "original post": {
      "post id": "296658",
      "username": "Anonymous",
      "date posted": "10/23/24 (Wed) 07:12:53 AM",
      "post content": "Why are humans such cruel animals?"
   },
   "reply_296659": {
      "reply id": "296659",
      "username": "Anonymous",
      "date posted": "10/23/24 (Wed) 07:36:32 AM",
      "post content": ">>296658All animals are cruel. From a gazelle's perspective the lion is cruel for wanting to kill it. From the lion's perspective the gazelle is cruel for making it stave and struggle to feed it's young."
   },
   "reply_296662": {
      "reply id": "296662",
      "username": "Anonymous",
      "date posted": "10/23/24 (Wed) 08:47:27 AM",
      "post content": "We were made by an evil god and put in hell."
   },
   "reply_296667": {
      "reply id": "296667",
      "username": "Anonymous",
      "date posted": "10/23/24 (Wed) 06:24:25 PM",
      "post content": ">>296662It would easily be closer to heaven if the shitty depraved men were deleted from it."
   },
   "reply_296795": {
      "reply id": "296795",
      "username": "Anonymous",
      "date posted": "10/27/24 (Sun) 06:06:37 AM",
      "post content": ">>296659chickens aren't cruel (if you mention the \"they peck each other\" thing they do it because of factory farming conditions)"
   },
   "reply_296796": {
      "reply id": "296796",
      "username": "Anonymous",
      "date posted": "10/27/24 (Sun) 07:44:26 AM",
      "post content": ">>296795But they peck each other even outside of factory farming conditions. Farming just makes this behavior more intense. All animals show intra-species and extra-species aggression, don't be naive and don't paint them as cute babies who never do anything bad unlike evil humans"
   },
   "reply_296814": {
      "reply id": "296814",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 11:52:50 AM",
      "post content": "Because we let moids control the world"
   },
   "reply_296817": {
      "reply id": "296817",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 02:32:37 PM",
      "post content": ">>296796the difference is that chickens don't have empathy or morals, they function based off of instinct, so they just don't understand that pecking each other is wrong. but humans have empathy and are able of going against instinct, so when a human hurts another human, its a moral problem because they should have the ability to control themselves and not do that. so if a human hurts another human its because they choose to do that, uncaring if the victim is in pain etc. but chickens don't have that understanding so it's not malicious. idk if this makes any sense but yeah"
   },
   "reply_296819": {
      "reply id": "296819",
      "username": "Anonymous",
      "date posted": "10/28/24 (Mon) 06:32:00 PM",
      "post content": ">>296795They eat their own eggs all the time"
   }
}